Autodesk.Revit.DB.ParameterTypeId.PlacementTop
"Top"

Autodesk.Revit.DB.ParameterTypeId.PlacementRight
"Right"

Autodesk.Revit.DB.ParameterTypeId.PlacementBottom
"Bottom"

Autodesk.Revit.DB.ParameterTypeId.PlacementLeft
"Left"

Autodesk.Revit.DB.ParameterTypeId.PlacementCenterY
"Center Y"

Autodesk.Revit.DB.ParameterTypeId.PlacementCenterX
"Center X"

Autodesk.Revit.DB.ParameterTypeId.PlacementParamsShow
"Enable Position Parameters"

Autodesk.Revit.DB.ParameterTypeId.ExchangeEntityId
"Exchange Entity ID"

Autodesk.Revit.DB.ParameterTypeId.ExchangeId
"Exchange ID"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailDetailLevel
"Detail Level"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailAngularDimensionTextPosition
"Angle Text Position"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailSegmentLengthDimensionTextPosition
"Dimension Text Position"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailSegmenetRepesentation
"Representation"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailVaryingRebarDimension
"Varying Rebar Set Dimensions"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailRepesentationFor3dBars
"View for 3D Shape"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeAngularDimensionsMeasurement
"Angle Measurement"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeAngularDimensionsForHooksEnabled
"Hook Angles"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeBendDiameterDimensionsForHooksEnabled
"Hook Bends"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled
"Segment Bends"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeShowBarBendingUsing
"Dimension Type"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeDiameterDimensionTypeId
"Diameter Dimension Style"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeRadialDimensionTypeId
"Radial Dimension Style"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeBendDiameterDimensionsEnabled
"Bend Diameter Dimensions"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeAngularDimensionOffset
"Angular Dimension Offset"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeShowAngularDimensionsFor
"Show for Angles"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeAngularDimensionTypeId
"Angular Dimension Style"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeAngularDimensionsEnabled
"Angular Dimensions"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeOrthogonalAndOverallDimesionsEnabled
"Other Dimensions"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthDimensionsForHooksEnabled
"Hook Lengths"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthDimensionsOffset
"Dimension Offset"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthsDisplayOption
"Straight Segment Lengths"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthsForArcsDisplayOption
"Arc Segment Lengths"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthDimensionTypeId
"Linear Dimension Style"

Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthDimensionsEnabled
"Segment Length Dimensions"

Autodesk.Revit.DB.ParameterTypeId.LoadIsConstrainedOnHost
"Is constrained on host"

Autodesk.Revit.DB.ParameterTypeId.RebarAlignmentOptions
"Bar Alignment"

Autodesk.Revit.DB.ParameterTypeId.ScheduleRowHeightInput
"Row Height"

Autodesk.Revit.DB.ParameterTypeId.ScheduleResizeRows
"Resize Rows"

Autodesk.Revit.DB.ParameterTypeId.ScheduleRotationOnSheet
"Rotation on Sheet"

Autodesk.Revit.DB.ParameterTypeId.LayerElemScheduleFamily
"Family"

Autodesk.Revit.DB.ParameterTypeId.LayerElemIsVariable
"Is Variable"

Autodesk.Revit.DB.ParameterTypeId.LayerElemIsStructuralMaterial
"Is Structural Material"

Autodesk.Revit.DB.ParameterTypeId.LayerElemIsCoreLayer
"Is Core Layer"

Autodesk.Revit.DB.ParameterTypeId.LayerElemCompoundElemType
"Compound Element Type"

Autodesk.Revit.DB.ParameterTypeId.LayerElemCompoundElemFamily
"Compound Element Family"

Autodesk.Revit.DB.ParameterTypeId.SsePointElevationBaseType
"Elevation Base Type"

Autodesk.Revit.DB.ParameterTypeId.SsePointElevation
"Elevation"

Autodesk.Revit.DB.ParameterTypeId.SsePointOffsetFromSurface
"Offset from Surface"

Autodesk.Revit.DB.ParameterTypeId.SsePointBasetypeEnum
"Point Base Type"

Autodesk.Revit.DB.ParameterTypeId.ToposolidContourSubcategoryId
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.ToposolidContourDisplaySettingsIdParam
"Contour Display"

Autodesk.Revit.DB.ParameterTypeId.ToposolidSubdivideMaterial
"Material"

Autodesk.Revit.DB.ParameterTypeId.ToposolidSubdivideHeignt
"Sub-divide Height"

Autodesk.Revit.DB.ParameterTypeId.ToposolidInheritContours
"Inherit Contours"

Autodesk.Revit.DB.ParameterTypeId.ToposolidFunctionParam
"Function"

Autodesk.Revit.DB.ParameterTypeId.PreferPatternAlignUiFilter
"Pattern:": This is used by the UI to allow to select the preferred preference of aligning pattern.

Autodesk.Revit.DB.ParameterTypeId.ToposolidElevationAtTop
"Elevation at Top"

Autodesk.Revit.DB.ParameterTypeId.ToposolidElevationAtBottom
"Elevation at Bottom"

Autodesk.Revit.DB.ParameterTypeId.ToposolidStructureIdParam
"Structure"

Autodesk.Revit.DB.ParameterTypeId.LowestAssociatedLevel
"Lowest Associated Level": The lowest level associated with this Analytical Element.

Autodesk.Revit.DB.ParameterTypeId.HighestAssociatedLevel
"Highest Associated Level": The highest level associated with this Analytical Element.

Autodesk.Revit.DB.ParameterTypeId.ToposolidHeightabovelevelParam
"Height Offset From Level"

Autodesk.Revit.DB.ParameterTypeId.ToposolidAttrThicknessParam
"Thickness"

Autodesk.Revit.DB.ParameterTypeId.ToposolidTypeDefaultThicknessParam
"Default Thickness"

Autodesk.Revit.DB.ParameterTypeId.OffsetFromReferenceBase
"Offset from Reference Base"

Autodesk.Revit.DB.ParameterTypeId.ReferenceBaseOnHost
"Reference Base on Host"

Autodesk.Revit.DB.ParameterTypeId.OvalFramingHeight
"Oval Height"

Autodesk.Revit.DB.ParameterTypeId.OvalFramingWidth
"Oval Width"

Autodesk.Revit.DB.ParameterTypeId.CircularFramingDiameter
"Circular Diameter"

Autodesk.Revit.DB.ParameterTypeId.LinearFramingLength
"Length"

Autodesk.Revit.DB.ParameterTypeId.FramingShapeClassification
"Framing Shape"

Autodesk.Revit.DB.ParameterTypeId.StiffenerClassification
"Classification"

Autodesk.Revit.DB.ParameterTypeId.FamilySelfOrienting
"Align to View"

Autodesk.Revit.DB.ParameterTypeId.CouplerRotationAngle
"Coupler Rotation"

Autodesk.Revit.DB.ParameterTypeId.PreferDimSideUiFilter
"Prefer:": This is used by the UI to allow select prefer dimension side.

Autodesk.Revit.DB.ParameterTypeId.MultipleAlignmentUiToggle
"Multiple Alignment": This is used by the UI to allow selection of multiple elements.

Autodesk.Revit.DB.ParameterTypeId.LockAlignmentUiToggle
"Lock": This is used by the UI to allow selection of lock alignment.

Autodesk.Revit.DB.ParameterTypeId.LayerElemBaseExtensionDis
"Base Extension Distance"

Autodesk.Revit.DB.ParameterTypeId.LayerElemTopExtensionDis
"Top Extension Distance"

Autodesk.Revit.DB.ParameterTypeId.LayerElemFunction
"Function": Function

Autodesk.Revit.DB.ParameterTypeId.LayerElemMaterials
"Material": Material

Autodesk.Revit.DB.ParameterTypeId.LayerElemThickness
"Thickness": Thickness

Autodesk.Revit.DB.ParameterTypeId.LayerElemAreaComputed
"Area"

Autodesk.Revit.DB.ParameterTypeId.LayerElemOffsetFromHost
"Offset From Host"

Autodesk.Revit.DB.ParameterTypeId.LayerElemVolumeComputed
"Volume"

Autodesk.Revit.DB.ParameterTypeId.LayerTypeMaterials
"Material": Material

Autodesk.Revit.DB.ParameterTypeId.LayerTypeThickness
"Thickness": Thickness

Autodesk.Revit.DB.ParameterTypeId.LayerElemBaseConstraint
"Base Constraint"

Autodesk.Revit.DB.ParameterTypeId.LayerElemTopConstraint
"Top Constraint"

Autodesk.Revit.DB.ParameterTypeId.RebarInstanceBarModelDiameter
"Model Bar Diameter"

Autodesk.Revit.DB.ParameterTypeId.RebarModelBarDiameter
"Model Bar Diameter"

Autodesk.Revit.DB.ParameterTypeId.ViewShowGrids
"Show Grids"

Autodesk.Revit.DB.ParameterTypeId.RebarModifiedSet
"Modified Rebar Set"

Autodesk.Revit.DB.ParameterTypeId.MovesWithGridParam
"Moves With Grids": Disable attachment from grids.

Autodesk.Revit.DB.ParameterTypeId.DpartLayerIndex
"Layer Index"

Autodesk.Revit.DB.ParameterTypeId.VoidCutsGeometry
"Cuts Geometry"

Autodesk.Revit.DB.ParameterTypeId.RebarHookRotationAtEndSchedulesTagsFilters
"Hook Rotation At End"

Autodesk.Revit.DB.ParameterTypeId.RebarHookRotationAtStartSchedulesTagsFilters
"Hook Rotation At Start"

Autodesk.Revit.DB.ParameterTypeId.RebarHookLengthOverride
"Override Hook Lengths"

Autodesk.Revit.DB.ParameterTypeId.InfrastructureAlignmentName
"Name"

Autodesk.Revit.DB.ParameterTypeId.InfrastructureAlignmentDescription
"Description"

Autodesk.Revit.DB.ParameterTypeId.InfrastructureAlignmentDisplayedStartStation
"Displayed Start Station"

Autodesk.Revit.DB.ParameterTypeId.InfrastructureAlignmentDisplayedEndStation
"Displayed End Station"

Autodesk.Revit.DB.ParameterTypeId.AssemblyPrecastFreeze
"Disable Precast Updates"

Autodesk.Revit.DB.ParameterTypeId.RebarHookRotationAtEnd
"Hook Rotation At End"

Autodesk.Revit.DB.ParameterTypeId.RebarHookRotationAtStart
"Hook Rotation At Start"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeHookRotationAtEnd
"Hook Rotation At End"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeHookRotationAtStart
"Hook Rotation At Start"

Autodesk.Revit.DB.ParameterTypeId.PathOfTravelFromRoom
"From Room"

Autodesk.Revit.DB.ParameterTypeId.PathOfTravelToRoom
"To Room"

Autodesk.Revit.DB.ParameterTypeId.RbsElecAnalyticalTotalCoincidentLoad
"Total Coincident Loads"

Autodesk.Revit.DB.ParameterTypeId.RbsElecNumberOfCircuits
"Max Number of Circuits"

Autodesk.Revit.DB.ParameterTypeId.SteelElemProfileVolume
"Volume"

Autodesk.Revit.DB.ParameterTypeId.SteelElemProfileLength
"Length"

Autodesk.Revit.DB.ParameterTypeId.SteelElemProfileType
"Profile Type"

Autodesk.Revit.DB.ParameterTypeId.RbsElecEditCircuitNamingSettingsParam
"Circuit Naming Settings"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateJustification
"Justification"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPlatePaintArea
"Paint Area"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateExactWeight
"Exact Weight"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateWeight
"Weight"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateVolume
"Volume"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateArea
"Area"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateWidth
"Width"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateLength
"Length"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateType
"Type"

Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltTotalWeight
"Total Weight"

Autodesk.Revit.DB.ParameterTypeId.SteelElemShearstudTotalWeight
"Total Weight"

Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorTotalWeight
"Total Weight"

Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorOrientation
"Anchor Orientation"

Autodesk.Revit.DB.ParameterTypeId.SteelElemCutLength
"Cut Length"

Autodesk.Revit.DB.ParameterTypeId.SteelElemExactWeight
"Exact Weight"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPaintArea
"Paint Area"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeight
"Weight"

Autodesk.Revit.DB.ParameterTypeId.PathOfTravelSpeed
"Speed"

Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltLocation
"Location"

Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltFinishCalculationAtGap
"Finish Calculation At Gap"

Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltInverted
"Inverted"

Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltGripLengthIncrease
"Grip Length Increase"

Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltGripLength
"Grip Length"

Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltLength
"Bolt Length"

Autodesk.Revit.DB.ParameterTypeId.GenericZoneName
"Name"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeBottomElevation
"Lower End Bottom Elevation"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeTopElevation
"Upper End Top Elevation"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelFeedThruLugsCurrentPhasec
"Feed Through Lugs Current Phase C"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelFeedThruLugsCurrentPhaseb
"Feed Through Lugs Current Phase B"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelFeedThruLugsCurrentPhasea
"Feed Through Lugs Current Phase A"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelFeedThruLugsApparentLoadPhasec
"Feed Through Lugs Apparent Load Phase C"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelFeedThruLugsApparentLoadPhaseb
"Feed Through Lugs Apparent Load Phase B"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelFeedThruLugsApparentLoadPhasea
"Feed Through Lugs Apparent Load Phase A"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelBranchCircuitCurrentPhasec
"Branch Circuit Current Phase C"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelBranchCircuitCurrentPhaseb
"Branch Circuit Current Phase B"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelBranchCircuitCurrentPhasea
"Branch Circuit Current Phase A"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelBranchCircuitApparentLoadPhasec
"Branch Circuit Apparent Load Phase C"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelBranchCircuitApparentLoadPhaseb
"Branch Circuit Apparent Load Phase B"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelBranchCircuitApparentLoadPhasea
"Branch Circuit Apparent Load Phase A"

Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleDefinition
"Hole Definition"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelFeedThruLugsParam
"Feed Through Lugs"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitNumberingType
"Circuit Numbering Option"

Autodesk.Revit.DB.ParameterTypeId.TagOnPlacementUi
"Tag on Placement"

Autodesk.Revit.DB.ParameterTypeId.RouteAnalysisSettingsParam
"Route Analysis Settings"

Autodesk.Revit.DB.ParameterTypeId.PathOfTravelViewName
"View Name"

Autodesk.Revit.DB.ParameterTypeId.PathOfTravelLevelName
"Level"

Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionOverrideType
"Override by Instance"

Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionEditType
"Modify Parameters"

Autodesk.Revit.DB.ParameterTypeId.PathOfTravelTime
"Time"

Autodesk.Revit.DB.ParameterTypeId.SteelElemZclipType
"Boundary"

Autodesk.Revit.DB.ParameterTypeId.SteelElemCopeAroundAxis
"Around beam axis"

Autodesk.Revit.DB.ParameterTypeId.SteelElemCopeAxisAngle
"Tilt angle"

Autodesk.Revit.DB.ParameterTypeId.SteelElemCopeZAngle
"Plan rotation"

Autodesk.Revit.DB.ParameterTypeId.SteelElemCopeXAngle
"Cross-section rotation"

Autodesk.Revit.DB.ParameterTypeId.SteelElemCopeDistanceAxis
"Distance from axis"

Autodesk.Revit.DB.ParameterTypeId.SteelElemCopeWidthx
"Cutback"

Autodesk.Revit.DB.ParameterTypeId.SteelElemYDistance
"Side 2"

Autodesk.Revit.DB.ParameterTypeId.SteelElemXDistance
"Side 1"

Autodesk.Revit.DB.ParameterTypeId.SteelElemCutType
"Type"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateShortenCutstraight
"Cut straight"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateShortenSuction
"Suction"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateShortenAngle
"Angle"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldPrefix
"Prefix"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldTextModule
"Text module"

Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleDepthOfBoltHead
"Depth of bolt head"

Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleTapping
"Right-handed thread"

Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleBackTaperThread
"Back taper thread"

Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleTappingHole
"Tapping hole"

Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleHeadDiameter
"Head diameter"

Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleAngle
"Chamfer angle"

Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleAlpha
"Taper Angle"

Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleDepth
"Hole Depth"

Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleSlotDirection
"Along side 1"

Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleSlotLength
"Length of the slot"

Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleType
"Type"

Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleDiameter
"Diameter"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternNumber
"Number"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternRadius
"Radius"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternEdgeDistanceY
"Edge distance on side 2"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternEdgeDistanceX
"Edge distance on side 1"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternIntermediateDistanceY
"Intermediate distance on side 2"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternIntermediateDistanceX
"Intermediate distance on side 1"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternTotalWidth
"Length on side 2"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternTotalLength
"Length on side 1"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternNumberY
"Number on side 2"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternNumberX
"Number on side 1"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoublePrepdepth
"Double Preparation Depth"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoubleEffectivethroat
"Double Effective Throat"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoubleRootopening
"Double Root Opening"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoubleWeldprep
"Double Weld preparation"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoubleSurfaceshape
"Double Surface Shape"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoubleText
"Double Text"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoubleThickness
"Double Thickness"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoubleType
"Double Type"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainPrepdepth
"Main Preparation Depth"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainEffectivethroat
"Main Effective Throat"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainRootopening
"Main Root Opening"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainWeldprep
"Main Weld preparation"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainSurfaceshape
"Surface Shape"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainText
"Main Text"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldPitch
"Pitch"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldContinuous
"Continuous"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldLocation
"Location"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldLength
"Length"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainThickness
"Main Thickness"

Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainType
"Main Type"

Autodesk.Revit.DB.ParameterTypeId.SteelElemParamBoringout
"Boring out"

Autodesk.Revit.DB.ParameterTypeId.SteelElemParamRadius
"Radius"

Autodesk.Revit.DB.ParameterTypeId.SteelElemContourSide2dist
"Boundary distance 2"

Autodesk.Revit.DB.ParameterTypeId.SteelElemContourSide1dist
"Boundary distance 1"

Autodesk.Revit.DB.ParameterTypeId.SteelElemContourGapWidth
"Gap Width"

Autodesk.Revit.DB.ParameterTypeId.SteelElemShortenAnglez
"Angle along width"

Autodesk.Revit.DB.ParameterTypeId.SteelElemShortenAngley
"Angle along height"

Autodesk.Revit.DB.ParameterTypeId.SteelElemShortenReflength
"Length"

Autodesk.Revit.DB.ParameterTypeId.SteelElemShearstudLength
"Length"

Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltCoating
"Coating"

Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorLength
"Length"

Autodesk.Revit.DB.ParameterTypeId.SteelElemShearstudDiameter
"Diameter"

Autodesk.Revit.DB.ParameterTypeId.SteelElemShearstudGrade
"Grade"

Autodesk.Revit.DB.ParameterTypeId.SteelElemShearstudStandard
"Standard"

Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorDiameter
"Diameter"

Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorAssembly
"Assembly"

Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorGrade
"Grade"

Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorStandard
"Standard"

Autodesk.Revit.DB.ParameterTypeId.SteelElemCoating
"Coating"

Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltDiameter
"Diameter"

Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltAssembly
"Assembly"

Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltGrade
"Grade"

Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltStandard
"Standard"

Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateThickness
"Thickness"

Autodesk.Revit.DB.ParameterTypeId.RebarWorkshopInstructions
"Workshop Instructions"

Autodesk.Revit.DB.ParameterTypeId.RebarGeometryType
"Geometry"

Autodesk.Revit.DB.ParameterTypeId.BasepointLatitudeParam
"Lat"

Autodesk.Revit.DB.ParameterTypeId.BasepointLongitudeParam
"Lon"

Autodesk.Revit.DB.ParameterTypeId.RebarFreeFormHookEndPlaneAngle
"Hook Orientation At End"

Autodesk.Revit.DB.ParameterTypeId.RebarFreeFormHookStartPlaneAngle
"Hook Orientation At Start"

Autodesk.Revit.DB.ParameterTypeId.RoomOutdoorAirflowParam
"Outdoor Airflow"

Autodesk.Revit.DB.ParameterTypeId.RoomOutdoorAirflowStandardParam
"Outdoor Air Method"

Autodesk.Revit.DB.ParameterTypeId.Directcontext3dSourceId
"Path"

Autodesk.Revit.DB.ParameterTypeId.Directcontext3dApplicationId
"ApplicationId"

Autodesk.Revit.DB.ParameterTypeId.Directcontext3dLoaded
"Loaded"

Autodesk.Revit.DB.ParameterTypeId.Directcontext3dServerId
"ServerId"

Autodesk.Revit.DB.ParameterTypeId.Directcontext3dName
"Name"

Autodesk.Revit.DB.ParameterTypeId.RoomAirChangesPerHourParam
"Air Changes per Hour"

Autodesk.Revit.DB.ParameterTypeId.RoomOutdoorAirPerAreaParam
"Outdoor Air per Area"

Autodesk.Revit.DB.ParameterTypeId.RoomOutdoorAirPerPersonParam
"Outdoor Air per Person"

Autodesk.Revit.DB.ParameterTypeId.RoomOutdoorAirInfoParam
"Outdoor Air Information"

Autodesk.Revit.DB.ParameterTypeId.RebarInternalMultiplanarArcConnector
"INTERNAL: Multiplanar Arc Connector"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeEndtreatmentEndType
"End Treatment At End"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeEndtreatmentStartType
"End Treatment At Start"

Autodesk.Revit.DB.ParameterTypeId.RebarElemEndtreatmentEnd
"End Treatment At End"

Autodesk.Revit.DB.ParameterTypeId.RebarElemEndtreatmentStart
"End Treatment At Start"

Autodesk.Revit.DB.ParameterTypeId.EndTreatment
"End Treatment"

Autodesk.Revit.DB.ParameterTypeId.CouplerCoupledEndtreatment
"End Treatment 2"

Autodesk.Revit.DB.ParameterTypeId.CouplerMainEndtreatment
"End Treatment 1"

Autodesk.Revit.DB.ParameterTypeId.CouplerWidth
"External Diameter"

Autodesk.Revit.DB.ParameterTypeId.CouplerMark
"Schedule Mark"

Autodesk.Revit.DB.ParameterTypeId.FamilyFreeinstDefaultElevation
"Default Elevation"

Autodesk.Revit.DB.ParameterTypeId.CouplerCoupledEngagement
"Bar Engagement 2"

Autodesk.Revit.DB.ParameterTypeId.CouplerMainEngagement
"Bar Engagement 1"

Autodesk.Revit.DB.ParameterTypeId.CouplerLength
"Total Length"

Autodesk.Revit.DB.ParameterTypeId.CouplerWeight
"Mass"

Autodesk.Revit.DB.ParameterTypeId.CouplerNumber
"Coupler Number"

Autodesk.Revit.DB.ParameterTypeId.CouplerQuantity
"Quantity"

Autodesk.Revit.DB.ParameterTypeId.CouplerCoupledBarSize
"Bar Size 2"

Autodesk.Revit.DB.ParameterTypeId.CouplerMainBarSize
"Bar Size 1"

Autodesk.Revit.DB.ParameterTypeId.CouplerCode
"Part Number"

Autodesk.Revit.DB.ParameterTypeId.MultistoryStairsActualTreadDepth
"Actual Tread Depth"

Autodesk.Revit.DB.ParameterTypeId.MultistoryStairsRefLevel
"Reference Level": The reference level of stairs

Autodesk.Revit.DB.ParameterTypeId.RebarElemHostMark
"Host Mark"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeImage
"Shape Image"

Autodesk.Revit.DB.ParameterTypeId.FabricNumber
"Fabric Number"

Autodesk.Revit.DB.ParameterTypeId.RebarNumber
"Rebar Number"

Autodesk.Revit.DB.ParameterTypeId.GraphicDisplayOptionsSketchyLines
"Sketchy Lines"

Autodesk.Revit.DB.ParameterTypeId.NumberPartitionParam
"Partition"

Autodesk.Revit.DB.ParameterTypeId.ViewShowHiddenLines
"Show Hidden Lines"

Autodesk.Revit.DB.ParameterTypeId.RbsElecAnalyticalArea
"Area"

Autodesk.Revit.DB.ParameterTypeId.RbsElecAnalyticalLoadsInSet
"Loads in Set"

Autodesk.Revit.DB.ParameterTypeId.RbsElecAnalyticalLoadSetOnStandby
"Quantity on Standby"

Autodesk.Revit.DB.ParameterTypeId.RbsElecAnalyticalLoadSetOnDuty
"Quantity of Prime"

Autodesk.Revit.DB.ParameterTypeId.RbsElecDistributionNodeLoadSet
"Load Set"

Autodesk.Revit.DB.ParameterTypeId.RbsElecDistributionNodeSupplyTo
"Supply To"

Autodesk.Revit.DB.ParameterTypeId.RbsElecAnalyticalFeederLength
"Length"

Autodesk.Revit.DB.ParameterTypeId.RbsElecAnalyticalLevelId
"Level"

Autodesk.Revit.DB.ParameterTypeId.RbsElecApparentPowerDensity
"Apparent Power Density"

Autodesk.Revit.DB.ParameterTypeId.RbsElecDistributionNodeSupplyFrom2
"Supply From 2"

Autodesk.Revit.DB.ParameterTypeId.RbsElecDistributionNodeSupplyFrom
"Supply From"

Autodesk.Revit.DB.ParameterTypeId.RbsElecDistributionNodeSupplyFrom1
"Supply From 1"

Autodesk.Revit.DB.ParameterTypeId.RbsElecAnalyticalLoadSetOnTotal
"Total Quantity"

Autodesk.Revit.DB.ParameterTypeId.RbsElecAnalyticalLoadNameParam
"Name"

Autodesk.Revit.DB.ParameterTypeId.RbsElecAnalyticalLoadTypeParam
"Load Type"

Autodesk.Revit.DB.ParameterTypeId.RbsAreaBasedLoadType
"Area Based Load Type"

Autodesk.Revit.DB.ParameterTypeId.RbsElecAnalyticalLoadDensity
"Power Density"

Autodesk.Revit.DB.ParameterTypeId.MepElecZoneEquipmentType
"Equipment Type"

Autodesk.Revit.DB.ParameterTypeId.MepZoneEquipmentDrawVentilation
"Draw Ventilation"

Autodesk.Revit.DB.ParameterTypeId.MepVrfLoop
"Variable Refrigerant Flow Loop"

Autodesk.Revit.DB.ParameterTypeId.MepReheatHotwaterLoop
"Reheat Hot Water Loop"

Autodesk.Revit.DB.ParameterTypeId.MepZoneEquipment
"Zone Equipment"

Autodesk.Revit.DB.ParameterTypeId.MepAnalyticalEquipmentName
"Name"

Autodesk.Revit.DB.ParameterTypeId.MepZoneHotwaterLoop
"Heating Hot Water Loop"

Autodesk.Revit.DB.ParameterTypeId.MepZoneAirLoop
"Air System"

Autodesk.Revit.DB.ParameterTypeId.MepReheatCoilType
"Reheat Coil"

Autodesk.Revit.DB.ParameterTypeId.MepZoneEquipmentBehavior
"Behavior"

Autodesk.Revit.DB.ParameterTypeId.MepZoneEquipmentType
"Equipment Type"

Autodesk.Revit.DB.ParameterTypeId.MepAirloopFantype
"Fan"

Autodesk.Revit.DB.ParameterTypeId.MepChilledWaterLoop
"Chilled Water Loop"

Autodesk.Revit.DB.ParameterTypeId.MepCoolingCoilType
"Cooling Coil"

Autodesk.Revit.DB.ParameterTypeId.MepHeatingHotwaterLoop
"Heating Hot Water Loop"

Autodesk.Revit.DB.ParameterTypeId.MepHeatingCoilType
"Heating Coil"

Autodesk.Revit.DB.ParameterTypeId.MepPreheatHotwaterLoop
"Preheat Hot Water Loop"

Autodesk.Revit.DB.ParameterTypeId.MepAirloopPreheatCoiltype
"Preheat Coil"

Autodesk.Revit.DB.ParameterTypeId.MepAirloopHeatexchangerType
"Heat Exchanger"

Autodesk.Revit.DB.ParameterTypeId.MepCondenserWaterLoop
"Condenser Water Loop"

Autodesk.Revit.DB.ParameterTypeId.MepWaterloopChillertype
"Chiller Type"

Autodesk.Revit.DB.ParameterTypeId.MepWaterloopType
"Loop Type"

Autodesk.Revit.DB.ParameterTypeId.MepAnalyticalLoopName
"Name"

Autodesk.Revit.DB.ParameterTypeId.MepAnalyticalElecCurrent
"Current"

Autodesk.Revit.DB.ParameterTypeId.MepAnalyticalElecVoltage
"Voltage"

Autodesk.Revit.DB.ParameterTypeId.MepAnalyticalElecCurrentRating
"Current Rating"

Autodesk.Revit.DB.ParameterTypeId.SystemEquipmentSets
"Equipment Sets"

Autodesk.Revit.DB.ParameterTypeId.MepIgnoreFlowAnalysis
"Ignore Flow Analysis"

Autodesk.Revit.DB.ParameterTypeId.MepAnalyticalLoopBoundaryParam
"Loop Boundary"

Autodesk.Revit.DB.ParameterTypeId.MechanicalEquipmentSetIdParam
"Mechanical Equipment Set"

Autodesk.Revit.DB.ParameterTypeId.MechanicalEquipmentSetName
"Name"

Autodesk.Revit.DB.ParameterTypeId.MechanicalEquipmentSetOnStandby
"On Standby"

Autodesk.Revit.DB.ParameterTypeId.MechanicalEquipmentSetOnDuty
"On Duty"

Autodesk.Revit.DB.ParameterTypeId.MepAnalyticalCriticalpathParam
"Critical Path"

Autodesk.Revit.DB.ParameterTypeId.MepAnalyticalPipeDesignflow
"Design Flow"

Autodesk.Revit.DB.ParameterTypeId.MepEquipmentCalcPipingpressuredropParam
"Calculated Pressure Drop"

Autodesk.Revit.DB.ParameterTypeId.MepEquipmentCalcPipingflowParam
"Calculated Flow"

Autodesk.Revit.DB.ParameterTypeId.MepEquipmentClassification
"Classification"

Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionInputElements
"Input Elements"

Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionNobleStatus
"Noble Status"

Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionCodeCheckingStatus
"Code Checking Status"

Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionApprovalStatus
"Approval Status"

Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionModifyConnectionParameters
"Detailed Parameters"

Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionSymbol
"Connection Symbol"

Autodesk.Revit.DB.ParameterTypeId.AllModelImage
"Image"

Autodesk.Revit.DB.ParameterTypeId.AllModelTypeImage
"Type Image"

Autodesk.Revit.DB.ParameterTypeId.StructFramJoinStatus
"Join Status"

Autodesk.Revit.DB.ParameterTypeId.ReferencedView
"Referenced View": The view referenced by a section or callout.

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisAdvancedOptions
"Other Options"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisMode
"Mode"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution
"Analytical Surface Resolution"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution
"Analytical Space Resolution"

Autodesk.Revit.DB.ParameterTypeId.FamilyRoundconnectorDimensiontype
"Round Connector Dimension"

Autodesk.Revit.DB.ParameterTypeId.FamProfileDefinition
"Profile Definition"

Autodesk.Revit.DB.ParameterTypeId.EndZOffsetValue
"End z Offset Value"

Autodesk.Revit.DB.ParameterTypeId.EndZJustification
"End z Justification"

Autodesk.Revit.DB.ParameterTypeId.EndYOffsetValue
"End y Offset Value"

Autodesk.Revit.DB.ParameterTypeId.EndYJustification
"End y Justification"

Autodesk.Revit.DB.ParameterTypeId.StartZOffsetValue
"Start z Offset Value"

Autodesk.Revit.DB.ParameterTypeId.StartZJustification
"Start z Justification"

Autodesk.Revit.DB.ParameterTypeId.StartYOffsetValue
"Start y Offset Value"

Autodesk.Revit.DB.ParameterTypeId.StartYJustification
"Start y Justification"

Autodesk.Revit.DB.ParameterTypeId.ZOffsetValue
"z Offset Value"

Autodesk.Revit.DB.ParameterTypeId.ZJustification
"z Justification"

Autodesk.Revit.DB.ParameterTypeId.YOffsetValue
"y Offset Value"

Autodesk.Revit.DB.ParameterTypeId.YJustification
"y Justification"

Autodesk.Revit.DB.ParameterTypeId.YzJustification
"yz Justification"

Autodesk.Revit.DB.ParameterTypeId.EndJoinCutback
"End Join Cutback"

Autodesk.Revit.DB.ParameterTypeId.StartJoinCutback
"Start Join Cutback"

Autodesk.Revit.DB.ParameterTypeId.EndExtension
"End Extension"

Autodesk.Revit.DB.ParameterTypeId.StartExtension
"Start Extension"

Autodesk.Revit.DB.ParameterTypeId.DivisionSketchCurveDivisionParamsOverrideParam
"Profile Override"

Autodesk.Revit.DB.ParameterTypeId.DivisionSketchCurveExtentdToSilhParam
"Extend to Silhouette"

Autodesk.Revit.DB.ParameterTypeId.DivisionRuleParam
"Division Rule"

Autodesk.Revit.DB.ParameterTypeId.PatternMirrorForDivisionRule
"Mirror"

Autodesk.Revit.DB.ParameterTypeId.AllGridRotationForDivisionRule
"All Grid Rotation"

Autodesk.Revit.DB.ParameterTypeId.PatternIndent2ForDivisionRule
"Indent 2"

Autodesk.Revit.DB.ParameterTypeId.PatternIndent1ForDivisionRule
"Indent 1"

Autodesk.Revit.DB.ParameterTypeId.DivisionPattern
"Division Pattern"

Autodesk.Revit.DB.ParameterTypeId.DpartShapeModified
"Shape is modified"

Autodesk.Revit.DB.ParameterTypeId.DpartExcluded
"Excluded"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelManuallyAdjusted
"Manually Adjusted"

Autodesk.Revit.DB.ParameterTypeId.PropertySetKeywords
"Keywords"

Autodesk.Revit.DB.ParameterTypeId.MaterialAssetParamSourceUrl
"Source URL"

Autodesk.Revit.DB.ParameterTypeId.MaterialAssetParamSource
"Source"

Autodesk.Revit.DB.ParameterTypeId.MaterialAssetParamExternalMaterialId
"External Material ID"

Autodesk.Revit.DB.ParameterTypeId.MaterialAssetParamCommonSharedAsset
"Sharing"

Autodesk.Revit.DB.ParameterTypeId.MaterialAssetParamAssetLibId
"Asset library id"

Autodesk.Revit.DB.ParameterTypeId.DpartBaseLevelByOriginal
"Base Level By Original"

Autodesk.Revit.DB.ParameterTypeId.DpartBaseLevel
"Base Level"

Autodesk.Revit.DB.ParameterTypeId.PointAdaptiveNumParam
"Number"

Autodesk.Revit.DB.ParameterTypeId.PointAdaptiveShowNumber
"Show Placement Number"

Autodesk.Revit.DB.ParameterTypeId.PointAdaptiveConstrained
"Constrained"

Autodesk.Revit.DB.ParameterTypeId.PointAdaptiveOrientationType
"Orients to"

Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamElectricalResistivity
"Electrical Resistivity"

Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamReflectivity
"Reflectivity"

Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamPorosity
"Porosity"

Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamPermeability
"Permeability"

Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamTransmitsLight
"Transmits Light"

Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamVaporPressure
"Vapor Pressure"

Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamSpecificHeatOfVaporization
"Specific Heat of Vaporization"

Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamLiquidViscosity
"Liquid Viscosity"

Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamCompressibility
"Compressibility"

Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamGasViscosity
"Gas Viscosity"

Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamEmissivity
"Emissivity"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamWoodConstruction
"Construction"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamFivepercentModulusOfElacticity
"5% Modulus of Elasticity"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamAverageModulus
"Average Modulus"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamTensionPerpendicular
"Tension Perpendicular to Grain"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamTensionParallel
"Tension Parallel to Grain"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamStructuralThermalTreated
"Thermally Treated"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamStructuralDensity
"Density"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamStructuralSpecificHeat
"Specific Heat"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamThermalConductivityZ
"Thermal Conductivity Z"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamThermalConductivityY
"Thermal Conductivity Y"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamThermalConductivityX
"Thermal Conductivity X"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamThermalConductivity
"Thermal Conductivity"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamExpCoeffn2
"Thermal Expansion Coefficient 2"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamExpCoeffn1
"Thermal Expansion Coefficient 1"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamShearMod12
"Shear Modulus 12"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamPoissonMod23
"Poisson Ratio 23"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamPoissonMod12
"Poisson Ratio 12"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamYoungModn2
"Young's Modulus 2"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamYoungModn1
"Young's Modulus 1"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingPlacementOffset
"Offset from Path"

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeRiserIsSlanted
"Slanted"

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeRiser
"Riser"

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeNosingPlacement
"Apply Nosing Profile"

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeRiserProfile
"Riser Profile"

Autodesk.Revit.DB.ParameterTypeId.TerminationExtensionLength
"Extension Length"

Autodesk.Revit.DB.ParameterTypeId.SupportHeight
"Height"

Autodesk.Revit.DB.ParameterTypeId.SupportHandClearance
"Hand Clearance"

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeTreadProfile
"Tread Profile"

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeRiserMaterial
"Riser Material"

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeTreadMaterial
"Tread Material"

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeRiserTreadConnection
"Riser To Tread Connection"

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeRiserThickness
"Riser Thickness"

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeRiserStyle
"Riser Type": (OBSOLETE)

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeBackNosing
"Back Nosing": (OBSOLETE)

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeLeftNosing
"Left Nosing": (OBSOLETE)

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeRightNosing
"Right Nosing": (OBSOLETE)

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeFrontNosing
"Front Nosing": (OBSOLETE)

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeNosingLength
"Nosing Length"

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeNosingProfile
"Nosing Profile"

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeTreadThickness
"Tread Thickness"

Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeTread
"Tread"

Autodesk.Revit.DB.ParameterTypeId.StairsTriserRiserMark
"Riser Mark": (OBSOLETE)

Autodesk.Revit.DB.ParameterTypeId.StairsTriserTreadMark
"Tread Mark": (OBSOLETE)

Autodesk.Revit.DB.ParameterTypeId.StairsTriserRiserNumber
"Riser Number": Count the sequential number of riser in the stair.

Autodesk.Revit.DB.ParameterTypeId.StairsTriserTreadNumber
"Tread Number": Count the sequential number of tread in the stair.

Autodesk.Revit.DB.ParameterTypeId.StairsTriserIsTypeOverridden
"Overridden": (OBSOLETE) Indicate whether selected individual step is governed by default type setting.

Autodesk.Revit.DB.ParameterTypeId.StairsWinderpatternNumberOfStraightStepsAtEnd
"Parallel Treads at End": Number of straight steps at the begin of winder

Autodesk.Revit.DB.ParameterTypeId.StairsWinderpatternNumberOfStraightStepsAtBegin
"Parallel Treads at Start": Number of straight steps at the begin of winder

Autodesk.Revit.DB.ParameterTypeId.StairsWinderpatternRadiusInterior
"Fillet Radius": The fillet corner radius on the interior boundary

Autodesk.Revit.DB.ParameterTypeId.StairsWinderpatternFilletInsideCorner
"Fillet on Corner": Fillet on inside corner

Autodesk.Revit.DB.ParameterTypeId.StairsWinderpatternStairPathOffset
"Inside Walk Line Offset": The offset from inside walk line to interior boundary

Autodesk.Revit.DB.ParameterTypeId.StairsWinderpatternMinimumWidthInsideWalkline
"Minimum Width on Inside Walk Line": Minimum width on inside walkline

Autodesk.Revit.DB.ParameterTypeId.StairsWinderpatternMinimumWidthCorner
"Minimum Width on Inside Boundary": Minimum Width on Inside Boundary

Autodesk.Revit.DB.ParameterTypeId.StairsWinderpatternWinderStyle
"Winder Style": Winder Style

Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeFlipSectionProfile
"Flip Section Profile": Flip Section Profile

Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeStructuralDepthOnLanding
"Structural Depth On Landing": Structural Depth

Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeStructuralDepthOnRun
"Structural Depth On Run": Structural Depth

Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeMaterial
"Material": Material

Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeWidth
"Width": Width

Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeTotalDepth
"Total Depth": Total Depth

Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeStructuralDepth
"Structural Depth": Structural Depth

Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeUndersideSurface
"Underside Surface": Underside Surface

Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeTopsideSurface
"Topside Surface": Topside Surface

Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeSectionProfile
"Section Profile": Section Profile

Autodesk.Revit.DB.ParameterTypeId.StairsSupportLandingsupportType
"Landing Support Type": Landing Support Type

Autodesk.Revit.DB.ParameterTypeId.StairsSupportOverridden
"Overridden": Overridden

Autodesk.Revit.DB.ParameterTypeId.StairsSupportTrimSupportUpper
"Trim Support at Upper": Trim Support at Upper

Autodesk.Revit.DB.ParameterTypeId.StairsSupportUpperEndCut
"Upper End Cut": Upper End Cut

Autodesk.Revit.DB.ParameterTypeId.StairsSupportLowerEndCut
"Lower End Cut": Lower End Cut

Autodesk.Revit.DB.ParameterTypeId.StairsSupportVerticalOffset
"Vertical Offset": Distance of top plane of edge stringer relative to the plane connecting tread nosing

Autodesk.Revit.DB.ParameterTypeId.StairsSupportHorizontalOffset
"Lateral Offset": Distance from center or edge of boundary

Autodesk.Revit.DB.ParameterTypeId.StairsLandingtypeLandingMaterial
"Monolithic Material": Landing Material

Autodesk.Revit.DB.ParameterTypeId.StairsLandingtypeTreadriserType
"Type": Tread/Riser Type

Autodesk.Revit.DB.ParameterTypeId.StairsLandingtypeUseSameTriserAsRun
"Same as Run": Same as Run

Autodesk.Revit.DB.ParameterTypeId.StairsLandingtypeThickness
"Monolithic Thickness": Default thickness

Autodesk.Revit.DB.ParameterTypeId.StairsLandingtypeStructure
"Structure": Structure

Autodesk.Revit.DB.ParameterTypeId.StairsLandingtypeHasMonolithicSupport
"Monolithic Support": Monolithic Support

Autodesk.Revit.DB.ParameterTypeId.StairsLandingOverridden
"Overridden": Overridden

Autodesk.Revit.DB.ParameterTypeId.StairsLandingThickness
"Total Thickness": Thickness

Autodesk.Revit.DB.ParameterTypeId.StairsLandingStructural
"Structural": Structural

Autodesk.Revit.DB.ParameterTypeId.StairsLandingBaseElevation
"Relative Height": Height

Autodesk.Revit.DB.ParameterTypeId.StairsRuntypeRunMaterial
"Monolithic Material": Material

Autodesk.Revit.DB.ParameterTypeId.StairsRuntypeTotalDepth
"Total Depth": Total Depth

Autodesk.Revit.DB.ParameterTypeId.StairsRuntypeStructuralDepth
"Structural Depth": Structural Depth

Autodesk.Revit.DB.ParameterTypeId.StairsRuntypeStructure
"Structure": Structure

Autodesk.Revit.DB.ParameterTypeId.StairsRuntypeUndersideSurfaceType
"Underside Surface": Underside Surface

Autodesk.Revit.DB.ParameterTypeId.StairsRuntypeHasMonolithicSupport
"Monolithic Support": Monolithic Support

Autodesk.Revit.DB.ParameterTypeId.StairsRunExtendBelowTreadBase
"Extend Below Tread Base": Extend Below Tread Base

Autodesk.Revit.DB.ParameterTypeId.StairsRunCcw
"CCW": Revert the run preview

Autodesk.Revit.DB.ParameterTypeId.StairsRunCreateAutoLanding
"With Automatic Landing": Create automatic landing

Autodesk.Revit.DB.ParameterTypeId.StairsRunWinderEndWithStraight
"End with Straight Run": Winder end with straight run

Autodesk.Revit.DB.ParameterTypeId.StairsRunWinderBeginWithStraight
"Begin with Straight Run": Winder begin with straight run

Autodesk.Revit.DB.ParameterTypeId.StairsRunLocationpathJustfication
"Location Line": Location Line

Autodesk.Revit.DB.ParameterTypeId.StairsRunEndWithRiser
"End with Riser": End with Riser

Autodesk.Revit.DB.ParameterTypeId.StairsRunBeginWithRiser
"Begin with Riser": Begin with Riser

Autodesk.Revit.DB.ParameterTypeId.StairsRunOverridden
"Overridden": Overridden

Autodesk.Revit.DB.ParameterTypeId.StairsRunStructural
"Structural": Structural

Autodesk.Revit.DB.ParameterTypeId.StairsRunCenterMarkVisible
"Center Mark Visible": Center Mark Visible

Autodesk.Revit.DB.ParameterTypeId.StairsRunActualRunWidth
"Actual Run Width": Actual Run Width

Autodesk.Revit.DB.ParameterTypeId.StairsRunActualTreadDepth
"Actual Tread Depth": Actual Tread Depth

Autodesk.Revit.DB.ParameterTypeId.StairsRunActualRiserHeight
"Actual Riser Height": Actual Riser Height

Autodesk.Revit.DB.ParameterTypeId.StairsRunActualNumberOfTreads
"Actual Number of Treads": Actual Number of Treads

Autodesk.Revit.DB.ParameterTypeId.StairsRunActualNumberOfRisers
"Actual Number of Risers": Actual Number of Risers

Autodesk.Revit.DB.ParameterTypeId.StairsRunExtendBelowRiserBase
"Extend Below Riser Base": Extend Below Base

Autodesk.Revit.DB.ParameterTypeId.StairsRunHeight
"Run Height": Run Height

Autodesk.Revit.DB.ParameterTypeId.StairsRunTopElevation
"Relative Top Height": Top height of run

Autodesk.Revit.DB.ParameterTypeId.StairsRunBottomElevation
"Relative Base Height": Relative height to stairs bottom elevation

Autodesk.Revit.DB.ParameterTypeId.StairstypeHasIntermediateSupport
"Middle Support": Whether stairs is assembled

Autodesk.Revit.DB.ParameterTypeId.StairstypeLeftSupportLateralOffset
"Left Lateral Offset":

Autodesk.Revit.DB.ParameterTypeId.StairstypeRightSupportLateralOffset
"Right Lateral Offset":

Autodesk.Revit.DB.ParameterTypeId.StairstypeCutmarkType
"Cut Mark Type": Cut Mark Type

Autodesk.Revit.DB.ParameterTypeId.StairstypeConstructionMethod
"Construction Method":

Autodesk.Revit.DB.ParameterTypeId.StairstypeHasRightSupport
"Right Support":

Autodesk.Revit.DB.ParameterTypeId.StairstypeHasLeftSupport
"Left Support":

Autodesk.Revit.DB.ParameterTypeId.StairstypeNotchWidth
"Notch Width":

Autodesk.Revit.DB.ParameterTypeId.StairstypeNotchVerticalGap
"Vertical Gap Distance":

Autodesk.Revit.DB.ParameterTypeId.StairstypeNotchHorizontalGap
"Horizontal Gap Distance":

Autodesk.Revit.DB.ParameterTypeId.StairstypeNotchCustomWidth
"Custom":

Autodesk.Revit.DB.ParameterTypeId.StairstypeNotchThickness
"Notch Thickness":

Autodesk.Revit.DB.ParameterTypeId.StairstypeNotchExtension
"Notch Extension":

Autodesk.Revit.DB.ParameterTypeId.StairstypeGeomunjoinedEndCutStyle
"Connection Method": Cut Style for Geometrically Unjoined End

Autodesk.Revit.DB.ParameterTypeId.StairstypeCalcRuleTargetResult
"Target Result": Calculation Rule Target Result

Autodesk.Revit.DB.ParameterTypeId.StairstypeCalcRuleMinResult
"Min. Result": Calculation Rule Min Result

Autodesk.Revit.DB.ParameterTypeId.StairstypeCalcRuleMaxResult
"Max. Result": Calculation Rule Max Result

Autodesk.Revit.DB.ParameterTypeId.StairstypeCalcRuleTreadMultiplier
"Tread Multiplier": Calculation Rule Tread Multiplier

Autodesk.Revit.DB.ParameterTypeId.StairstypeCalcRuleRiserMultiplier
"Riser Multiplier": Calculation Rule Riser Multiplier

Autodesk.Revit.DB.ParameterTypeId.StairstypeIsAssembledStairs
"Assembled Stair": Whether stairs is assembled

Autodesk.Revit.DB.ParameterTypeId.StairstypeNumberOfIntermediateSupports
"Middle Support Number": Number of intermediate supports

Autodesk.Revit.DB.ParameterTypeId.StairstypeMinimumRunWidth
"Minimum Run Width": Minimum Run Width

Autodesk.Revit.DB.ParameterTypeId.StairstypeWinderStepFrontMeasurement
"Winder Algorithm": Winder Algorithm

Autodesk.Revit.DB.ParameterTypeId.StairstypeShowUpdown
"Show Up/Down in Plan": Show Up/Down in Plan

Autodesk.Revit.DB.ParameterTypeId.StairstypeShowStairPath
"Show Stair Path in Plan": Show Stair Path in Plan

Autodesk.Revit.DB.ParameterTypeId.StairstypeShowCutline
"Show Cut Line in Plan": Show Cut Line in Plan

Autodesk.Revit.DB.ParameterTypeId.StairstypeIntermediateSupportType
"Middle Support Type": Intermediate Support Type

Autodesk.Revit.DB.ParameterTypeId.StairstypeLeftSideSupportType
"Left Support Type": Left Side Support Type

Autodesk.Revit.DB.ParameterTypeId.StairstypeRightSideSupportType
"Right Support Type": Right Side Support Type

Autodesk.Revit.DB.ParameterTypeId.StairstypeLandingType
"Landing Type": Landing Type

Autodesk.Revit.DB.ParameterTypeId.StairstypeRunType
"Run Type": Run Type

Autodesk.Revit.DB.ParameterTypeId.StairstypeCalculationRules
"Calculation Rules": Calculation Rules

Autodesk.Revit.DB.ParameterTypeId.StairstypeMinimumTreadWidthInsideBoundary
"Min. Tread Depth on Winder Inner Boundary": Minimum Tread Width on Inside Boundary

Autodesk.Revit.DB.ParameterTypeId.StairstypeMinimumTreadDepth
"Min. Tread Depth": Minimum Tread Depth

Autodesk.Revit.DB.ParameterTypeId.StairstypeMaximumRiserHeight
"Max. Riser Height": Maximum Riser Height

Autodesk.Revit.DB.ParameterTypeId.StairsTriserNumberBaseIndex
"Tread/Riser Start Number":

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowAnnotationCutMark
"Cut by Cut Plane"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowMonolithicSupportCorseGeom
"Show Monolithic Support Corse Geometry"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowTriserCorseGeom
"Show Triser Corse Geometry"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunCorseGeom
"Show Run Corse Geometry"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowMonolithicSupportGeom
"Show Monolithic Support Geometry"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowTriserGeom
"Show Triser Geometry"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunGeom
"Show Run Geometry"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowSupportPath
"Show Support Path"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowBoundary3d
"Show Stairs' Boundary 3D"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowBoundary2d
"Show Stairs' Boundary 2D"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowLandingPath
"Show Landing Path"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowLandingBoundary
"Show Landing Boundary"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunOutlineForPlan
"Show Run Outline For Plan"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunNosing
"Show Run's Nosings"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunRiser
"Show Run's Risers"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunPath3d
"Show Run's Path 3D"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunPath2d
"Show Run's Path 2D"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRightRunBoundary3d
"Show Run's Right Boundary 3D"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowLeftRunBoundary3d
"Show Run's Left Boundary 3D"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRightRunBoundary2d
"Show Run's Right Boundary 2D"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowLeftRunBoundary2d
"Show Run's Left Boundary 2D"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowLandingFaces
"Show Landing Faces"

Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowTreadFaces
"Show Run's Tread Faces"

Autodesk.Revit.DB.ParameterTypeId.StairsEnableCalculationRuleChecking
"Enable Calculator Rules Check": Enable calculation rule checking

Autodesk.Revit.DB.ParameterTypeId.StairsMinAutomaticLandingDepth
"Minimum Automatic Landing Depth": The minimum depth of automatic landing

Autodesk.Revit.DB.ParameterTypeId.StairsRunWidthMeasurement
"Run Width Measurement": Run Width Measurement

Autodesk.Revit.DB.ParameterTypeId.StairsTotalNumberOfTreads
"Total Number of Treads": Total number of treads

Autodesk.Revit.DB.ParameterTypeId.StairsTotalNumberOfRisers
"Total Number of Risers": Total number of risers

Autodesk.Revit.DB.ParameterTypeId.StairsActualNumberOfRisers
"Actual Number of Risers": The total number of actually created risers in model

Autodesk.Revit.DB.ParameterTypeId.StairsDesiredNumberOfRisers
"Desired Number of Risers": The number of risers is calculated based on stairs height

Autodesk.Revit.DB.ParameterTypeId.StairsMultistoryUpToLevel
"Multistory Top Level": The top level of multi-story stairs

Autodesk.Revit.DB.ParameterTypeId.StairsStairsHeight
"Desired Stair Height": Stairs unconnected height

Autodesk.Revit.DB.ParameterTypeId.StairsTopLevel
"Top Level": The top level of stairs

Autodesk.Revit.DB.ParameterTypeId.StairsBaseLevel
"Base Level": The base level of stairs

Autodesk.Revit.DB.ParameterTypeId.PartMakerDivisionProfileOffset
"Profile Offset"

Autodesk.Revit.DB.ParameterTypeId.DivisionProfileWidth
"Width": Width

Autodesk.Revit.DB.ParameterTypeId.PartMakerSplitterProfileEdgeMatch
"Edge Match"

Autodesk.Revit.DB.ParameterTypeId.PartMakerSplitterProfileFlipAlong
"Profile Along Flip"

Autodesk.Revit.DB.ParameterTypeId.PartMakerSplitterProfileFlipAcross
"Profile Across Flip"

Autodesk.Revit.DB.ParameterTypeId.PartMakerSplitterProfile
"Division Profile"

Autodesk.Revit.DB.ParameterTypeId.FamilyKeywordProtected
"Content protection enabled"

Autodesk.Revit.DB.ParameterTypeId.PartmakerParamDivisionGap
"Gap"

Autodesk.Revit.DB.ParameterTypeId.PointcloudinstanceName
"Name": The name of the instance as it will show in the Property Palette

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelRotation
"Cross-Section Rotation": The rotation of Analytical Model

Autodesk.Revit.DB.ParameterTypeId.PointcloudtypeScale
"Scale": The scale for this instance

Autodesk.Revit.DB.ParameterTypeId.PropertySetDescription
"Description"

Autodesk.Revit.DB.ParameterTypeId.PropertySetMaterialAspect
"Material aspect"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctPipeSystemAbbreviationParam
"System Abbreviation"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialProperties
"Properties"

Autodesk.Revit.DB.ParameterTypeId.PropertySetName
"Property Set Name"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamSubclass
"Subclass"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamClass
"Class"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelPerimeter
"Perimeter": The Perimeter of Analytical Model

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelArea
"Area": The Area of Analytical Model

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelLength
"Length": The length of Analytical Model

Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyKeynote
"Assembly: Keynote"

Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyAssemblyDescription
"Assembly: Assembly Description"

Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyCost
"Assembly: Cost"

Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyTypeMark
"Assembly: Type Mark"

Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyAssemblyCode
"Assembly: Assembly Code"

Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyDescription
"Assembly: Description"

Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyUrl
"Assembly: URL"

Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyTypeComments
"Assembly: Type Comments"

Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyManufacturer
"Assembly: Manufacturer"

Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyModel
"Assembly: Model"

Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyName
"Assembly: Name"

Autodesk.Revit.DB.ParameterTypeId.RbsReferenceFreesize
"Free Size"

Autodesk.Revit.DB.ParameterTypeId.RbsReferenceOverallsize
"Overall Size"

Autodesk.Revit.DB.ParameterTypeId.RbsReferenceLiningThickness
"Lining Thickness"

Autodesk.Revit.DB.ParameterTypeId.RbsReferenceLiningType
"Lining Type"

Autodesk.Revit.DB.ParameterTypeId.RbsReferenceInsulationThickness
"Insulation Thickness"

Autodesk.Revit.DB.ParameterTypeId.RbsReferenceInsulationType
"Insulation Type"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeCalculatedSize
"Pipe Size"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctCalculatedSize
"Duct Size"

Autodesk.Revit.DB.ParameterTypeId.RbsInsulationLiningVolume
"Volume"

Autodesk.Revit.DB.ParameterTypeId.AssemblyName
"Assembly Name"

Autodesk.Revit.DB.ParameterTypeId.RbsComponentClassificationParam
"Component Classification"

Autodesk.Revit.DB.ParameterTypeId.RbsSystemRisedropParam
"Rise / Drop Symbol"

Autodesk.Revit.DB.ParameterTypeId.RbsSystemRisedrop2linedropsymbolParam
"Two Line Drop Symbol"

Autodesk.Revit.DB.ParameterTypeId.RbsSystemRisedrop2linerisesymbolParam
"Two Line Rise Symbol"

Autodesk.Revit.DB.ParameterTypeId.RbsSystemRisedrop1linedropsymbolParam
"Single Line Drop Symbol"

Autodesk.Revit.DB.ParameterTypeId.RbsSystemRisedrop1linerisesymbolParam
"Single Line Rise Symbol"

Autodesk.Revit.DB.ParameterTypeId.RbsSystemRisedrop1lineteeupsymbolParam
"Single Line Tee Up Symbol"

Autodesk.Revit.DB.ParameterTypeId.RbsSystemRisedrop1lineteedownsymbolParam
"Single Line Tee Down Symbol"

Autodesk.Revit.DB.ParameterTypeId.AssemblyNamingCategory
"Naming Category"

Autodesk.Revit.DB.ParameterTypeId.RailingSystemHasTopRail
"Use Top Rail": Whether railing has top rail

Autodesk.Revit.DB.ParameterTypeId.ContinuousrailJoinTypeParam
"Rail Path Join"

Autodesk.Revit.DB.ParameterTypeId.ContinuousrailPlusTreadDepthParam
"Plus Tread Depth"

Autodesk.Revit.DB.ParameterTypeId.ContinuousrailLengthParam
"Length"

Autodesk.Revit.DB.ParameterTypeId.HandrailSupportsJustificationParam
"Justification"

Autodesk.Revit.DB.ParameterTypeId.HandrailSupportsNumberParam
"Number"

Autodesk.Revit.DB.ParameterTypeId.HandrailSupportsSpacingParam
"Spacing"

Autodesk.Revit.DB.ParameterTypeId.HandrailSupportsLayoutParam
"Layout"

Autodesk.Revit.DB.ParameterTypeId.HandrailSupportsTypeParam
"Family"

Autodesk.Revit.DB.ParameterTypeId.ContinuousrailEndExtensionLengthParam
"Length"

Autodesk.Revit.DB.ParameterTypeId.ContinuousrailEndTerminationAttachmentParam
"Extension Style"

Autodesk.Revit.DB.ParameterTypeId.ContinuousrailExtensionLengthParam
"Length"

Autodesk.Revit.DB.ParameterTypeId.ContinuousrailBeginningTerminationAttachmentParam
"Extension Style"

Autodesk.Revit.DB.ParameterTypeId.ContinuousrailEndTerminationTypeParam
"End/Top Termination"

Autodesk.Revit.DB.ParameterTypeId.ContinuousrailBeginningTerminationTypeParam
"Beginning/Bottom Termination"

Autodesk.Revit.DB.ParameterTypeId.ContinuousrailMaterialsParam
"Material"

Autodesk.Revit.DB.ParameterTypeId.ContinuousrailTransitionTypeParam
"Transitions"

Autodesk.Revit.DB.ParameterTypeId.HandrailHandClearanceParam
"Hand Clearance"

Autodesk.Revit.DB.ParameterTypeId.HandrailProjectionParam
"Projection"

Autodesk.Revit.DB.ParameterTypeId.HandrailHeightParam
"Height"

Autodesk.Revit.DB.ParameterTypeId.ContinuousrailProfileTypeParam
"Profile"

Autodesk.Revit.DB.ParameterTypeId.ContinuousrailFilletRadiusParam
"Fillet Radius"

Autodesk.Revit.DB.ParameterTypeId.ContinuousrailDefaultJoinTypeParam
"Default Join"

Autodesk.Revit.DB.ParameterTypeId.RailingSystemSecondaryHandrailsLatteralOffset
"Lateral Offset"

Autodesk.Revit.DB.ParameterTypeId.RailingSystemSecondaryHandrailsHeightParam
"Height"

Autodesk.Revit.DB.ParameterTypeId.RailingSystemSecondaryHandrailsPositionParam
"Position"

Autodesk.Revit.DB.ParameterTypeId.RailingSystemSecondaryHandrailsTypesParam
"Type"

Autodesk.Revit.DB.ParameterTypeId.RailingSystemHandrailsLatteralOffset
"Lateral Offset"

Autodesk.Revit.DB.ParameterTypeId.RailingSystemHandrailsHeightParam
"Height"

Autodesk.Revit.DB.ParameterTypeId.RailingSystemHandrailsPositionParam
"Position"

Autodesk.Revit.DB.ParameterTypeId.RailingSystemHandrailsTypesParam
"Type"

Autodesk.Revit.DB.ParameterTypeId.RailingSystemTopRailHeightParam
"Height"

Autodesk.Revit.DB.ParameterTypeId.RailingSystemTopRailTypesParam
"Type"

Autodesk.Revit.DB.ParameterTypeId.PointElementRotationAngle
"Rotation Angle"

Autodesk.Revit.DB.ParameterTypeId.FlexibleInstanceFlip
"Flip"

Autodesk.Revit.DB.ParameterTypeId.PointFlexibleOrientationType
"Orientation"

Autodesk.Revit.DB.ParameterTypeId.DefaultConstructionMassFloor
"Mass Floor"

Autodesk.Revit.DB.ParameterTypeId.DefaultConstructionMassOpening
"Mass Opening"

Autodesk.Revit.DB.ParameterTypeId.DefaultConstructionMassSkylight
"Mass Skylight"

Autodesk.Revit.DB.ParameterTypeId.DefaultConstructionMassGlazing
"Mass Glazing"

Autodesk.Revit.DB.ParameterTypeId.DefaultConstructionExtWallUnderground
"Mass Exterior Wall - Underground"

Autodesk.Revit.DB.ParameterTypeId.DefaultConstructionMassSlab
"Mass Slab"

Autodesk.Revit.DB.ParameterTypeId.DefaultConstructionMassShade
"Mass Shade"

Autodesk.Revit.DB.ParameterTypeId.DefaultConstructionMassRoof
"Mass Roof"

Autodesk.Revit.DB.ParameterTypeId.DefaultConstructionMassInteriorWall
"Mass Interior Wall"

Autodesk.Revit.DB.ParameterTypeId.DefaultConstructionMassExteriorWall
"Mass Exterior Wall"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisSpaceBoundingParam
"Analytical Space Bounding"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisHorizontalVoidThreshold
"Horizontal Void/Chase Area Threshold"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisVerticalVoidThreshold
"Average Vertical Void Height Threshold"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisBuildingEnvelopeAnalyticalGridCellSize
"Analytical Grid Cell Size"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisBuildingEnvelopeDeterminationParam
"Building Envelope"

Autodesk.Revit.DB.ParameterTypeId.LeaderRightAttachment
"Right Attachment"

Autodesk.Revit.DB.ParameterTypeId.LeaderLeftAttachment
"Left Attachment"

Autodesk.Revit.DB.ParameterTypeId.PointElementMeasureFrom
"Measure From"

Autodesk.Revit.DB.ParameterTypeId.PointElementAngle
"Angle"

Autodesk.Revit.DB.ParameterTypeId.PointElementChordLength
"Chord Length"

Autodesk.Revit.DB.ParameterTypeId.PointElementNormalizedSegmentLength
"Normalized Segment Length"

Autodesk.Revit.DB.ParameterTypeId.PointElementSegmentLength
"Segment Length"

Autodesk.Revit.DB.ParameterTypeId.PointElementNormalizedCurveParamater
"Normalized Curve Parameter"

Autodesk.Revit.DB.ParameterTypeId.PointElementNonNormalizedCurveParamater
"Non-Normalized Curve Parameter"

Autodesk.Revit.DB.ParameterTypeId.PointElementMeasurementType
"Measurement Type"

Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEndAttachmentRefcolumnEnd
"End of Attachment to Reference Column"

Autodesk.Revit.DB.ParameterTypeId.StructuralBeamStartAttachmentRefcolumnEnd
"Start of Attachment to Reference Column"

Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEndAttachmentDistance
"End Attachment Distance"

Autodesk.Revit.DB.ParameterTypeId.StructuralBeamStartAttachmentDistance
"Start Attachment Distance"

Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEndAttachmentType
"End Attachment Type"

Autodesk.Revit.DB.ParameterTypeId.StructuralBeamStartAttachmentType
"Start Attachment Type"

Autodesk.Revit.DB.ParameterTypeId.TextBoxVisibility
"Show Border"

Autodesk.Revit.DB.ParameterTypeId.CurveByPointsProjectionType
"Projection Type"

Autodesk.Revit.DB.ParameterTypeId.FollowSurface
"Follow Surface"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisIncludeThermalProperties
"Detailed Elements"

Autodesk.Revit.DB.ParameterTypeId.PointFlexibleNumParam
"Number"

Autodesk.Revit.DB.ParameterTypeId.FramingLengthRoundoff
"Structural Framing Length Roundoff"

Autodesk.Revit.DB.ParameterTypeId.SlantedColumnBaseExtension
"Base Extension"

Autodesk.Revit.DB.ParameterTypeId.SlantedColumnTopExtension
"Top Extension"

Autodesk.Revit.DB.ParameterTypeId.SlantedColumnBaseCutStyle
"Base Cut Style"

Autodesk.Revit.DB.ParameterTypeId.SlantedColumnTopCutStyle
"Top Cut Style"

Autodesk.Revit.DB.ParameterTypeId.RbsBuildingUseloadcredits
"Use Load Credits"

Autodesk.Revit.DB.ParameterTypeId.TilePatternFamrefComponentExtents
"Component Extents"

Autodesk.Revit.DB.ParameterTypeId.TilePatternGridCellsY
"Number of vertical cells"

Autodesk.Revit.DB.ParameterTypeId.TilePatternGridCellsX
"Number of horizontal cells"

Autodesk.Revit.DB.ParameterTypeId.TilePatternGridUnitY
"Vertical spacing"

Autodesk.Revit.DB.ParameterTypeId.TilePatternGridUnitX
"Horizontal spacing"

Autodesk.Revit.DB.ParameterTypeId.PointElementShowNormalPlaneOnly
"Show Normal Reference Plane Only"

Autodesk.Revit.DB.ParameterTypeId.LevelIsGroundPlane
"Is ground plane"

Autodesk.Revit.DB.ParameterTypeId.BasepointAngletonParam
"Angle to True North"

Autodesk.Revit.DB.ParameterTypeId.BasepointElevationParam
"Elev"

Autodesk.Revit.DB.ParameterTypeId.BasepointEastwestParam
"E/W"

Autodesk.Revit.DB.ParameterTypeId.BasepointNorthsouthParam
"N/S"

Autodesk.Revit.DB.ParameterTypeId.SlantedColumnGeometryTreatmentBase
"Base Geometry Alignment"

Autodesk.Revit.DB.ParameterTypeId.SlantedColumnGeometryTreatmentTop
"Top Geometry Alignment"

Autodesk.Revit.DB.ParameterTypeId.RoomPlenumLightingParam
"Plenum Lighting Contribution"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentTopReferencedend
"Top Attachment Referenced End"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentTopRatio
"Top Attachment Ratio"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentTopDistance
"Top Attachment Distance"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentTopType
"Top Attachment Type"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentBaseReferencedend
"Base Attachment Referenced End"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentBaseRatio
"Base Attachment Ratio"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentBaseDistance
"Base Attachment Distance"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentBaseType
"Base Attachment Type"

Autodesk.Revit.DB.ParameterTypeId.InstanceMoveBaseWithGrids
"Move Base With Grids"

Autodesk.Revit.DB.ParameterTypeId.InstanceMoveTopWithGrids
"Move Top With Grids"

Autodesk.Revit.DB.ParameterTypeId.SlantedColumnTypeParam
"Column Style"

Autodesk.Revit.DB.ParameterTypeId.ViewSlantedColumnSymbolOffset
"Column Symbolic Offset"

Autodesk.Revit.DB.ParameterTypeId.PointElementMirrored
"Mirrored"

Autodesk.Revit.DB.ParameterTypeId.PointElementZflipped
"Flipped"

Autodesk.Revit.DB.ParameterTypeId.PointElementHostedOnFaceVParam
"Hosted V Parameter"

Autodesk.Revit.DB.ParameterTypeId.PointElementHostedOnFaceUParam
"Hosted U Parameter"

Autodesk.Revit.DB.ParameterTypeId.LockedEndOffset
"Positive Offset"

Autodesk.Revit.DB.ParameterTypeId.LockedStartOffset
"Negative Offset"

Autodesk.Revit.DB.ParameterTypeId.LockedBaseOffset
"Negative Offset"

Autodesk.Revit.DB.ParameterTypeId.LockedTopOffset
"Positive Offset"

Autodesk.Revit.DB.ParameterTypeId.RbsProjectReporttypeParam
"Report Type"

Autodesk.Revit.DB.ParameterTypeId.RbsBuildingConstructionclass
"Building Infiltration Class"

Autodesk.Revit.DB.ParameterTypeId.ConnectorUtilityParam
"Utility"

Autodesk.Revit.DB.ParameterTypeId.PointFlexibleShowNumber
"Show Placement Number"

Autodesk.Revit.DB.ParameterTypeId.PointFlexibleConstrained
"Constrained"

Autodesk.Revit.DB.ParameterTypeId.PointNameParam
"Name"

Autodesk.Revit.DB.ParameterTypeId.PointAdaptiveTypeParam
"Point"

Autodesk.Revit.DB.ParameterTypeId.SpotDimStyleSlopeUnits
"Units Format"

Autodesk.Revit.DB.ParameterTypeId.PointElementDriving
"Driving Curve(s)"

Autodesk.Revit.DB.ParameterTypeId.SpotSlopeLeaderLength
"Leader Line Length"

Autodesk.Revit.DB.ParameterTypeId.SpotSlopeSuffix
"Suffix"

Autodesk.Revit.DB.ParameterTypeId.SpotSlopePrefix
"Prefix"

Autodesk.Revit.DB.ParameterTypeId.PointVisibilityParam
"Visibility/Graphics Overrides"

Autodesk.Revit.DB.ParameterTypeId.PointElementShowPlanes
"Show Reference Planes"

Autodesk.Revit.DB.ParameterTypeId.CurveIsReferenceLine
"Is Reference Line"

Autodesk.Revit.DB.ParameterTypeId.PointElementHostedParam
"Hosted Parameter"

Autodesk.Revit.DB.ParameterTypeId.PointElementDriven
"Driven by Host"

Autodesk.Revit.DB.ParameterTypeId.PointElementOffset
"Offset"

Autodesk.Revit.DB.ParameterTypeId.SpotDimStyleSlopeUnitsAlt
"Alternate Units Format"

Autodesk.Revit.DB.ParameterTypeId.FbxLightPhotometricFileCache
"None"

Autodesk.Revit.DB.ParameterTypeId.FbxLightPhotometricsFam
"Light Source Definition (family)"

Autodesk.Revit.DB.ParameterTypeId.FamilyCurveAttachmentProportion
"Attachment Point"

Autodesk.Revit.DB.ParameterTypeId.FbxLightLossFactorCtrl
"Light Loss Factor"

Autodesk.Revit.DB.ParameterTypeId.FbxLightInitialColorCtrl
"Initial Color"

Autodesk.Revit.DB.ParameterTypeId.FbxLightLossFactorMethod
"Light Loss Input Method"

Autodesk.Revit.DB.ParameterTypeId.FbxLightInitialColorName
"Temperature Color"

Autodesk.Revit.DB.ParameterTypeId.FbxLightAtADistance
"At a distance"

Autodesk.Revit.DB.ParameterTypeId.FbxLightInitialIntensityInputMethod
"Initial Light Intensity Input Method"

Autodesk.Revit.DB.ParameterTypeId.FbxLightSourceLength
"Light Source Symbol Length"

Autodesk.Revit.DB.ParameterTypeId.FbxLightSourceDiameter
"Light Source Symbol Size"

Autodesk.Revit.DB.ParameterTypeId.FbxLightEmitCircleDiameter
"Emit from Circle Diameter"

Autodesk.Revit.DB.ParameterTypeId.FbxLightEmitRectangleLength
"Emit from Rectangle Length"

Autodesk.Revit.DB.ParameterTypeId.FbxLightEmitRectangleWidth
"Emit from Rectangle Width"

Autodesk.Revit.DB.ParameterTypeId.FbxLightEmitLineLength
"Emit from Line Length"

Autodesk.Revit.DB.ParameterTypeId.FbxLightEmitShapeVisible
"Emit Shape Visible in Rendering"

Autodesk.Revit.DB.ParameterTypeId.FbxLightDimmingLightColor
"Dimming Lamp Color Temperature Shift"

Autodesk.Revit.DB.ParameterTypeId.FbxLightLumenaireDirt
"Luminaire Dirt Depreciation"

Autodesk.Revit.DB.ParameterTypeId.FbxLightLampLumenDepr
"Lamp Lumen Depreciation"

Autodesk.Revit.DB.ParameterTypeId.FbxLightSurfaceLoss
"Surface Depreciation Loss"

Autodesk.Revit.DB.ParameterTypeId.FbxLightLampTiltLoss
"Lamp Tilt Loss"

Autodesk.Revit.DB.ParameterTypeId.FbxLightVoltageLoss
"Voltage Loss"

Autodesk.Revit.DB.ParameterTypeId.FbxLightTemperatureLoss
"Temperature Loss"

Autodesk.Revit.DB.ParameterTypeId.FbxLightColorFilter
"Color Filter"

Autodesk.Revit.DB.ParameterTypeId.FbxLightInitialColorTemperature
"Initial Color Temperature"

Autodesk.Revit.DB.ParameterTypeId.FbxLightIlluminance
"Illuminance"

Autodesk.Revit.DB.ParameterTypeId.FbxLightLimunousIntensity
"Luminous Intensity"

Autodesk.Revit.DB.ParameterTypeId.FbxLightEfficacy
"Efficacy"

Autodesk.Revit.DB.ParameterTypeId.FbxLightWattage
"Wattage"

Autodesk.Revit.DB.ParameterTypeId.FbxLightInitialIntensity
"Initial Intensity"

Autodesk.Revit.DB.ParameterTypeId.FbxLightPhotometrics
"Light Source Definition"

Autodesk.Revit.DB.ParameterTypeId.FbxAssetType
"Light Source"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceGridOptionParamn2
"Option 2"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceGridOptionParamn1
"Option 1"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceDisplayDiscardeddivisionlines
"Discarded Division Lines"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceComponentTrimType
"Component Trim"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternMirror
"Component Mirror"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceRule2Suspension
"Is grid 2 suspended?"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceRule1Suspension
"Is grid 1 suspended?"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceDisplayComponents
"Components"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternFillMaterial
"Pattern Fill Material"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceDisplayPatternFill
"Pattern Fill"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternLinesStyle
"Pattern Lines Style"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceDisplayPatternLines
"Pattern Lines"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceGridlinesStyle
"Gridlines Style"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceDisplayGridlines
"Gridlines"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceDisplayNodes
"Nodes"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceOriginalSurfaceMaterial
"Surface Material"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceDisplayOriginalSurface
"Surface"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceDisplaySurfaceOption
"Display Surface Option"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceAllGridRotation
"All Grid Rotation"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceTileBorder
"Border Tile"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceAllPoints
"Show all points"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePattern
"Tile Pattern"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternFlip
"Component Flip"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternRotationAngle
"Component Rotation"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternIndentn2
"Indent 2"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternIndentn1
"Indent 1"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceCoverFaceCompletely
"Cover face completely"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceOffsetFromSurface
"Offset from surface"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceTotalEdgeLength
"Total edge length"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceEdgeNumber
"Edge number"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePointNumber
"Point number"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceFacetNumber
"Facet number"

Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceSurfaceArea
"Divided Surface Area"

Autodesk.Revit.DB.ParameterTypeId.RbsElecRoomLightingCalcLuminaireplane
"Lighting Calculation Luminaire Plane"

Autodesk.Revit.DB.ParameterTypeId.LayoutnodeCurvetypeParam
"Curve Type Reference"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeWallThickness
"Wall Thickness"

Autodesk.Revit.DB.ParameterTypeId.MepPipeLowerInvertElevation
"Lower End Invert Elevation"

Autodesk.Revit.DB.ParameterTypeId.MepPipeUpperInvertElevation
"Upper End Invert Elevation"

Autodesk.Revit.DB.ParameterTypeId.MepPipeLowerObvertElevation
"Lower End Obvert Elevation"

Autodesk.Revit.DB.ParameterTypeId.MepPipeUpperObvertElevation
"Upper End Obvert Elevation"

Autodesk.Revit.DB.ParameterTypeId.MepLowerBottomElevationIncludeInsulation
"Lower End Bottom of Insulation Elevation"

Autodesk.Revit.DB.ParameterTypeId.MepLowerTopElevationIncludeInsulation
"Lower End Top of Insulation Elevation"

Autodesk.Revit.DB.ParameterTypeId.MepUpperBottomElevationIncludeInsulation
"Upper End Bottom of Insulation Elevation"

Autodesk.Revit.DB.ParameterTypeId.MepUpperTopElevationIncludeInsulation
"Upper End Top of Insulation Elevation"

Autodesk.Revit.DB.ParameterTypeId.MepLowerBottomElevation
"Lower End Bottom Elevation"

Autodesk.Revit.DB.ParameterTypeId.MepLowerTopElevation
"Lower End Top Elevation"

Autodesk.Revit.DB.ParameterTypeId.MepUpperBottomElevation
"Upper End Bottom Elevation"

Autodesk.Revit.DB.ParameterTypeId.MepUpperTopElevation
"Upper End Top Elevation"

Autodesk.Revit.DB.ParameterTypeId.MepLowerCenterlineElevation
"Lower End Centerline Elevation"

Autodesk.Revit.DB.ParameterTypeId.MepUpperCenterlineElevation
"Upper End Centerline Elevation"

Autodesk.Revit.DB.ParameterTypeId.FabricationDuctworkStiffenerSpec
"Stiffener Specification"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartPatNo
"Part Pattern Number"

Autodesk.Revit.DB.ParameterTypeId.FabricationEndSize
"Size of Connector End"

Autodesk.Revit.DB.ParameterTypeId.FabricationBranchSize
"Size of Primary Branch End"

Autodesk.Revit.DB.ParameterTypeId.FabricationSecondarySize
"Size of Secondary End"

Autodesk.Revit.DB.ParameterTypeId.FabricationPrimarySize
"Size of Primary End"

Autodesk.Revit.DB.ParameterTypeId.FabricationChangeServiceParam
"Change Service"

Autodesk.Revit.DB.ParameterTypeId.FabricationSetUpDownTagFromBottom
"SU/SD from Bottom"

Autodesk.Revit.DB.ParameterTypeId.FabricationInsulationMaterialFinish
"Insulation Material"

Autodesk.Revit.DB.ParameterTypeId.DisplacedElementDisplacementZ
"Z Displacement"

Autodesk.Revit.DB.ParameterTypeId.DisplacedElementDisplacementY
"Y Displacement"

Autodesk.Revit.DB.ParameterTypeId.DisplacedElementDisplacementX
"X Displacement"

Autodesk.Revit.DB.ParameterTypeId.DisplacementPathStyle
"Style"

Autodesk.Revit.DB.ParameterTypeId.DisplacementPathDepth
"Depth"

Autodesk.Revit.DB.ParameterTypeId.ReferenceViewerUiTargetView
"Target view": This is used by the UI to allow selection of target view.
It allows the UI to set a filter that is incompatible
with the current target view (REFERENCE_VIEWER_TARGET_VIEW).

Autodesk.Revit.DB.ParameterTypeId.ReferenceViewerUiTargetFilter
"Filter": This is used by the UI to filter the list of target views.

Autodesk.Revit.DB.ParameterTypeId.FabricationFittingDescription
"Fabrication Fitting Description"

Autodesk.Revit.DB.ParameterTypeId.FabricationDoublewallMaterialAbbreviation
"Double Wall Material Abbreviation"

Autodesk.Revit.DB.ParameterTypeId.FabricationMaterialAbbreviation
"Material Abbreviation"

Autodesk.Revit.DB.ParameterTypeId.FabricationInsulationSpecificationAbbreviation
"Insulation Specification Abbreviation"

Autodesk.Revit.DB.ParameterTypeId.FabricationInsulationAbbreviation
"Insulation Abbreviation"

Autodesk.Revit.DB.ParameterTypeId.FabricationSpecificationAbbreviation
"Specification Abbreviation"

Autodesk.Revit.DB.ParameterTypeId.FabricationPipeInvertElevation
"Pipe Invert Elevation": This parameter is obsolete. It exists only for compatibility.

Autodesk.Revit.DB.ParameterTypeId.FabricationBottomElevationIncludeInsulationOfPart
"Bottom Elevation with Insulation"

Autodesk.Revit.DB.ParameterTypeId.FabricationBottomElevationOfPart
"Bottom Elevation"

Autodesk.Revit.DB.ParameterTypeId.FabricationTopElevationIncludeInsulationOfPart
"Top Elevation with Insulation"

Autodesk.Revit.DB.ParameterTypeId.FabricationTopElevationOfPart
"Top Elevation"

Autodesk.Revit.DB.ParameterTypeId.MepSpotCenterlineElevation
"Spot Centerline Elevation": used for both design and fabrication components

Autodesk.Revit.DB.ParameterTypeId.MepSpotBottomElevationIncludeInsulation
"Spot Bottom of Insulation Elevation"

Autodesk.Revit.DB.ParameterTypeId.MepSpotBottomElevation
"Spot Bottom Elevation": used for both design and fabrication components

Autodesk.Revit.DB.ParameterTypeId.MepSpotTopElevationIncludeInsulation
"Spot Top of Insulation Elevation"

Autodesk.Revit.DB.ParameterTypeId.MepSpotTopElevation
"Spot Top Elevation": used for both design and fabrication components

Autodesk.Revit.DB.ParameterTypeId.FabricationPartDoublewallMaterialArea
"Double Wall Material Area"

Autodesk.Revit.DB.ParameterTypeId.FabricationSetUpDownTag
"SU/SD from Top"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartSheetmetalArea
"Part Sheet Metal Area"

Autodesk.Revit.DB.ParameterTypeId.FabricationServiceAbbreviation
"Fabrication Service Abbreviation"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartMaterialThickness
"Part Material Thickness"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartNotes
"Fabrication Notes"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartLiningArea
"Lining Area"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartItemNumber
"Item Number"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartInsulationArea
"Insulation Area"

Autodesk.Revit.DB.ParameterTypeId.FabricationServiceName
"Fabrication Service Name"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartDoublewallMaterialThickness
"Double Wall Material Thickness"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartDoublewallMaterial
"Double Wall Material"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartCutType
"Cut Type"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartBoughtOut
"Bought Out"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartAlias
"Alias"

Autodesk.Revit.DB.ParameterTypeId.FabricationRoutingSolutionsUiParam
"x of XX"

Autodesk.Revit.DB.ParameterTypeId.FabricationProductCode
"Product Code"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartTakeoffDialogParam
"More Parameters"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartDepthOutOption
"Main Secondary Depth Option"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartWidthOutOption
"Main Secondary Width Option"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartDiameterOutOption
"Main Secondary Diameter Option"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartDiameterInOption
"Main Primary Diameter Option"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartDepthInOption
"Main Primary Depth Option"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartWidthInOption
"Main Primary Width Option"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartAngleOption
"Angle Option"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartLengthOption
"Length Option"

Autodesk.Revit.DB.ParameterTypeId.FabricationInsulationSpec
"Insulation Specification"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartLength
"Length"

Autodesk.Revit.DB.ParameterTypeId.FabricationProductEntry
"Product Entry"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartDepthOut
"Main Secondary Depth"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartWidthOut
"Main Secondary Width"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartDiameterOut
"Main Secondary Diameter"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartDepthIn
"Main Primary Depth"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartWidthIn
"Main Primary Width"

Autodesk.Revit.DB.ParameterTypeId.FabricationEndOffsetParam
"End Middle Elevation"

Autodesk.Revit.DB.ParameterTypeId.FabricationStartOffsetParam
"Start Middle Elevation"

Autodesk.Revit.DB.ParameterTypeId.FabricationSlopeParam
"Slope"

Autodesk.Revit.DB.ParameterTypeId.FabricationRelativeFilename
"Relative File Name"

Autodesk.Revit.DB.ParameterTypeId.FabricationVendor
"Vendor"

Autodesk.Revit.DB.ParameterTypeId.FabricationBottomOfPart
"Lower End Bottom of Insulation Elevation"

Autodesk.Revit.DB.ParameterTypeId.FabricationTopOfPart
"Upper End Top of Insulation Elevation"

Autodesk.Revit.DB.ParameterTypeId.FabricationOffsetParam
"Middle Elevation"

Autodesk.Revit.DB.ParameterTypeId.FabricationLevelParam
"Reference Level"

Autodesk.Revit.DB.ParameterTypeId.FabricationSpecification
"Specification"

Autodesk.Revit.DB.ParameterTypeId.FabricationVendorCode
"Vendor Code"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartWeight
"Weight"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartDiameterIn
"Main Primary Diameter"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartAngle
"Angle"

Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataInstallType
"Install Type"

Autodesk.Revit.DB.ParameterTypeId.FabricationPartMaterial
"Part Material"

Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataOem
"OEM"

Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataProduct
"Product Name"

Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataItemDescription
"Product Short Description"

Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataSizeDescription
"Product Size Description"

Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataMaterialDescription
"Product Material Description"

Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataSpecification
"Product Specification Description"

Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataLongDescription
"Product Long Description"

Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataRange
"Product Range"

Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataFinishDescription
"Product Finish Description"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyBottomChordStructuralTypesParam
"Structural Framing Type"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyBottomChordAngleParam
"Angle"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyBottomChordVerticalProjectionParam
"Analytical Vertical Projection"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyBottomChordStartReleaseType
"Start Release"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyBottomChordEndReleaseType
"End Release"

Autodesk.Revit.DB.ParameterTypeId.ReferenceOtherViewUiRefView
"Reference View": This is used by the UI to allow selection of view reference.

Autodesk.Revit.DB.ParameterTypeId.ReferenceOtherViewUiToggle
"Reference Other View": This is used to determine whether reference other view is enable or not.

Autodesk.Revit.DB.ParameterTypeId.JoistSystemElemTagNewMembersView
"Tag new members in view"

Autodesk.Revit.DB.ParameterTypeId.ReferenceViewerAttrTag
"View Reference Tag"

Autodesk.Revit.DB.ParameterTypeId.ReferenceViewerTargetView
"Target view"

Autodesk.Revit.DB.ParameterTypeId.MatchlineBottomPlane
"Bottom Constraint"

Autodesk.Revit.DB.ParameterTypeId.MatchlineTopPlane
"Top Constraint"

Autodesk.Revit.DB.ParameterTypeId.MatchlineBottomOffset
"Bottom Offset"

Autodesk.Revit.DB.ParameterTypeId.MatchlineTopOffset
"Top Offset"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyTopChordStructuralTypesParam
"Structural Framing Type"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyTopChordAngleParam
"Angle"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyTopChordVerticalProjectionParam
"Analytical Vertical Projection"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyTopChordStartReleaseType
"Start Release"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyTopChordEndReleaseType
"End Release"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyDiagWebStructuralTypesParam
"Structural Framing Type"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyDiagWebAngleParam
"Angle"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyDiagWebStartReleaseType
"Start Release"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyDiagWebEndReleaseType
"End Release"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyVertWebStructuralTypesParam
"Structural Framing Type"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyVertWebAngleParam
"Angle"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyVertWebStartReleaseType
"Start Release"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyVertWebEndReleaseType
"End Release"

Autodesk.Revit.DB.ParameterTypeId.TrussElementTagNewMembersView
"Tag new members in view"

Autodesk.Revit.DB.ParameterTypeId.TrussNonBearingOffsetParam
"Non Bearing Offset"

Autodesk.Revit.DB.ParameterTypeId.TrussBearingChordTopBottomParam
"Bearing Chord"

Autodesk.Revit.DB.ParameterTypeId.TrussElementSpanParam
"Span"

Autodesk.Revit.DB.ParameterTypeId.TrussElementStickJustParam
"Stick Symbol Location"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyWebsHaveSymbolicCutbackParam
"Webs have symbolic cutback"

Autodesk.Revit.DB.ParameterTypeId.TrussHeight
"Truss Height"

Autodesk.Revit.DB.ParameterTypeId.TrussFamilyTransformationParam
"Web Orientation"

Autodesk.Revit.DB.ParameterTypeId.TrussElementRotateChordsWithTruss
"Rotate Chords With Truss"

Autodesk.Revit.DB.ParameterTypeId.TrussElementReferenceLevelParam
"Reference Level"

Autodesk.Revit.DB.ParameterTypeId.TrussElementEnd1Elevation
"End Level Offset"

Autodesk.Revit.DB.ParameterTypeId.TrussElementEnd0Elevation
"Start Level Offset"

Autodesk.Revit.DB.ParameterTypeId.TrussElementBearingJustParam
"Bearing Vertical Justification"

Autodesk.Revit.DB.ParameterTypeId.TrussElementCreateBottomParam
"Create Bottom Chord"

Autodesk.Revit.DB.ParameterTypeId.TrussElementCreateTopParam
"Create Top Chord"

Autodesk.Revit.DB.ParameterTypeId.TrussElementAngleParam
"Rotation Angle"

Autodesk.Revit.DB.ParameterTypeId.TrussElementClassParam
"Engineering Type"

Autodesk.Revit.DB.ParameterTypeId.TrussLength
"Truss Length"

Autodesk.Revit.DB.ParameterTypeId.BoundaryParamPresetArea
"State"

Autodesk.Revit.DB.ParameterTypeId.BoundaryParamPresetLinear
"State"

Autodesk.Revit.DB.ParameterTypeId.BoundaryParamPreset
"State"

Autodesk.Revit.DB.ParameterTypeId.BoundaryZTranslationSpring
"Z Translation - Spring"

Autodesk.Revit.DB.ParameterTypeId.BoundaryZTranslationFixed
"Z Translation - Fixed"

Autodesk.Revit.DB.ParameterTypeId.BoundaryZRotationSpring
"Z Rotation - Spring"

Autodesk.Revit.DB.ParameterTypeId.BoundaryZRotationFixed
"Z Rotation - Fixed"

Autodesk.Revit.DB.ParameterTypeId.BoundaryYTranslationSpring
"Y Translation - Spring"

Autodesk.Revit.DB.ParameterTypeId.BoundaryYTranslationFixed
"Y Translation - Fixed"

Autodesk.Revit.DB.ParameterTypeId.BoundaryYRotationSpring
"Y Rotation - Spring"

Autodesk.Revit.DB.ParameterTypeId.BoundaryYRotationFixed
"Y Rotation - Fixed"

Autodesk.Revit.DB.ParameterTypeId.BoundaryXTranslationSpring
"X Translation - Spring"

Autodesk.Revit.DB.ParameterTypeId.BoundaryXTranslationFixed
"X Translation - Fixed"

Autodesk.Revit.DB.ParameterTypeId.BoundaryXRotationSpring
"X Rotation - Spring"

Autodesk.Revit.DB.ParameterTypeId.BoundaryXRotationFixed
"X Rotation - Fixed"

Autodesk.Revit.DB.ParameterTypeId.BoundaryAreaRestraintZ
"Z Spring Modulus"

Autodesk.Revit.DB.ParameterTypeId.BoundaryAreaRestraintY
"Y Spring Modulus"

Autodesk.Revit.DB.ParameterTypeId.BoundaryAreaRestraintX
"X Spring Modulus"

Autodesk.Revit.DB.ParameterTypeId.BoundaryLinearRestraintRotX
"X Spring Modulus"

Autodesk.Revit.DB.ParameterTypeId.BoundaryLinearRestraintZ
"Z Spring Modulus"

Autodesk.Revit.DB.ParameterTypeId.BoundaryLinearRestraintY
"Y Spring Modulus"

Autodesk.Revit.DB.ParameterTypeId.BoundaryLinearRestraintX
"X Spring Modulus"

Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintRotZ
"Z Spring Modulus"

Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintRotY
"Y Spring Modulus"

Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintRotX
"X Spring Modulus"

Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintZ
"Z Spring Modulus"

Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintY
"Y Spring Modulus"

Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintX
"X Spring Modulus"

Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionRotZ
"Z Rotation"

Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionRotY
"Y Rotation"

Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionRotX
"X Rotation"

Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionZ
"Z Translation"

Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionY
"Y Translation"

Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionX
"X Translation"

Autodesk.Revit.DB.ParameterTypeId.BoundaryConditionsIsExt
"Is Boundary Conditions External?"

Autodesk.Revit.DB.ParameterTypeId.BoundaryConditionsType
"Boundary Conditions Type"

Autodesk.Revit.DB.ParameterTypeId.KeySourceParam
"Key Source"

Autodesk.Revit.DB.ParameterTypeId.KeynoteParam
"Keynote"

Autodesk.Revit.DB.ParameterTypeId.KeynoteNumber
"Key Value"

Autodesk.Revit.DB.ParameterTypeId.SheetKeyNumber
"Sheet Key Number"

Autodesk.Revit.DB.ParameterTypeId.KeynoteText
"Keynote Text"

Autodesk.Revit.DB.ParameterTypeId.KeyValue
"Key Value"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamGrade
"Grade"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamSpecies
"Species"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamExpCoeff
"Thermal expansion coefficient"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamBending
"Bending"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamShearMod
"Shear modulus"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamPoissonMod
"Poisson ratio"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamShearPerpendicular
"Shear perpendicular to grain"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamShearParallel
"Shear parallel to grain"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamCompressionPerpendicular
"Compression perpendicular to grain"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamCompressionParallel
"Compression parallel to grain"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamYoungMod
"Young modulus"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamType
"Material Type"

Autodesk.Revit.DB.ParameterTypeId.ElemCategoryParamMt
"Category"

Autodesk.Revit.DB.ParameterTypeId.ElemCategoryParam
"Category"

Autodesk.Revit.DB.ParameterTypeId.MaterialVolume
"Volume"

Autodesk.Revit.DB.ParameterTypeId.MaterialArea
"Area"

Autodesk.Revit.DB.ParameterTypeId.MaterialAspaint
"As Paint"

Autodesk.Revit.DB.ParameterTypeId.MaterialName
"Name"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeSlopeOptionsDefParam
"Pipe Slope Options"

Autodesk.Revit.DB.ParameterTypeId.FabricationServiceParam
"Fabrication Service"

Autodesk.Revit.DB.ParameterTypeId.ConnectorAngleOfDeflection
"Angle of Deflection"

Autodesk.Revit.DB.ParameterTypeId.ConnectorLength
"Length"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctSystemCalculationParam
"Calculations"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeSystemCalculationParam
"Calculations"

Autodesk.Revit.DB.ParameterTypeId.RbsPipingSystemTypeParam
"System Type"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctSystemTypeParam
"System Type"

Autodesk.Revit.DB.ParameterTypeId.RbsSystemAbbreviationParam
"Abbreviation"

Autodesk.Revit.DB.ParameterTypeId.MepSystemLineGraphicsOverridesParam
"Graphic Overrides"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeSlopeDefParam
"Pipe Slope Definitions"

Autodesk.Revit.DB.ParameterTypeId.ConnectorEngagementLength
"Engagement Length"

Autodesk.Revit.DB.ParameterTypeId.RbsSystemFlowConversionMethodParam
"Flow Conversion Method"

Autodesk.Revit.DB.ParameterTypeId.RbsSystemNumElementsParam
"Number of Elements"

Autodesk.Revit.DB.ParameterTypeId.RbsSystemBaseElementParam
"System Equipment"

Autodesk.Revit.DB.ParameterTypeId.RbsSystemClassificationParam
"System Classification"

Autodesk.Revit.DB.ParameterTypeId.RbsSystemNameParam
"System Name"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamLightWeight
"Lightweight"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamBehavior
"Behavior"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamResistanceCalcStrength
"Resistance calculation strength"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamReductionFactor
"Reduction factor for shear"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamMinimumTensileStrength
"Minimum tensile strength"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamMinimumYieldStress
"Minimum yield stress"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamShearStrengthReduction
"Shear strength modification"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamShearReinforcement
"Shear reinforcement yield stress"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamBendingReinforcement
"Bending reinforcement"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamConcreteCompression
"Concrete compression"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamExpCoeff3
"Thermal expansion coefficient Z"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamExpCoeff2
"Thermal expansion coefficient Y"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamExpCoeff1
"Thermal expansion coefficient X"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamUnitWeight
"Unit weight"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamShearMod3
"Shear modulus Z"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamShearMod2
"Shear modulus Y"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamShearMod1
"Shear modulus X"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamPoissonMod3
"Poisson ratio Z"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamPoissonMod2
"Poisson ratio Y"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamPoissonMod1
"Poisson ratio X"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamYoungMod3
"Young modulus Z"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamYoungMod2
"Young modulus Y"

Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamYoungMod1
"Young modulus X"

Autodesk.Revit.DB.ParameterTypeId.PipeVelocityPressure
"Velocity Pressure"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeSizeMaximum
"Maximum Size"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeSizeMinimum
"Minimum Size"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctPressureDrop
"Pressure Drop"

Autodesk.Revit.DB.ParameterTypeId.RoutingPreferenceParam
"Routing Preference"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctRoutingPreferenceParam
"Routing Preferences"

Autodesk.Revit.DB.ParameterTypeId.RbsSegmentDescriptionParam
"Segment Description"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeJointtypeParam
"Connection Type"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeSegmentParam
"Pipe Segment"

Autodesk.Revit.DB.ParameterTypeId.RbsRoutingPreferenceParam
"Routing Preferences"

Autodesk.Revit.DB.ParameterTypeId.RbsParallelpipesVerticalOffsetValue
"Vertical Offset value for parallel pipes"

Autodesk.Revit.DB.ParameterTypeId.RbsParallelpipesHorizontalOffsetValue
"Horizontal Offset value for parallel pipes"

Autodesk.Revit.DB.ParameterTypeId.RbsParallelpipesVerticalNumber
"Vertical Number for parallel pipes"

Autodesk.Revit.DB.ParameterTypeId.RbsParallelpipesHorizontalNumber
"Horizontal Number for parallel pipes"

Autodesk.Revit.DB.ParameterTypeId.RbsParallelconduitsVerticalOffsetValue
"Vertical Offset value for parallel conduits"

Autodesk.Revit.DB.ParameterTypeId.RbsParallelconduitsHorizontalOffsetValue
"Horizontal Offset value for parallel conduits"

Autodesk.Revit.DB.ParameterTypeId.RbsParallelconduitsVerticalNumber
"Vertical Number for parallel conduits"

Autodesk.Revit.DB.ParameterTypeId.RbsParallelconduitsHorizontalNumber
"Horizontal Number for parallel conduits"

Autodesk.Revit.DB.ParameterTypeId.RbsFpSprinklerOrificeSizeParam
"Orifice Size"

Autodesk.Revit.DB.ParameterTypeId.RbsFpSprinklerTemperatureRatingParam
"Temperature Rating"

Autodesk.Revit.DB.ParameterTypeId.RbsFpSprinklerKFactorParam
"K-Factor"

Autodesk.Revit.DB.ParameterTypeId.RbsFpSprinklerPressureClassParam
"Pressure Class"

Autodesk.Revit.DB.ParameterTypeId.RbsFpSprinklerOrificeParam
"Orifice"

Autodesk.Revit.DB.ParameterTypeId.RbsFpSprinklerCoverageParam
"Coverage"

Autodesk.Revit.DB.ParameterTypeId.RbsFpSprinklerResponseParam
"Response"

Autodesk.Revit.DB.ParameterTypeId.MepProfileTypeParam
"Shape"

Autodesk.Revit.DB.ParameterTypeId.RbsShowProfileType
"Show Round"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeSystemFixtureUnitParam
"Fixture Units"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeSlope
"Slope"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctSlope
"Slope"

Autodesk.Revit.DB.ParameterTypeId.RbsCurveUtslope
"Slope"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeVolumeParam
"Volume"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeWfuParam
"WFU"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeHwfuParam
"HWFU"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeCwfuParam
"CWFU"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeFlowConfigurationParam
"Flow Configuration"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeFlowDirectionParam
"Flow Direction"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeFixtureUnitsParam
"Fixture Units"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeStaticPressure
"Static Pressure"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeInsulationThickness
"Insulation Thickness"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctBottomElevation
"Lower End Bottom Elevation"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctTopElevation
"Upper End Top Elevation"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeOuterDiameter
"Outside Diameter"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeInvertElevation
"Invert Elevation": This parameter is obsolete. It exists only for compatibility.

Autodesk.Revit.DB.ParameterTypeId.RbsPipeTypeFittingLossMethodParam
"Loss Method"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeTypeFittingLossTableParam
"K Coefficient Table"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeTypeFittingLossKfactorParam
"K Coefficient"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeTypeValveLossCvfactorParam
"Cv Coefficient"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeFittingLossMethodParam
"Loss Method"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeFittingLossTableParam
"K Coefficient Table"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeFittingLossKfactorParam
"K Coefficient"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeValveLossCvfactorParam
"Cv Coefficient"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeAdditionalFlowParam
"Additional Flow"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeDiameterParam
"Diameter"

Autodesk.Revit.DB.ParameterTypeId.RbsCurveSlope
"Slope Percentage (%)"

Autodesk.Revit.DB.ParameterTypeId.RbsAdjustableConnector
"Allow Slope Adjustments"

Autodesk.Revit.DB.ParameterTypeId.RbsFlowFactorParam
"Flow Factor"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctFlowConfigurationParam
"Flow Configuration"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctFlowDirectionParam
"Flow Direction"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeFluidTypeParam
"Fluid Type"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeFluidTemperatureParam
"Fluid Temperature"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeFluidViscosityParam
"Fluid Dynamic Viscosity"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeFluidDensityParam
"Fluid Density"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeFlowParam
"Flow"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeInnerDiamParam
"Inside Diameter"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeReynoldsNumberParam
"Reynolds Number"

Autodesk.Revit.DB.ParameterTypeId.RelativeRoughness
"Relative Roughness"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeFlowStateParam
"Flow State"

Autodesk.Revit.DB.ParameterTypeId.FrictionFactor
"Friction Factor"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeVelocityParam
"Velocity"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeFrictionParam
"Friction"

Autodesk.Revit.DB.ParameterTypeId.RbsPipePressuredropParam
"Pressure Drop"

Autodesk.Revit.DB.ParameterTypeId.PipeRoughness
"Roughness"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeMaterialParam
"Material"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeConnectiontypeParam
"Connection Type"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeClassParam
"Schedule/Type"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitSlotIndex
"Slot Index"

Autodesk.Revit.DB.ParameterTypeId.CircuitWaysParam
"Ways"

Autodesk.Revit.DB.ParameterTypeId.CircuitLoadClassificationAbbreviationParam
"Load Classification Abbreviation"

Autodesk.Revit.DB.ParameterTypeId.CircuitPhaseParam
"Phase Label"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitNamingIndex
"Circuit Naming Index"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitConnectionTypeParam
"Connection Type"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitPathOffsetParam
"Offset"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitPathModeParam
"Path Mode"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitStartSlot
"Start Slot"

Autodesk.Revit.DB.ParameterTypeId.ConnectorGenderType
"Connector Gender Type"

Autodesk.Revit.DB.ParameterTypeId.ConnectorJointType
"Connector Joint Type"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelConfigurationParam
"Panel Configuration"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelLocationParam
"Location"

Autodesk.Revit.DB.ParameterTypeId.PanelScheduleName
"Panel Schedule Name"

Autodesk.Revit.DB.ParameterTypeId.TemplateName
"Template"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelCurrentPhasecParam
"Current Phase C"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelCurrentPhasebParam
"Current Phase B"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelCurrentPhaseaParam
"Current Phase A"

Autodesk.Revit.DB.ParameterTypeId.RbsElecLoadsummaryDemandFactorRuleParam
"Description"

Autodesk.Revit.DB.ParameterTypeId.RbsElecLoadsummaryDemandCurrentParam
"Estimated Demand Current"

Autodesk.Revit.DB.ParameterTypeId.RbsElecLoadsummaryConnectedCurrentParam
"Connected Current"

Autodesk.Revit.DB.ParameterTypeId.RbsElecLoadsummaryDemandLoadParam
"Estimated Demand (VA)"

Autodesk.Revit.DB.ParameterTypeId.RbsElecLoadsummaryDemandFactorParam
"Demand Factor"

Autodesk.Revit.DB.ParameterTypeId.RbsElecLoadsummaryConnectedLoadParam
"Connected Load (VA)"

Autodesk.Revit.DB.ParameterTypeId.RbsElecLoadsummaryLoadclassificationParam
"Load Classification"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitNotesParam
"Schedule Circuit Notes"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitNumberOfElementsParam
"Number of Elements"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitFrameParam
"Frame"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalDemandCurrentParam
"Total Estimated Demand Current"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalConnectedCurrentParam
"Total Connected Current"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalDemandFactorParam
"Total Demand Factor"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelScheduleFooterNotesParam
"Schedule Footer Notes"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelScheduleHeaderNotesParam
"Schedule Header Notes"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelNumwiresParam
"Number of Wires"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelNumphasesParam
"Number of Phases"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelNeutralRatingParam
"Neutral Rating"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelNeutralBusParam
"Neutral Bus"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelGroundBusParam
"Ground Bus"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelBussingParam
"Bussing"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelSubfeedLugsParam
"SubFeed Lugs"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelSupplyFromParam
"Supply From"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelMcbRatingParam
"MCB Rating"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelMainstypeParam
"Mains Type"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelFeedParam
"Feed"

Autodesk.Revit.DB.ParameterTypeId.RbsConduitrunOuterDiamParam
"Outside Diameter"

Autodesk.Revit.DB.ParameterTypeId.RbsConduitrunInnerDiamParam
"Inside Diameter"

Autodesk.Revit.DB.ParameterTypeId.RbsConduitrunDiameterParam
"Diameter(Trade Size)"

Autodesk.Revit.DB.ParameterTypeId.RbsCabletrayrunWidthParam
"Width"

Autodesk.Revit.DB.ParameterTypeId.RbsCabletrayrunHeightParam
"Height"

Autodesk.Revit.DB.ParameterTypeId.RbsCabletrayconduitrunLengthParam
"Length"

Autodesk.Revit.DB.ParameterTypeId.RbsLoadSubClassificationMotor
"Load Sub-Classification Motor"

Autodesk.Revit.DB.ParameterTypeId.RbsCabletrayShapetype
"Shape"

Autodesk.Revit.DB.ParameterTypeId.RbsCabletrayconduitBendorfitting
"Bend or Fitting"

Autodesk.Revit.DB.ParameterTypeId.RbsCtcServiceType
"Service Type"

Autodesk.Revit.DB.ParameterTypeId.RbsConduitOuterDiamParam
"Outside Diameter"

Autodesk.Revit.DB.ParameterTypeId.RbsConduitInnerDiamParam
"Inside Diameter"

Autodesk.Revit.DB.ParameterTypeId.RbsCtcBottomElevation
"Lower End Bottom Elevation"

Autodesk.Revit.DB.ParameterTypeId.RbsCtcTopElevation
"Upper End Top Elevation"

Autodesk.Revit.DB.ParameterTypeId.RbsConduitDiameterParam
"Diameter(Trade Size)"

Autodesk.Revit.DB.ParameterTypeId.RbsCabletrayWidthParam
"Width"

Autodesk.Revit.DB.ParameterTypeId.RbsCabletrayHeightParam
"Height"

Autodesk.Revit.DB.ParameterTypeId.CircuitLoadClassificationParam
"Load Classification"

Autodesk.Revit.DB.ParameterTypeId.CabletrayMinbendmultiplierParam
"Bend Radius Multiplier"

Autodesk.Revit.DB.ParameterTypeId.ConduitStandardTypeParam
"Standard"

Autodesk.Revit.DB.ParameterTypeId.RbsConduitTradesize
"Conduit Size Lookup"

Autodesk.Revit.DB.ParameterTypeId.RbsConduitBendradius
"Bend Radius"

Autodesk.Revit.DB.ParameterTypeId.RbsCabletrayBendradius
"Bend Radius"

Autodesk.Revit.DB.ParameterTypeId.RbsCabletrayRungheight
"Rung Height"

Autodesk.Revit.DB.ParameterTypeId.RbsCabletrayRungwidth
"Rung Width"

Autodesk.Revit.DB.ParameterTypeId.RbsCabletrayRungspace
"Rung Space"

Autodesk.Revit.DB.ParameterTypeId.RbsCabletrayThickness
"Thickness"

Autodesk.Revit.DB.ParameterTypeId.RbsElecSwitchIdParam
"Switch ID"

Autodesk.Revit.DB.ParameterTypeId.RbsWireCircuitDescription
"Circuit Description"

Autodesk.Revit.DB.ParameterTypeId.RbsWireCircuitLoadName
"Circuit Load Name"

Autodesk.Revit.DB.ParameterTypeId.RbsWireNumConductorsParam
"Number of Conductors"

Autodesk.Revit.DB.ParameterTypeId.RbsElecWireTickmarkState
"Tick Marks"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitPanelParam
"Panel"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitNumber
"Circuit Number"

Autodesk.Revit.DB.ParameterTypeId.RbsElecWireCircuits
"Circuits"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitWireNumRunsParam
"# of Runs"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitWireNumHotsParam
"# of Hot Conductors"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitWireNumNeutralsParam
"# of Neutral Conductors"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitWireNumGroundsParam
"# of Ground Conductors"

Autodesk.Revit.DB.ParameterTypeId.RbsElecWireType
"Type"

Autodesk.Revit.DB.ParameterTypeId.RbsElecWireElevation
"Elevation"

Autodesk.Revit.DB.ParameterTypeId.RbsElecWireHotAdjustment
"Hot Conductors"

Autodesk.Revit.DB.ParameterTypeId.RbsElecWireNeutralAdjustment
"Neutral Conductors"

Autodesk.Revit.DB.ParameterTypeId.RbsElecWireGroundAdjustment
"Ground Conductors"

Autodesk.Revit.DB.ParameterTypeId.RbsElecWireShareNeutral
"Share Neutral Conductor"

Autodesk.Revit.DB.ParameterTypeId.RbsElecWireShareGround
"Share Ground Conductor"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitName
"Load Name"

Autodesk.Revit.DB.ParameterTypeId.RbsFamilyContentSecondaryDistribsys
"Secondary Distribution System"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitNaming
"Circuit Naming"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitPrefixSeparator
"Circuit Prefix Separator"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitPrefix
"Circuit Prefix"

Autodesk.Revit.DB.ParameterTypeId.RbsElecModifications
"Modifications"

Autodesk.Revit.DB.ParameterTypeId.RbsElecEnclosure
"Enclosure"

Autodesk.Revit.DB.ParameterTypeId.RbsElecMains
"Mains"

Autodesk.Revit.DB.ParameterTypeId.RbsElecMounting
"Mounting"

Autodesk.Revit.DB.ParameterTypeId.RbsElecShortCircuitRating
"Short Circuit Rating"

Autodesk.Revit.DB.ParameterTypeId.RbsElecMaxPoleBreakers
"Max Number of Single Pole Breakers"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelName
"Panel Name"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalestloadHvacParam
"HVAC Total Estimated Demand"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalloadHvacParam
"HVAC Total Connected"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalestloadLightParam
"Lighting Total Estimated Demand"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalloadLightParam
"Lighting Total Connected"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalestloadPowerParam
"Power Total Estimated Demand"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalloadPowerParam
"Power Total Connected"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalestloadOtherParam
"Other Total Estimated Demand"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalloadOtherParam
"Other Total Connected"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalestloadParam
"Total Estimated Demand"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalloadParam
"Total Connected"

Autodesk.Revit.DB.ParameterTypeId.RbsElecDemandfactorLoadclassificationParam
"Load Classification"

Autodesk.Revit.DB.ParameterTypeId.RbsElecDemandfactorLoadParam
"Connected Load"

Autodesk.Revit.DB.ParameterTypeId.RbsElecDemandfactorDemandloadParam
"Estimated Demand Load"

Autodesk.Revit.DB.ParameterTypeId.RbsFamilyContentDistributionSystem
"Distribution System"

Autodesk.Revit.DB.ParameterTypeId.RbsDistributionsysVllParam
"Line to Line Voltage"

Autodesk.Revit.DB.ParameterTypeId.RbsDistributionsysVlgParam
"Line to Ground Voltage"

Autodesk.Revit.DB.ParameterTypeId.RbsDistributionsysPhaseParam
"Phase"

Autodesk.Revit.DB.ParameterTypeId.RbsDistributionsysConfigParam
"Configuration"

Autodesk.Revit.DB.ParameterTypeId.RbsDistributionsysNumwiresParam
"Wires"

Autodesk.Revit.DB.ParameterTypeId.RbsVoltagetypeVoltageParam
"Actual Voltage"

Autodesk.Revit.DB.ParameterTypeId.RbsVoltagetypeMinvoltageParam
"Minimum Voltage"

Autodesk.Revit.DB.ParameterTypeId.RbsVoltagetypeMaxvoltageParam
"Maximum Voltage"

Autodesk.Revit.DB.ParameterTypeId.RbsElecApparentLoadPhasec
"Apparent Load Phase C"

Autodesk.Revit.DB.ParameterTypeId.RbsElecApparentLoadPhaseb
"Apparent Load Phase B"

Autodesk.Revit.DB.ParameterTypeId.RbsElecApparentLoadPhasea
"Apparent Load Phase A"

Autodesk.Revit.DB.ParameterTypeId.RbsElecTrueLoadPhasec
"True Load Phase C"

Autodesk.Revit.DB.ParameterTypeId.RbsElecTrueLoadPhaseb
"True Load Phase B"

Autodesk.Revit.DB.ParameterTypeId.RbsElecTrueLoadPhasea
"True Load Phase A"

Autodesk.Revit.DB.ParameterTypeId.RbsElecTrueCurrentParam
"True Current"

Autodesk.Revit.DB.ParameterTypeId.RbsElecTrueCurrentPhaseaParam
"True Current Phase A"

Autodesk.Revit.DB.ParameterTypeId.RbsElecTrueCurrentPhasebParam
"True Current Phase B"

Autodesk.Revit.DB.ParameterTypeId.RbsElecTrueCurrentPhasecParam
"True Current Phase C"

Autodesk.Revit.DB.ParameterTypeId.RbsElecApparentCurrentParam
"Apparent Current"

Autodesk.Revit.DB.ParameterTypeId.RbsElecApparentCurrentPhaseaParam
"Apparent Current Phase A"

Autodesk.Revit.DB.ParameterTypeId.RbsElecApparentCurrentPhasebParam
"Apparent Current Phase B"

Autodesk.Revit.DB.ParameterTypeId.RbsElecApparentCurrentPhasecParam
"Apparent Current Phase C"

Autodesk.Revit.DB.ParameterTypeId.RbsElecVoltageDropParam
"Voltage Drop"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCalcCoefficientUtilization
"Calculate Coefficient of Utilization"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitLengthParam
"Length"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitRatingParam
"Rating"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitWireSizeParam
"Wire Size"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitWireTypeParam
"Wire Type"

Autodesk.Revit.DB.ParameterTypeId.RbsElecRoomCavityRatio
"Room Cavity Ratio"

Autodesk.Revit.DB.ParameterTypeId.FbxLightPhotometricFile
"Photometric Web File"

Autodesk.Revit.DB.ParameterTypeId.RbsElecRoomAverageIllumination
"Average Estimated Illumination"

Autodesk.Revit.DB.ParameterTypeId.RbsElecRoomReflectivityFloor
"Floor Reflectance"

Autodesk.Revit.DB.ParameterTypeId.RbsElecRoomReflectivityWalls
"Wall Reflectance"

Autodesk.Revit.DB.ParameterTypeId.RbsElecRoomReflectivityCeiling
"Ceiling Reflectance"

Autodesk.Revit.DB.ParameterTypeId.RbsElecRoomLightingCalcWorkplane
"Lighting Calculation Workplane"

Autodesk.Revit.DB.ParameterTypeId.RbsWireMaterialParam
"Material"

Autodesk.Revit.DB.ParameterTypeId.RbsWireTemperatureRatingParam
"Temperature Rating"

Autodesk.Revit.DB.ParameterTypeId.RbsWireInsulationParam
"Insulation"

Autodesk.Revit.DB.ParameterTypeId.RbsWireMaxConductorSizeParam
"Max Size"

Autodesk.Revit.DB.ParameterTypeId.RbsWireNeutralMultiplierParam
"Neutral Multiplier"

Autodesk.Revit.DB.ParameterTypeId.RbsWireNeutralIncludedInBalancedLoadParam
"Neutral Included in Balanced Load"

Autodesk.Revit.DB.ParameterTypeId.RbsWireNeutralModeParam
"Neutral Size"

Autodesk.Revit.DB.ParameterTypeId.RbsWireConduitTypeParam
"Conduit Type"

Autodesk.Revit.DB.ParameterTypeId.RbsElecAmbientTemperature
"Ambient Temperature"

Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitType
"System Type"

Autodesk.Revit.DB.ParameterTypeId.RbsElecLoadClassification
"Load Classification"

Autodesk.Revit.DB.ParameterTypeId.RbsElecTrueLoadPhase3
"True Load Phase 3"

Autodesk.Revit.DB.ParameterTypeId.RbsElecTrueLoadPhase2
"True Load Phase 2"

Autodesk.Revit.DB.ParameterTypeId.RbsElecTrueLoadPhase1
"True Load Phase 1"

Autodesk.Revit.DB.ParameterTypeId.RbsElecTrueLoad
"True Load"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPowerFactorState
"Power Factor State"

Autodesk.Revit.DB.ParameterTypeId.RbsElecPowerFactor
"Power Factor"

Autodesk.Revit.DB.ParameterTypeId.RbsElecApparentLoadPhase3
"Apparent Load Phase 3"

Autodesk.Revit.DB.ParameterTypeId.RbsElecApparentLoadPhase2
"Apparent Load Phase 2"

Autodesk.Revit.DB.ParameterTypeId.RbsElecApparentLoadPhase1
"Apparent Load Phase 1"

Autodesk.Revit.DB.ParameterTypeId.RbsElecApparentLoad
"Apparent Load"

Autodesk.Revit.DB.ParameterTypeId.RbsElecBalancedLoad
"Balanced Load"

Autodesk.Revit.DB.ParameterTypeId.RbsElecVoltage
"Voltage"

Autodesk.Revit.DB.ParameterTypeId.RbsElecNumberOfPoles
"Number of Poles"

Autodesk.Revit.DB.ParameterTypeId.RbsConnectorDescription
"Connector Description"

Autodesk.Revit.DB.ParameterTypeId.ViewFamilySchedules
"Family"

Autodesk.Revit.DB.ParameterTypeId.ViewFamilyAndTypeSchedules
"Family and Type"

Autodesk.Revit.DB.ParameterTypeId.ViewTypeSchedules
"Type"

Autodesk.Revit.DB.ParameterTypeId.MarkupsPrivate
"Private"

Autodesk.Revit.DB.ParameterTypeId.MarkupsNotes
"Notes"

Autodesk.Revit.DB.ParameterTypeId.MarkupsHistory
"History"

Autodesk.Revit.DB.ParameterTypeId.MarkupsStatus
"Status"

Autodesk.Revit.DB.ParameterTypeId.MarkupsLabel
"Label"

Autodesk.Revit.DB.ParameterTypeId.MarkupsCreator
"Creator"

Autodesk.Revit.DB.ParameterTypeId.MarkupsCreated
"Created"

Autodesk.Revit.DB.ParameterTypeId.MarkupsModified
"Modified"

Autodesk.Revit.DB.ParameterTypeId.ViewSchemaSettingForSystemTemplate
"System Color Schemes"

Autodesk.Revit.DB.ParameterTypeId.LegendComponentDetailLevel
"Detail Level"

Autodesk.Revit.DB.ParameterTypeId.LegendComponentLength
"Host Length"

Autodesk.Revit.DB.ParameterTypeId.LegendComponentView
"View Direction"

Autodesk.Revit.DB.ParameterTypeId.LegendComponent
"Component Type"

Autodesk.Revit.DB.ParameterTypeId.OptionSetId
"Design Option Set Id"

Autodesk.Revit.DB.ParameterTypeId.OptionName
"Name"

Autodesk.Revit.DB.ParameterTypeId.PrimaryOptionId
"Primary Option Id"

Autodesk.Revit.DB.ParameterTypeId.OptionSetName
"Name"

Autodesk.Revit.DB.ParameterTypeId.GroupAttachedParentName
"Attached to"

Autodesk.Revit.DB.ParameterTypeId.GroupAllowedViewTypes
"Allowed View Types"

Autodesk.Revit.DB.ParameterTypeId.GroupOffsetFromLevel
"Origin Level Offset"

Autodesk.Revit.DB.ParameterTypeId.GroupLevel
"Reference Level"

Autodesk.Revit.DB.ParameterTypeId.MepSystemFillGraphicsOverridesParam
"Fill Pattern Graphics Overrides"

Autodesk.Revit.DB.ParameterTypeId.DuctTerminalEngagementLength
"Engagement Length"

Autodesk.Revit.DB.ParameterTypeId.ConnectorInsideDiameter
"Inside Diameter"

Autodesk.Revit.DB.ParameterTypeId.ConnectorDiameter
"Diameter"

Autodesk.Revit.DB.ParameterTypeId.RbsCabletrayconduitConnectorelemType
"Connector Type"

Autodesk.Revit.DB.ParameterTypeId.RbsCabletrayconduitSystemType
"System Type"

Autodesk.Revit.DB.ParameterTypeId.RbsConnectorIsprimary
"Primary Connector"

Autodesk.Revit.DB.ParameterTypeId.ConnectorReferenceIndex
"Link Connector Index"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeConnectorSystemClassificationParam
"System Classification"

Autodesk.Revit.DB.ParameterTypeId.ConnectorAngle
"Angle"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctConnectorSystemClassificationParam
"System Classification"

Autodesk.Revit.DB.ParameterTypeId.ConnectorIndex
"Index"

Autodesk.Revit.DB.ParameterTypeId.ConnectorVisibleSize
"Size on screen"

Autodesk.Revit.DB.ParameterTypeId.ConnectorHeight
"Height"

Autodesk.Revit.DB.ParameterTypeId.ConnectorWidth
"Width"

Autodesk.Revit.DB.ParameterTypeId.ConnectorRadius
"Radius"

Autodesk.Revit.DB.ParameterTypeId.ConnectorProfileType
"Shape"

Autodesk.Revit.DB.ParameterTypeId.PipingGenderType
"Gender Type"

Autodesk.Revit.DB.ParameterTypeId.PipingConnectionType
"Connection Type"

Autodesk.Revit.DB.ParameterTypeId.RbsPartType
"Part Type"

Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionEditRangesOfApplicability
"Modify Ranges of applicability"

Autodesk.Revit.DB.ParameterTypeId.SpaceComposednameParam
"Composed Name"

Autodesk.Revit.DB.ParameterTypeId.SpaceNumberParam
"Number"

Autodesk.Revit.DB.ParameterTypeId.ConstructionIsSchematic
"Schematic"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalZoneName
"Name"

Autodesk.Revit.DB.ParameterTypeId.ZoneDesignCoolTemperature
"Design Temperature for Cooling"

Autodesk.Revit.DB.ParameterTypeId.ZoneDesignHeatTemperature
"Design Temperature for Heating"

Autodesk.Revit.DB.ParameterTypeId.ZoneOutsideAirFlowPerPerson
"Outside Air Flow per Person"

Autodesk.Revit.DB.ParameterTypeId.ZoneOutsideAirFlowPerArea
"Outside Air Flow per Area"

Autodesk.Revit.DB.ParameterTypeId.ZoneAirChangesPerHour
"Air Changes per Hour"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalZone
"Analytical Zone"

Autodesk.Revit.DB.ParameterTypeId.SpaceNumberOfPeople
"Number of People"

Autodesk.Revit.DB.ParameterTypeId.SpaceConditionType
"Condition Type"

Autodesk.Revit.DB.ParameterTypeId.SpaceTypeGbxml
"Space Type (gbXML)"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalSurface
"Analytical Surface"

Autodesk.Revit.DB.ParameterTypeId.SurfaceName
"Name"

Autodesk.Revit.DB.ParameterTypeId.OriginatingElementName
"Originating Element"

Autodesk.Revit.DB.ParameterTypeId.WindowTypeName
"Name"

Autodesk.Revit.DB.ParameterTypeId.ConstructionName
"Name"

Autodesk.Revit.DB.ParameterTypeId.AnalyticConstruction
"Analytic Construction"

Autodesk.Revit.DB.ParameterTypeId.Tilt
"Tilt"

Autodesk.Revit.DB.ParameterTypeId.Azimuth
"Azimuth"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalAdjacentSpace
"Adjacent Analytical Space"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalSpace
"Analytical Space"

Autodesk.Revit.DB.ParameterTypeId.SpaceNameParam
"Name"

Autodesk.Revit.DB.ParameterTypeId.SystemsAnalysisReportFolder
"Reports Folder Path"

Autodesk.Revit.DB.ParameterTypeId.SystemsAnalysisReportStyle
"Report Style"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisProjectPhase
"Phase"

Autodesk.Revit.DB.ParameterTypeId.SpaceVolume
"Volume"

Autodesk.Revit.DB.ParameterTypeId.SpaceArea
"Area"

Autodesk.Revit.DB.ParameterTypeId.PeakLatentCoolingLoad
"Peak Latent Cooling Load"

Autodesk.Revit.DB.ParameterTypeId.PeakAirflowParam
"Peak Airflow"

Autodesk.Revit.DB.ParameterTypeId.SpaceReferenceLevelParam
"Reference Level"

Autodesk.Revit.DB.ParameterTypeId.SpaceInfiltrationAirflow
"Infiltration Airflow"

Autodesk.Revit.DB.ParameterTypeId.SpaceInfiltrationAirflowPerArea
"Infiltration Airflow per area"

Autodesk.Revit.DB.ParameterTypeId.SpaceOutdoorAirflow
"Outdoor Airflow"

Autodesk.Revit.DB.ParameterTypeId.SpaceOutdoorAirflowPerPerson
"Outdoor Airflow per person"

Autodesk.Revit.DB.ParameterTypeId.SpaceOutdoorAirflowPerArea
"Outdoor Airflow per area"

Autodesk.Revit.DB.ParameterTypeId.SpaceAirChangesPerHour
"Air Changes per Hour"

Autodesk.Revit.DB.ParameterTypeId.SpacePowerLoadParam
"Power Load"

Autodesk.Revit.DB.ParameterTypeId.SpaceLightingLoadParam
"Lighting Load"

Autodesk.Revit.DB.ParameterTypeId.SpacePeopleLoadParam
"Occupancy Load"

Autodesk.Revit.DB.ParameterTypeId.SpacePowerLoadPerAreaParam
"Power Load per area"

Autodesk.Revit.DB.ParameterTypeId.SpaceLightingLoadPerAreaParam
"Lighting Load per area"

Autodesk.Revit.DB.ParameterTypeId.SpacePeopleLatentHeatGainPerPersonParam
"Latent Heat Gain per person"

Autodesk.Revit.DB.ParameterTypeId.SpacePeopleSensibleHeatGainPerPersonParam
"Sensible Heat Gain per person"

Autodesk.Revit.DB.ParameterTypeId.SpaceAreaPerPersonParam
"Area per person"

Autodesk.Revit.DB.ParameterTypeId.SpaceAirflowPerAreaParam
"Airflow per area"

Autodesk.Revit.DB.ParameterTypeId.PeakCoolingLoadParam
"Peak Cooling Load"

Autodesk.Revit.DB.ParameterTypeId.PeakHeatingLoadParam
"Peak Heating Load"

Autodesk.Revit.DB.ParameterTypeId.SpaceDehumidificationSetPoint
"Dehumidification Set Point"

Autodesk.Revit.DB.ParameterTypeId.SpaceHumidificationSetPoint
"Humidification Set Point"

Autodesk.Revit.DB.ParameterTypeId.SpaceCoolingSetPoint
"Cooling Set Point"

Autodesk.Revit.DB.ParameterTypeId.SpaceHeatingSetPoint
"Heating Set Point"

Autodesk.Revit.DB.ParameterTypeId.ZoneLevelOffsetTop
"Top Offset"

Autodesk.Revit.DB.ParameterTypeId.ZoneLevelOffset
"Level Offset"

Autodesk.Revit.DB.ParameterTypeId.SystemZoneLevelId
"Level"

Autodesk.Revit.DB.ParameterTypeId.ZoneCalculatedHydronicCoolingflowParam
"Calculated Hydronic Cooling Flow"

Autodesk.Revit.DB.ParameterTypeId.ZoneCalculatedHydronicHeatingflowParam
"Calculated Hydronic Heating Flow"

Autodesk.Revit.DB.ParameterTypeId.ZoneSpaceOutdoorAirOptionParam
"Space Outdoor Air Option"

Autodesk.Revit.DB.ParameterTypeId.RbsGbxmlOpeningType
"Opening Type"

Autodesk.Revit.DB.ParameterTypeId.RoomCalculationPoint
"Room Calculation Point"

Autodesk.Revit.DB.ParameterTypeId.GridBankColWidth
"Column Distance"

Autodesk.Revit.DB.ParameterTypeId.GridBankRowHeight
"Row Distance"

Autodesk.Revit.DB.ParameterTypeId.GridBankColNum
"Column"

Autodesk.Revit.DB.ParameterTypeId.GridBankRowNum
"Row"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultBendParam
"Bend"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultHorizontalBendParam
"Horizontal Bend"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeMultishapeTransitionOvalroundParam
"Multi Shape Transition Oval to Round"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeMultishapeTransitionRectovalParam
"Multi Shape Transition Rect to Oval"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultTeedownParam
"Tee Down"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultTeeupParam
"Tee Up"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultElbowdownParam
"Vertical Outside Bend"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultElbowupParam
"Vertical Inside Bend"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisExportCategoryParam
"Export Category"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisExportComplexityParam
"Export Complexity"

Autodesk.Revit.DB.ParameterTypeId.SpaceZoneName
"Zone"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisExportGbxmlDefaultsParam
"Export Default Values"

Autodesk.Revit.DB.ParameterTypeId.RbsHvacloadPlenumCoolingLoadParam
"Plenum Cooling Load"

Autodesk.Revit.DB.ParameterTypeId.RbsHvacloadSkylightCoolingLoadParam
"Skylight Cooling Load"

Autodesk.Revit.DB.ParameterTypeId.RbsHvacloadPartitionCoolingLoadParam
"Partition Cooling Load"

Autodesk.Revit.DB.ParameterTypeId.RbsHvacloadDoorCoolingLoadParam
"Door Cooling Load"

Autodesk.Revit.DB.ParameterTypeId.RbsHvacloadWindowCoolingLoadParam
"Window Cooling Load"

Autodesk.Revit.DB.ParameterTypeId.RbsHvacloadWallCoolingLoadParam
"Wall Cooling Load"

Autodesk.Revit.DB.ParameterTypeId.RbsHvacloadRoofCoolingLoadParam
"Roof Cooling Load"

Autodesk.Revit.DB.ParameterTypeId.RbsHvacloadSkylightAreaParam
"Skylight Area"

Autodesk.Revit.DB.ParameterTypeId.RbsHvacloadPartitionAreaParam
"Partition Area"

Autodesk.Revit.DB.ParameterTypeId.RbsHvacloadFloorAreaParam
"Floor Area"

Autodesk.Revit.DB.ParameterTypeId.RbsHvacloadDoorAreaParam
"Door Area"

Autodesk.Revit.DB.ParameterTypeId.RbsHvacloadWindowAreaParam
"Window Area"

Autodesk.Revit.DB.ParameterTypeId.RbsHvacloadWallAreaParam
"Wall Area"

Autodesk.Revit.DB.ParameterTypeId.RbsHvacloadRoofAreaParam
"Roof Area"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewCoordAxisMode
"Show a Coordinate System Symbol for each Surface"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewRbeMode
"Show Room Bounding Elements Dimmed and Underlay"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewShadingSurfacesMode
"Show Shading Surfaces"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewTransparentMode
"Show Surfaces Transparent"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewSurfacesMode
"Show Surfaces"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewInnerShellMode
"Show Inner Space Shells"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewOuterShellMode
"Show Analytical Space Shells"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewBuildingShellMode
"Show Analytical Building Shell"

Autodesk.Revit.DB.ParameterTypeId.RbsLiningThicknessForDuct
"Lining Thickness"

Autodesk.Revit.DB.ParameterTypeId.RbsInsulationThicknessForPipe
"Insulation Thickness"

Autodesk.Revit.DB.ParameterTypeId.RbsInsulationThicknessForDuct
"Insulation Thickness"

Autodesk.Revit.DB.ParameterTypeId.BuildingUnoccupiedCoolingSetPointParam
"Unoccupied Cooling Set Point"

Autodesk.Revit.DB.ParameterTypeId.BuildingClosingTimeParam
"Closing Time"

Autodesk.Revit.DB.ParameterTypeId.BuildingOpeningTimeParam
"Opening Time"

Autodesk.Revit.DB.ParameterTypeId.SpacePeopleActivityLevelParam
"People Activity Level"

Autodesk.Revit.DB.ParameterTypeId.SpaceElecEquipmentRadiantPercentageParam
"Electrical Equipment Radiant"

Autodesk.Revit.DB.ParameterTypeId.SpacePowerScheduleParam
"Power Schedule"

Autodesk.Revit.DB.ParameterTypeId.SpaceLightingScheduleParam
"Lighting Schedule"

Autodesk.Revit.DB.ParameterTypeId.SpaceOccupancyScheduleParam
"Occupancy Schedule"

Autodesk.Revit.DB.ParameterTypeId.SpaceInfiltrationParam
"Infiltration Airflow per area"

Autodesk.Revit.DB.ParameterTypeId.SpaceCarpetingParam
"Carpeting"

Autodesk.Revit.DB.ParameterTypeId.ZoneAirVolumeCalculationTypeParam
"Air Volume Calculation Type"

Autodesk.Revit.DB.ParameterTypeId.ZoneCoilBypassPercentageParam
"Coil Bypass"

Autodesk.Revit.DB.ParameterTypeId.ZoneCalculatedAreaPerCoolingLoadParam
"Calculated Area per Cooling Load"

Autodesk.Revit.DB.ParameterTypeId.ZoneCalculatedAreaPerHeatingLoadParam
"Calculated Area per Heating Load"

Autodesk.Revit.DB.ParameterTypeId.ZoneUseAirChangesPerHourParam
"Use Air Changes Per Hour"

Autodesk.Revit.DB.ParameterTypeId.ZoneUseOutsideAirPerAreaParam
"Use Outside Air Per Area"

Autodesk.Revit.DB.ParameterTypeId.ZoneUseOutsideAirPerPersonParam
"Use Outside Air Per Person"

Autodesk.Revit.DB.ParameterTypeId.ZoneUseDehumidificationSetpointParam
"Use Dehumidification Set Point"

Autodesk.Revit.DB.ParameterTypeId.ZoneUseHumidificationSetpointParam
"Use Humidification Set Point"

Autodesk.Revit.DB.ParameterTypeId.ZoneOutdoorAirInformationParam
"Outdoor Air Information"

Autodesk.Revit.DB.ParameterTypeId.ZoneCoolingInformationParam
"Cooling Information"

Autodesk.Revit.DB.ParameterTypeId.ZoneHeatingInformationParam
"Heating Information"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSliverSpaceTolerance
"Sliver Space Tolerance"

Autodesk.Revit.DB.ParameterTypeId.ZoneAreaGross
"Gross Area"

Autodesk.Revit.DB.ParameterTypeId.ZoneVolumeGross
"Gross Volume"

Autodesk.Revit.DB.ParameterTypeId.SpaceIsPlenum
"Plenum"

Autodesk.Revit.DB.ParameterTypeId.SpaceIsOccupiable
"Occupiable"

Autodesk.Revit.DB.ParameterTypeId.SpaceAssocRoomNumber
"Room Number"

Autodesk.Revit.DB.ParameterTypeId.SpaceAssocRoomName
"Room Name"

Autodesk.Revit.DB.ParameterTypeId.ZonePhase
"Phase"

Autodesk.Revit.DB.ParameterTypeId.ZonePhaseId
"Phase Id"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisProjectPhaseParam
"Project Phase"

Autodesk.Revit.DB.ParameterTypeId.RoomCalculatedSupplyAirflowPerAreaParam
"Calculated Supply Airflow per area"

Autodesk.Revit.DB.ParameterTypeId.RoomCalculatedCoolingLoadPerAreaParam
"Calculated Cooling Load per area"

Autodesk.Revit.DB.ParameterTypeId.RoomCalculatedHeatingLoadPerAreaParam
"Calculated Heating Load per area"

Autodesk.Revit.DB.ParameterTypeId.ZoneCalculatedSupplyAirflowPerAreaParam
"Calculated Supply Airflow per area"

Autodesk.Revit.DB.ParameterTypeId.ZoneCalculatedCoolingLoadPerAreaParam
"Calculated Cooling Load per area"

Autodesk.Revit.DB.ParameterTypeId.ZoneCalculatedHeatingLoadPerAreaParam
"Calculated Heating Load per area"

Autodesk.Revit.DB.ParameterTypeId.ZoneLevelId
"Level"

Autodesk.Revit.DB.ParameterTypeId.ZoneOaRatePerAchParam
"Outdoor Air Rate / Air Changes per Hour"

Autodesk.Revit.DB.ParameterTypeId.ZoneOutsideAirPerAreaParam
"Outdoor Air per Area"

Autodesk.Revit.DB.ParameterTypeId.ZoneOutsideAirPerPersonParam
"Outdoor Air per Person"

Autodesk.Revit.DB.ParameterTypeId.ZoneDehumidificationSetPointParam
"Dehumidification Set Point"

Autodesk.Revit.DB.ParameterTypeId.ZoneHumidificationSetPointParam
"Humidification Set Point"

Autodesk.Revit.DB.ParameterTypeId.ZoneCoolingAirTemperatureParam
"Cooling Air Temperature"

Autodesk.Revit.DB.ParameterTypeId.ZoneHeatingAirTemperatureParam
"Heating Air Temperature"

Autodesk.Revit.DB.ParameterTypeId.ZoneCoolingSetPointParam
"Cooling Set Point"

Autodesk.Revit.DB.ParameterTypeId.ZoneHeatingSetPointParam
"Heating Set Point"

Autodesk.Revit.DB.ParameterTypeId.ZoneCalculatedSupplyAirflowParam
"Calculated Supply Airflow"

Autodesk.Revit.DB.ParameterTypeId.ZoneCalculatedCoolingLoadParam
"Calculated Cooling Load"

Autodesk.Revit.DB.ParameterTypeId.ZoneCalculatedHeatingLoadParam
"Calculated Heating Load"

Autodesk.Revit.DB.ParameterTypeId.ZoneServiceTypeParam
"Service Type"

Autodesk.Revit.DB.ParameterTypeId.ZoneVolume
"Occupied Volume"

Autodesk.Revit.DB.ParameterTypeId.ZonePerimeter
"Perimeter"

Autodesk.Revit.DB.ParameterTypeId.ZoneArea
"Occupied Area"

Autodesk.Revit.DB.ParameterTypeId.ZoneName
"Name"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewUpdateSurfaces
"Update Surfaces"

Autodesk.Revit.DB.ParameterTypeId.RbsProjectConstructionTypeShadingfactorParam
"Internal Shading Factor"

Autodesk.Revit.DB.ParameterTypeId.RbsConstructionTypeShadingfactorParam
"Internal Shading Factor"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisGroundPlaneParam
"Ground Plane"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceOriginZ
"Origin (Z)"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceOriginY
"Origin (Y)"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceOriginX
"Origin (X)"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceAzimuth
"Azimuth"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceTilt
"Tilt"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceCadobjectid
"CADObjectID"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceAdjacentSpaceId2
"Adjacent Space Id (2)"

Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceAdjacentSpaceId1
"Adjacent Space Id (1)"

Autodesk.Revit.DB.ParameterTypeId.RoomEditElectricalLoadsParam
"Electrical Loads"

Autodesk.Revit.DB.ParameterTypeId.RoomEditPeopleLoadsParam
"People"

Autodesk.Revit.DB.ParameterTypeId.RbsProjectLocationParam
"Location"

Autodesk.Revit.DB.ParameterTypeId.RoomActualLightingLoadPerAreaParam
"Actual Lighting Load per area"

Autodesk.Revit.DB.ParameterTypeId.RoomActualPowerLoadPerAreaParam
"Actual Power Load per area"

Autodesk.Revit.DB.ParameterTypeId.RoomBaseHeatLoadOnParam
"Heat Load Values"

Autodesk.Revit.DB.ParameterTypeId.RoomLightingLoadUnitsParam
"Lighting Load Units"

Autodesk.Revit.DB.ParameterTypeId.RoomPowerLoadUnitsParam
"Power Load Units"

Autodesk.Revit.DB.ParameterTypeId.RoomDesignCoolingLoadParam
"Design Cooling Load"

Autodesk.Revit.DB.ParameterTypeId.RoomCalculatedCoolingLoadParam
"Calculated Cooling Load"

Autodesk.Revit.DB.ParameterTypeId.RoomDesignHeatingLoadParam
"Design Heating Load"

Autodesk.Revit.DB.ParameterTypeId.RoomCalculatedHeatingLoadParam
"Calculated Heating Load"

Autodesk.Revit.DB.ParameterTypeId.RoomBaseReturnAirflowOnParam
"Return Airflow"

Autodesk.Revit.DB.ParameterTypeId.RoomConstructionSetParam
"Construction Type"

Autodesk.Revit.DB.ParameterTypeId.RbsConstructionSetParam
"Schematic Types"

Autodesk.Revit.DB.ParameterTypeId.RbsServiceTypeParam
"Building Service"

Autodesk.Revit.DB.ParameterTypeId.RbsGbxmlSurfaceArea
"Area"

Autodesk.Revit.DB.ParameterTypeId.RbsGbxmlSurfaceType
"Surface Type"

Autodesk.Revit.DB.ParameterTypeId.RbsGbxmlSurfaceName
"Surface Name"

Autodesk.Revit.DB.ParameterTypeId.FamilyElectricalMaintainAnnotationOrientation
"Maintain Annotation Orientation"

Autodesk.Revit.DB.ParameterTypeId.RbsFamilyContentAnnotationDisplay
"Use Annotation Scale"

Autodesk.Revit.DB.ParameterTypeId.RbsElectricalData
"Electrical Data"

Autodesk.Revit.DB.ParameterTypeId.RbsCalculatedSize
"Size"

Autodesk.Revit.DB.ParameterTypeId.RoomPeopleSensibleHeatGainPerPersonParam
"Sensible Heat Gain per person"

Autodesk.Revit.DB.ParameterTypeId.RbsIsCustomFitting
"IsCustom"

Autodesk.Revit.DB.ParameterTypeId.RbsConnectorOffsetObsolete
"Connector Offset"

Autodesk.Revit.DB.ParameterTypeId.RbsLookupTableName
"Lookup Table Name"

Autodesk.Revit.DB.ParameterTypeId.RoomDesignLightingLoadParam
"Specified Lighting Load"

Autodesk.Revit.DB.ParameterTypeId.RoomDesignPowerLoadParam
"Specified Power Load"

Autodesk.Revit.DB.ParameterTypeId.RoomActualLightingLoadParam
"Actual Lighting Load"

Autodesk.Revit.DB.ParameterTypeId.RoomActualPowerLoadParam
"Actual Power Load"

Autodesk.Revit.DB.ParameterTypeId.RoomBaseLightingLoadOnParam
"Base Lighting Load on"

Autodesk.Revit.DB.ParameterTypeId.RoomBasePowerLoadOnParam
"Base Power Load on"

Autodesk.Revit.DB.ParameterTypeId.RoomDesignOtherLoadPerAreaParam
"Design Other Load per area"

Autodesk.Revit.DB.ParameterTypeId.RoomDesignMechanicalLoadPerAreaParam
"Design HVAC Load per area"

Autodesk.Revit.DB.ParameterTypeId.RoomDesignLightingLoadPerAreaParam
"Specified Lighting Load per area"

Autodesk.Revit.DB.ParameterTypeId.RoomDesignPowerLoadPerAreaParam
"Specified Power Load per area"

Autodesk.Revit.DB.ParameterTypeId.FbxLightBallastLoss
"Ballast Loss"

Autodesk.Revit.DB.ParameterTypeId.FbxLightTotalLightLoss
"Total Light Loss Factor"

Autodesk.Revit.DB.ParameterTypeId.RbsRoomCoefficientUtilization
"Coefficient of Utilization"

Autodesk.Revit.DB.ParameterTypeId.RbsFamilyContentTakeoffFixedLength
"Takeoff Fixed Length"

Autodesk.Revit.DB.ParameterTypeId.RbsFamilyContentTakeoffProjlength
"Takeoff Length Projection"

Autodesk.Revit.DB.ParameterTypeId.RbsFamilyContentTakeoffLength
"Takeoff Length"

Autodesk.Revit.DB.ParameterTypeId.RbsFamilyContentOffsetHeight
"OffsetHeight"

Autodesk.Revit.DB.ParameterTypeId.RbsFamilyContentOffsetWidth
"OffsetWidth"

Autodesk.Revit.DB.ParameterTypeId.FamilyContentPartType
"Part Type"

Autodesk.Revit.DB.ParameterTypeId.GbxmlEditDataParam
"Energy Settings"

Autodesk.Revit.DB.ParameterTypeId.RoomActualExhaustAirflowParam
"Actual Exhaust Airflow"

Autodesk.Revit.DB.ParameterTypeId.RoomActualReturnAirflowParam
"Actual Return Airflow"

Autodesk.Revit.DB.ParameterTypeId.RoomActualSupplyAirflowParam
"Actual Supply Airflow"

Autodesk.Revit.DB.ParameterTypeId.RoomPeopleLatentHeatGainPerPersonParam
"Latent Heat Gain per person"

Autodesk.Revit.DB.ParameterTypeId.RoomPeopleTotalHeatGainPerPersonParam
"Total Heat Gain per person"

Autodesk.Revit.DB.ParameterTypeId.RoomCalculatedSupplyAirflowParam
"Calculated Supply Airflow"

Autodesk.Revit.DB.ParameterTypeId.RoomDesignExhaustAirflowParam
"Specified Exhaust Airflow"

Autodesk.Revit.DB.ParameterTypeId.RoomDesignReturnAirflowParam
"Specified Return Airflow"

Autodesk.Revit.DB.ParameterTypeId.RoomDesignSupplyAirflowParam
"Specified Supply Airflow"

Autodesk.Revit.DB.ParameterTypeId.RoomAreaPerPersonParam
"Area per Person"

Autodesk.Revit.DB.ParameterTypeId.RoomNumberOfPeopleParam
"Number of People"

Autodesk.Revit.DB.ParameterTypeId.RoomOccupancyUnitParam
"Occupancy Unit"

Autodesk.Revit.DB.ParameterTypeId.RoomSpaceTypeParam
"Space Type"

Autodesk.Revit.DB.ParameterTypeId.RoomConditionTypeParam
"Condition Type"

Autodesk.Revit.DB.ParameterTypeId.ProjectPostalCode
"Postal Code"

Autodesk.Revit.DB.ParameterTypeId.ProjectBuildingType
"Building Type"

Autodesk.Revit.DB.ParameterTypeId.RbsSizeLock
"Size Lock"

Autodesk.Revit.DB.ParameterTypeId.RbsAdditionalFlow
"Additional Flow"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeMaxWidthParam
"Max Width"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeFittingLossMethodSettings
"Loss Method Settings"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctFittingLossMethodSettings
"Loss Method Settings"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultCapParam
"Cap"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeFittingLossMethodServerParam
"Loss Method"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctFittingLossMethodServerParam
"Loss Method"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultMechjointParam
"Flange"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeSizeFormattedParam
"Size"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctSizeFormattedParam
"Size"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctStaticPressure
"Static Pressure"

Autodesk.Revit.DB.ParameterTypeId.RbsFlexPipeTypeParam
"Flex Pipe"

Autodesk.Revit.DB.ParameterTypeId.RbsPipeTypeParam
"Pipe Type"

Autodesk.Revit.DB.ParameterTypeId.RbsFlexDuctTypeParam
"Flex Duct Type"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctTypeParam
"Duct Type"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctFittingLossTableParam
"ASHRAE Table"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctFittingLossMethodParam
"Loss Method"

Autodesk.Revit.DB.ParameterTypeId.RbsFlexductRoundtypeParam
"Flex Duct Type"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypePreferredBranchParam
"Preferred Junction Type"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultTakeoffParam
"Tap"

Autodesk.Revit.DB.ParameterTypeId.RbsOffsetParam
"Middle Elevation"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultUnionParam
"Union"

Autodesk.Revit.DB.ParameterTypeId.RbsHydraulicDiameterParam
"Hydraulic Diameter"

Autodesk.Revit.DB.ParameterTypeId.RbsReynoldsnumberParam
"Reynolds number"

Autodesk.Revit.DB.ParameterTypeId.RbsEqDiameterParam
"Equivalent Diameter"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeMultishapeTransitionParam
"Multi Shape Transition Rect to Round"

Autodesk.Revit.DB.ParameterTypeId.RbsSection
"Section"

Autodesk.Revit.DB.ParameterTypeId.RbsLossCoefficient
"Loss Coefficient"

Autodesk.Revit.DB.ParameterTypeId.RbsMaxFlow
"Max Flow"

Autodesk.Revit.DB.ParameterTypeId.RbsMinFlow
"Min Flow"

Autodesk.Revit.DB.ParameterTypeId.RbsVelocityPressure
"Velocity Pressure"

Autodesk.Revit.DB.ParameterTypeId.RbsCurveSurfaceArea
"Area"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeMaxHeightParam
"Max Height"

Autodesk.Revit.DB.ParameterTypeId.RbsLiningThickness
"Lining Thickness"

Autodesk.Revit.DB.ParameterTypeId.RbsInsulationThickness
"Insulation Thickness"

Autodesk.Revit.DB.ParameterTypeId.RbsFriction
"Friction"

Autodesk.Revit.DB.ParameterTypeId.DuctRoughness
"Roughness"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultTransitionParam
"Transition"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultCrossParam
"Cross"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultTeeParam
"Tee"

Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeDefaultElbowParam
"Elbow"

Autodesk.Revit.DB.ParameterTypeId.RbsPressureDrop
"Pressure Drop"

Autodesk.Revit.DB.ParameterTypeId.RbsVelocity
"Velocity"

Autodesk.Revit.DB.ParameterTypeId.RbsCurveVertOffsetParam
"Vertical Justification"

Autodesk.Revit.DB.ParameterTypeId.RbsCurveHorOffsetParam
"Horizontal Justification"

Autodesk.Revit.DB.ParameterTypeId.RbsFlowObsolete
"Flow"

Autodesk.Revit.DB.ParameterTypeId.RbsCurveDiameterParam
"Diameter"

Autodesk.Revit.DB.ParameterTypeId.RbsCurveHeightParam
"Height"

Autodesk.Revit.DB.ParameterTypeId.RbsCurveWidthParam
"Width"

Autodesk.Revit.DB.ParameterTypeId.RbsFlexPatternParam
"Flex Pattern"

Autodesk.Revit.DB.ParameterTypeId.RbsEndOffsetParam
"End Middle Elevation"

Autodesk.Revit.DB.ParameterTypeId.RbsStartOffsetParam
"Start Middle Elevation"

Autodesk.Revit.DB.ParameterTypeId.RbsEndLevelParam
"End Level"

Autodesk.Revit.DB.ParameterTypeId.RbsStartLevelParam
"Reference Level"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceEndAllNonZero
"All non 0 forces at end"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceStartAllNonZero
"All non 0 forces at start"

Autodesk.Revit.DB.ParameterTypeId.StructuralMemberForces
"Member Forces"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceEndMz
"End Mz"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceEndMy
"End My"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceEndMx
"End Mx"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceEndFz
"End Fz"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceEndFy
"End Fy"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceEndFx
"End Fx"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceStartMz
"Start Mz"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceStartMy
"Start My"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceStartMx
"Start Mx"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceStartFz
"Start Fz"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceStartFy
"Start Fy"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceStartFx
"Start Fx"

Autodesk.Revit.DB.ParameterTypeId.DividedpathTotalPathLength
"Path Length"

Autodesk.Revit.DB.ParameterTypeId.DividedpathDisplayNodeNumbers
"Show Node Numbers"

Autodesk.Revit.DB.ParameterTypeId.DividedpathMergedPointNum
"Total Number of Nodes"

Autodesk.Revit.DB.ParameterTypeId.DividedpathDisplayNodes
"Display Nodes"

Autodesk.Revit.DB.ParameterTypeId.DividedpathDisplayReferenceCurves
"Display Path"

Autodesk.Revit.DB.ParameterTypeId.DividedpathJustification
"Justification"

Autodesk.Revit.DB.ParameterTypeId.DividedpathLayoutFixedNumPoint
"Number"

Autodesk.Revit.DB.ParameterTypeId.DividedpathFlipDirection
"Flip Direction"

Autodesk.Revit.DB.ParameterTypeId.DividedpathMeasurementType
"Measurement Type"

Autodesk.Revit.DB.ParameterTypeId.DividedpathMaxDistance
"Maximum Distance"

Autodesk.Revit.DB.ParameterTypeId.DividedpathMinDistance
"Minimum Distance"

Autodesk.Revit.DB.ParameterTypeId.DividedpathEndIndent
"End Indent"

Autodesk.Revit.DB.ParameterTypeId.DividedpathBeginningIndent
"Beginning Indent"

Autodesk.Revit.DB.ParameterTypeId.DividedpathDistance
"Distance"

Autodesk.Revit.DB.ParameterTypeId.DividedpathLayout
"Layout"

Autodesk.Revit.DB.ParameterTypeId.AlignmentStationLabelSetEndStation
"Alignment Label Set End Station"

Autodesk.Revit.DB.ParameterTypeId.AlignmentStationLabelSetStartStation
"Alignment Label Set Start Station"

Autodesk.Revit.DB.ParameterTypeId.AlignmentStationLabelSetInterval
"Alignment Station Label Set Interval": The text is not used directly anywhere in the UI,
instead the XAML specifies its own string for the value's label.

Autodesk.Revit.DB.ParameterTypeId.AlignmentStationLabelSetOffset
"Alignment Station Label Set Offset": The text is not used directly anywhere in the UI,
instead the XAML specifies its own string for the value's label.

Autodesk.Revit.DB.ParameterTypeId.WallTaperedWidthAtBottom
"Bottom Width"

Autodesk.Revit.DB.ParameterTypeId.WallTaperedWidthAtTop
"Top Width"

Autodesk.Revit.DB.ParameterTypeId.WallTaperedUseInstanceAngles
"Enable Angle Overrides"

Autodesk.Revit.DB.ParameterTypeId.WallTypeWidthMeasuredAt
"Width Measured At"

Autodesk.Revit.DB.ParameterTypeId.WallTypeDefaultTaperedInteriorInwardAngle
"Default Interior Angle"

Autodesk.Revit.DB.ParameterTypeId.WallTypeDefaultTaperedExteriorInwardAngle
"Default Exterior Angle"

Autodesk.Revit.DB.ParameterTypeId.WallTaperedInteriorInwardAngle
"Interior Angle"

Autodesk.Revit.DB.ParameterTypeId.WallTaperedExteriorInwardAngle
"Exterior Angle"

Autodesk.Revit.DB.ParameterTypeId.WallSingleSlantAngleFromVertical
"Angle From Vertical"

Autodesk.Revit.DB.ParameterTypeId.WallCrossSection
"Cross-Section"

Autodesk.Revit.DB.ParameterTypeId.IfcExportPredefinedtypeType
"Type IFC Predefined Type"

Autodesk.Revit.DB.ParameterTypeId.IfcExportPredefinedtype
"IFC Predefined Type"

Autodesk.Revit.DB.ParameterTypeId.IfcExportElementTypeAs
"Export Type to IFC As"

Autodesk.Revit.DB.ParameterTypeId.IfcExportElementAs
"Export to IFC As"

Autodesk.Revit.DB.ParameterTypeId.IfcExportElementType
"Export Type to IFC"

Autodesk.Revit.DB.ParameterTypeId.IfcExportElement
"Export to IFC"

Autodesk.Revit.DB.ParameterTypeId.IfcOrganization
"IfcOrganization"

Autodesk.Revit.DB.ParameterTypeId.IfcApplicationVersion
"IfcApplicationVersion"

Autodesk.Revit.DB.ParameterTypeId.IfcApplicationName
"IfcApplicationName"

Autodesk.Revit.DB.ParameterTypeId.ProjectOrganizationName
"Organization Name"

Autodesk.Revit.DB.ParameterTypeId.ProjectOrganizationDescription
"Organization Description"

Autodesk.Revit.DB.ParameterTypeId.ProjectBuildingName
"Building Name"

Autodesk.Revit.DB.ParameterTypeId.ProjectAuthor
"Author"

Autodesk.Revit.DB.ParameterTypeId.IfcSiteGuid
"IfcSite GUID"

Autodesk.Revit.DB.ParameterTypeId.IfcBuildingGuid
"IfcBuilding GUID"

Autodesk.Revit.DB.ParameterTypeId.IfcProjectGuid
"IfcProject GUID"

Autodesk.Revit.DB.ParameterTypeId.IfcTypeGuid
"Type IfcGUID"

Autodesk.Revit.DB.ParameterTypeId.IfcGuid
"IfcGUID"

Autodesk.Revit.DB.ParameterTypeId.StructConnectionTypeName
"Name"

Autodesk.Revit.DB.ParameterTypeId.StructConnectionCutback
"Automatic Cutback for Beams and Braces"

Autodesk.Revit.DB.ParameterTypeId.StructConnectionColumnBase
"Base Connection"

Autodesk.Revit.DB.ParameterTypeId.StructConnectionColumnTop
"Top Connection"

Autodesk.Revit.DB.ParameterTypeId.StructConnectionBeamEnd
"End Connection"

Autodesk.Revit.DB.ParameterTypeId.StructConnectionBeamStart
"Start Connection"

Autodesk.Revit.DB.ParameterTypeId.StructConnectionApplyTo
"Apply to"

Autodesk.Revit.DB.ParameterTypeId.RebarContainerBarType
"Bar Type"

Autodesk.Revit.DB.ParameterTypeId.ReinforcementVolume
"Reinforcement Volume"

Autodesk.Revit.DB.ParameterTypeId.ReinEstBarVolume
"Estimated Reinforcement Volume"

Autodesk.Revit.DB.ParameterTypeId.ReinEstBarLength
"Estimated Total Bar Length"

Autodesk.Revit.DB.ParameterTypeId.ReinEstNumberOfBars
"Estimated Number of Bars"

Autodesk.Revit.DB.ParameterTypeId.PathReinShapen2
"Alternating Bar - Shape"

Autodesk.Revit.DB.ParameterTypeId.PathReinShapen1
"Primary Bar - Shape"

Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthAltOffset
"Offset"

Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthBarlengthAlt
"Length (Alternating Bar)"

Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthBarlengthPrim
"Length (Primary Bar)"

Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthTopAlt
"Top (Alternating Bar)"

Autodesk.Revit.DB.ParameterTypeId.PathReinEndSpanhookAlt
"End Hook Angle Alternating"

Autodesk.Revit.DB.ParameterTypeId.PathReinEndSpanhookPrim
"End Hook Angle Primary"

Autodesk.Revit.DB.ParameterTypeId.PathReinSummary
"Summary"

Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthBottomAlt
"Bottom (Alternating Bar)"

Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthBottomPrim
"Bottom (Primary Bar)"

Autodesk.Revit.DB.ParameterTypeId.PathReinSpanhookAlt
"Start Hook Angle Alternating"

Autodesk.Revit.DB.ParameterTypeId.PathReinSpanhookPrim
"Start Hook Angle Primary"

Autodesk.Revit.DB.ParameterTypeId.PathReinAddlOffset
"Additional Offset"

Autodesk.Revit.DB.ParameterTypeId.PathReinAltOffset
"Alternating Bar - Offset"

Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookOrient2Wall
"Alternating Bar - End Hook Orientation"

Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookOrient1Wall
"Primary Bar - End Hook Orientation"

Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookOrient2Slab
"Alternating Bar - End Hook Orientation"

Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookOrient1Slab
"Primary Bar - End Hook Orientation"

Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookTypen2
"Alternating Bar - End Hook Type"

Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookTypen1
"Primary Bar - End Hook Type"

Autodesk.Revit.DB.ParameterTypeId.PathReinHookOrient2Wall
"Alternating Bar - Hook Orientation"

Autodesk.Revit.DB.ParameterTypeId.PathReinHookOrient1Wall
"Primary Bar - Hook Orientation"

Autodesk.Revit.DB.ParameterTypeId.PathReinHookOrient2Slab
"Alternating Bar - Hook Orientation"

Autodesk.Revit.DB.ParameterTypeId.PathReinHookOrient1Slab
"Primary Bar - Hook Orientation"

Autodesk.Revit.DB.ParameterTypeId.PathReinHookTypen2
"Alternating Bar - Start Hook Type"

Autodesk.Revit.DB.ParameterTypeId.PathReinHookTypen1
"Primary Bar - Start Hook Type"

Autodesk.Revit.DB.ParameterTypeId.PathReinLengthn2
"Alternating Bar - Length"

Autodesk.Revit.DB.ParameterTypeId.PathReinLengthn1
"Primary Bar - Length"

Autodesk.Revit.DB.ParameterTypeId.PathReinTypen2
"Alternating Bar - Type"

Autodesk.Revit.DB.ParameterTypeId.PathReinTypen1
"Primary Bar - Type"

Autodesk.Revit.DB.ParameterTypeId.PathReinAlternating
"Alternating Bars"

Autodesk.Revit.DB.ParameterTypeId.PathReinNumberOfBars
"Number Of Bars"

Autodesk.Revit.DB.ParameterTypeId.PathReinSpacing
"Bar Spacing"

Autodesk.Revit.DB.ParameterTypeId.PathReinFaceWall
"Face"

Autodesk.Revit.DB.ParameterTypeId.PathReinFaceSlab
"Face"

Autodesk.Revit.DB.ParameterTypeId.RebarBarDeformationType
"Deformation"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingBottomDir2Generic
"Bottom/Interior Minor Spacing"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingBottomDir1Generic
"Bottom/Interior Major Spacing"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingTopDir2Generic
"Top/Exterior Minor Spacing"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingTopDir1Generic
"Top/Exterior Major Spacing"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesBottomDir2Generic
"Bottom/Interior Minor Number Of Lines"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesBottomDir1Generic
"Bottom/Interior Major Number Of Lines"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesTopDir2Generic
"Top/Exterior Minor Number Of Lines"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesTopDir1Generic
"Top/Exterior Major Number Of Lines"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeBottomDir2Generic
"Bottom/Interior Minor Bar Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeBottomDir1Generic
"Bottom/Interior Major Bar Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeTopDir2Generic
"Top/Exterior Minor Bar Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeTopDir1Generic
"Top/Exterior Major Bar Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveBottomDir2Generic
"Bottom/Interior Minor Direction"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveBottomDir1Generic
"Bottom/Interior Major Direction"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveTopDir2Generic
"Top/Exterior Minor Direction"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveTopDir1Generic
"Top/Exterior Major Direction"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingBackDirn2
"Interior Minor Spacing"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingBackDirn1
"Interior Major Spacing"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingFrontDirn2
"Exterior Minor Spacing"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingFrontDirn1
"Exterior Major Spacing"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesBackDirn2
"Interior Minor Number Of Lines"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesBackDirn1
"Interior Major Number Of Lines"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesFrontDirn2
"Exterior Minor Number Of Lines"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesFrontDirn1
"Exterior Major Number Of Lines"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeBackDirn2
"Interior Minor Hook Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeBackDirn1
"Interior Major Hook Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeFrontDirn2
"Exterior Minor Hook Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeFrontDirn1
"Exterior Major Hook Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientBackDirn2
"Interior Minor Hook Orientation"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientBackDirn1
"Interior Major Hook Orientation"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientFrontDirn2
"Exterior Minor Hook Orientation"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientFrontDirn1
"Exterior Major Hook Orientation"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeBackDirn2
"Interior Minor Bar Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeBackDirn1
"Interior Major Bar Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeFrontDirn2
"Exterior Minor Bar Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeFrontDirn1
"Exterior Major Bar Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveBackDirn2
"Interior Minor Direction"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveBackDirn1
"Interior Major Direction"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveFrontDirn2
"Exterior Minor Direction"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveFrontDirn1
"Exterior Major Direction"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingBottomDirn2
"Bottom Minor Spacing"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingBottomDirn1
"Bottom Major Spacing"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingTopDirn2
"Top Minor Spacing"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingTopDirn1
"Top Major Spacing"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesBottomDirn2
"Bottom Minor Number Of Lines"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesBottomDirn1
"Bottom Major Number Of Lines"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesTopDirn2
"Top Minor Number Of Lines"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesTopDirn1
"Top Major Number Of Lines"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeBottomDirn2
"Bottom Minor Hook Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeBottomDirn1
"Bottom Major Hook Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeTopDirn2
"Top Minor Hook Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeTopDirn1
"Top Major Hook Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientBottomDirn2
"Bottom Minor Hook Orientation"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientBottomDirn1
"Bottom Major Hook Orientation"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientTopDirn2
"Top Minor Hook Orientation"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientTopDirn1
"Top Major Hook Orientation"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeBottomDirn2
"Bottom Minor Bar Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeBottomDirn1
"Bottom Major Bar Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeTopDirn2
"Top Minor Bar Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeTopDirn1
"Top Major Bar Type"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveBottomDirn2
"Bottom Minor Direction"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveBottomDirn1
"Bottom Major Direction"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveTopDirn2
"Top Minor Direction"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveTopDirn1
"Top Major Direction"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanhookTopDirn2
"Hook Angle Top"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanhookBottomDirn2
"Hook Angle Bottom"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanhookRightDirn1
"Hook Angle Right"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanhookLeftDirn1
"Hook Angle Left"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanactiveDirn2
"Bars In Minor Direction"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanactiveDirn1
"Bars In Major Direction"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemAddlInteriorOffset
"Additional Interior Cover Offset"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemAddlExteriorOffset
"Additional Exterior Cover Offset"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemAddlBottomOffset
"Additional Bottom Cover Offset"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemAddlTopOffset
"Additional Top Cover Offset"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemTopMinorMatchesBottomMinor
"Top and Bottom Minor Layers Match"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemTopMajorMatchesBottomMajor
"Top and Bottom Major Layers Match"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemBottomMajorMatchesBottomMinor
"Bottom Major and Minor Layers Match"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemTopMajorMatchesTopMinor
"Top Major and Minor Layers Match"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryDir2NoSpacing
"Minor, Both Faces (Brief)"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryDir2WithSpacing
"Minor, Both Faces"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryDir1NoSpacing
"Major, Both Faces (Brief)"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryDir1WithSpacing
"Major, Both Faces"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryBottomDir2NoSpacing
"Bottom/Interior Minor (Brief)"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryBottomDir2WithSpacing
"Bottom/Interior Minor"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryBottomDir1NoSpacing
"Bottom/Interior Major (Brief)"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryBottomDir1WithSpacing
"Bottom/Interior Major"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryTopDir2NoSpacing
"Top/Exterior Minor (Brief)"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryTopDir2WithSpacing
"Top/Exterior Minor"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryTopDir1NoSpacing
"Top/Exterior Major (Brief)"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryTopDir1WithSpacing
"Top/Exterior Major"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemCoverBottom
"Rebar Cover Bottom/Interior"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemCoverTop
"Rebar Cover Top/Exterior"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemOverride
"Override Area Reinforcement Settings"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryNoSpacing
"Layer Summary (Brief)"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryWithSpacing
"Layer Summary"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayoutRule
"Layout Rule"

Autodesk.Revit.DB.ParameterTypeId.RebarSystemCoverSide
"Rebar Cover Side/Edge"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisCurrentViewOnly
"Use Only Elements Visible In Current View"

Autodesk.Revit.DB.ParameterTypeId.FabricWireOffset
"Offset along wire direction": Offset along wire direction

Autodesk.Revit.DB.ParameterTypeId.FabricWireDistance
"Wire distance": The distance between wires

Autodesk.Revit.DB.ParameterTypeId.FabricWireLength
"Wire length": The wire length

Autodesk.Revit.DB.ParameterTypeId.FabricWireType
"Wire type": The wire type assigned

Autodesk.Revit.DB.ParameterTypeId.BentFabricParamLongitudinalCutLength
"Longitudinal Cut Length": Bent fabric longitudinal cut length.

Autodesk.Revit.DB.ParameterTypeId.FabricParamSharedFamilyKey
"Shared family key"

Autodesk.Revit.DB.ParameterTypeId.FabricParamCutByHost
"Cut by Host Cover": Single Fabric Sheet is cut or not cut by the Host Cover.

Autodesk.Revit.DB.ParameterTypeId.BentFabricParamStraightWiresLocation
"Straight Wires Location": Location of straight wires in a bent fabric.

Autodesk.Revit.DB.ParameterTypeId.ConstraintFixedOffset
"Fixed offset"

Autodesk.Revit.DB.ParameterTypeId.BentFabricParamBendDirection
"Bend Direction": Direction in which FabricSheet is bent.

Autodesk.Revit.DB.ParameterTypeId.FabricParamSpanTagComponentReference
"Tag Component Reference"

Autodesk.Revit.DB.ParameterTypeId.FabricParamSpanSymDRight
"D_Right"

Autodesk.Revit.DB.ParameterTypeId.FabricParamSpanSymDLeft
"D_Left"

Autodesk.Revit.DB.ParameterTypeId.FabricParamSpanSymDBottom
"D_Bottom"

Autodesk.Revit.DB.ParameterTypeId.FabricParamSpanSymDTop
"D_Top"

Autodesk.Revit.DB.ParameterTypeId.FabricParamSpanSymRight
"Right"

Autodesk.Revit.DB.ParameterTypeId.FabricParamSpanSymLeft
"Left"

Autodesk.Revit.DB.ParameterTypeId.FabricParamSpanSymBottom
"Bottom"

Autodesk.Revit.DB.ParameterTypeId.FabricParamSpanSymTop
"Top"

Autodesk.Revit.DB.ParameterTypeId.FabricParamTagView
"Tag new members in view": List of all Plan Views and None.

Autodesk.Revit.DB.ParameterTypeId.FabricParamCutSheetMass
"Cut Sheet Mass": Calculated cut sheet mass [Sheet Mass per Unit Area * (Cut Overall Length * Cut Overall Width)]

Autodesk.Revit.DB.ParameterTypeId.FabricParamTotalSheetMass
"Total Sheet Mass": Calculated all sheet mass: Volume of Wire * Unit Weight.

Autodesk.Revit.DB.ParameterTypeId.FabricParamCutOverallWidth
"Cut Overall Width": Provides a real sheet Width after definition

Autodesk.Revit.DB.ParameterTypeId.FabricParamCutOverallLength
"Cut Overall Length": Provides a real sheet Length after definition

Autodesk.Revit.DB.ParameterTypeId.FabricParamCoverOffset
"Additional Cover Offset": Additional cover offset of the fabric distribution.

Autodesk.Revit.DB.ParameterTypeId.FabricParamMinorLapspliceLength
"Minor Lap Splice Length": Fabric lap splice length in minor direction in the fabric distribution.

Autodesk.Revit.DB.ParameterTypeId.FabricParamMajorLapspliceLength
"Major Lap Splice Length": Fabric lap splice length in major direction in the fabric distribution.

Autodesk.Revit.DB.ParameterTypeId.FabricParamLocationGeneric
"Location": Fabric location in the host.

Autodesk.Revit.DB.ParameterTypeId.FabricParamLapsplicePosition
"Lap Splice Position": Fabric lap splice position in the fabric distribution

Autodesk.Revit.DB.ParameterTypeId.FabricParamLocationWall
"Location": Fabric location in the wall

Autodesk.Revit.DB.ParameterTypeId.FabricParamLocationSlab
"Location": Fabric location in the slab

Autodesk.Revit.DB.ParameterTypeId.FabricParamSheetType
"Fabric Sheet": List all Fabric Sheet types

Autodesk.Revit.DB.ParameterTypeId.FabricBendDiameter
"Bend Diameter": Standard Bend Diameter of Fabric Wire.

Autodesk.Revit.DB.ParameterTypeId.FabricSheetMassunit
"Sheet Mass per Unit Area": Structural Sheet Mass per Unit Area  [Sheet Mass / (Overall Length * Overall Width)]

Autodesk.Revit.DB.ParameterTypeId.FabricSheetMinorReinforcementArea
"Minor Reinforcement Area": Minor Reinforcement Area

Autodesk.Revit.DB.ParameterTypeId.FabricSheetMajorReinforcementArea
"Major Reinforcement Area": Major Reinforcement Area

Autodesk.Revit.DB.ParameterTypeId.FabricSheetMass
"Sheet Mass": Sheet Mass

Autodesk.Revit.DB.ParameterTypeId.FabricSheetMinorSpacing
"Minor Spacing": Minor Spacing

Autodesk.Revit.DB.ParameterTypeId.FabricSheetMinorNumberOfWires
"Minor Number of Wires": Minor Number of Wires

Autodesk.Revit.DB.ParameterTypeId.FabricSheetMinorLayoutPattern
"Minor Layout Pattern": Minor Layout Pattern

Autodesk.Revit.DB.ParameterTypeId.FabricSheetMinorEndOverhang
"Minor End Overhang": Minor End Overhang

Autodesk.Revit.DB.ParameterTypeId.FabricSheetMinorStartOverhang
"Minor Start Overhang": Minor Start Overhang

Autodesk.Revit.DB.ParameterTypeId.FabricSheetWidth
"Width": Width

Autodesk.Revit.DB.ParameterTypeId.FabricSheetOverallWidth
"Overall Width": Overall Width

Autodesk.Revit.DB.ParameterTypeId.FabricSheetMajorSpacing
"Major Spacing": Major Spacing

Autodesk.Revit.DB.ParameterTypeId.FabricSheetMajorNumberOfWires
"Major Number of Wires": Major Number of Wires

Autodesk.Revit.DB.ParameterTypeId.FabricSheetMajorLayoutPattern
"Major Layout Pattern": Major Layout Pattern

Autodesk.Revit.DB.ParameterTypeId.FabricSheetMajorEndOverhang
"Major End Overhang": Major End Overhang

Autodesk.Revit.DB.ParameterTypeId.FabricSheetMajorStartOverhang
"Major Start Overhang": Major Start Overhang

Autodesk.Revit.DB.ParameterTypeId.FabricSheetLength
"Length": Length

Autodesk.Revit.DB.ParameterTypeId.FabricSheetOverallLength
"Overall Length": Overall Length

Autodesk.Revit.DB.ParameterTypeId.FabricSheetDefaultMinorLapspliceLength
"Default Minor Lap Splice Length": Default Minor Lap Splice Length

Autodesk.Revit.DB.ParameterTypeId.FabricSheetDefaultMajorLapspliceLength
"Default Major Lap Splice Length": Default Major Lap Splice Length

Autodesk.Revit.DB.ParameterTypeId.FabricSheetMinorDirectionWireType
"Minor Direction Wire Type": Minor Direction Wire Type

Autodesk.Revit.DB.ParameterTypeId.FabricSheetMajorDirectionWireType
"Major Direction Wire Type": Major Direction Wire Type

Autodesk.Revit.DB.ParameterTypeId.FabricSheetPhysicalMaterialAsset
"Physical Material Asset": Physical Material Asset

Autodesk.Revit.DB.ParameterTypeId.FabricWireDiameter
"Nominal Diameter": Nominal Diameter of Fabric Wire.

Autodesk.Revit.DB.ParameterTypeId.RebarQuanityByDistrib
"Quantity By Rebar Set"

Autodesk.Revit.DB.ParameterTypeId.RebarMinLength
"Minimum bar length"

Autodesk.Revit.DB.ParameterTypeId.RebarMaxLength
"Maximum bar length"

Autodesk.Revit.DB.ParameterTypeId.RebarMaximSuffix
"Maxim Suffix"

Autodesk.Revit.DB.ParameterTypeId.RebarMinimSuffix
"Minim Suffix"

Autodesk.Revit.DB.ParameterTypeId.RebarNumberSuffix
"Rebar Number Suffix"

Autodesk.Revit.DB.ParameterTypeId.RebarDistributionType
"Distribution Type"

Autodesk.Revit.DB.ParameterTypeId.DpartCanHostRebar
"Can host rebar"

Autodesk.Revit.DB.ParameterTypeId.RebarHostCategory
"Host Category"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeParamEndHookTanLen
"End Tangent Hook Length"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeParamStartHookTanLen
"Start Tangent Hook Length"

Autodesk.Revit.DB.ParameterTypeId.RebarInternalMultiplanarEndConnector
"INTERNAL: Multiplanar End Connector"

Autodesk.Revit.DB.ParameterTypeId.RebarInternalMultiplanarStartConnector
"INTERNAL: Multiplanar Start Connector"

Autodesk.Revit.DB.ParameterTypeId.RebarInternalMultiplanarDuplicate
"INTERNAL: Multiplanar Duplicate"

Autodesk.Revit.DB.ParameterTypeId.RebarInternalMultiplanar
"INTERNAL: Multiplanar"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeOutOfPlaneBendDiameter
"Out of Plane Bend Diameter"

Autodesk.Revit.DB.ParameterTypeId.RebarInstanceStirrupTieAttachment
"Stirrup/Tie Attachment"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeStirrupTieAttachment
"Stirrup/Tie Attachment"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeSpiralBaseFinishingTurns
"Base Finishing Turns"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeSpiralTopFinishingTurns
"Top Finishing Turns"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeSpiralHeight
"Height"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeSpiralPitch
"Pitch"

Autodesk.Revit.DB.ParameterTypeId.RebarStandardHookBendDiameter
"Standard Hook Bend Diameter"

Autodesk.Revit.DB.ParameterTypeId.RebarIncludeLastBar
"Include Last Bar"

Autodesk.Revit.DB.ParameterTypeId.RebarIncludeFirstBar
"Include First Bar"

Autodesk.Revit.DB.ParameterTypeId.RebarInstanceBendDiameter
"Bend Diameter"

Autodesk.Revit.DB.ParameterTypeId.RebarInstanceBarDiameter
"Bar Diameter"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeEndHookOffset
"End Hook Offset Length"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeEndHookLength
"End Hook Length"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeStartHookOffset
"Start Hook Offset Length"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeStartHookLength
"Start Hook Length"

Autodesk.Revit.DB.ParameterTypeId.RebarElemScheduleMark
"Schedule Mark"

Autodesk.Revit.DB.ParameterTypeId.FabricParamRounding
"Rounding Overrides"

Autodesk.Revit.DB.ParameterTypeId.RebarElementRounding
"Rounding Overrides"

Autodesk.Revit.DB.ParameterTypeId.RebarElemHookStyle
"Style"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeHookEndType
"Hook At End"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeHookStartType
"Hook At Start"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeHookStyle
"Style"

Autodesk.Revit.DB.ParameterTypeId.RebarShapeAllowedBarTypes
"Allowable Rebar Bar Types"

Autodesk.Revit.DB.ParameterTypeId.RebarBarMaximumBendRadius
"Maximum Bend Radius"

Autodesk.Revit.DB.ParameterTypeId.RebarBarStirrupBendDiameter
"Stirrup/Tie Bend Diameter"

Autodesk.Revit.DB.ParameterTypeId.RebarBarHookLengths
"Hook Lengths"

Autodesk.Revit.DB.ParameterTypeId.RebarHookStyle
"Style"

Autodesk.Revit.DB.ParameterTypeId.RebarElemLength
"Bar Length"

Autodesk.Revit.DB.ParameterTypeId.RebarShape
"Shape"

Autodesk.Revit.DB.ParameterTypeId.RebarElementVisibility
"View Visibility States"

Autodesk.Revit.DB.ParameterTypeId.RebarElemBarSpacing
"Spacing"

Autodesk.Revit.DB.ParameterTypeId.RebarElemQuantityOfBars
"Quantity"

Autodesk.Revit.DB.ParameterTypeId.RebarElemLayoutRule
"Layout Rule"

Autodesk.Revit.DB.ParameterTypeId.RebarStandardBendDiameter
"Standard Bend Diameter"

Autodesk.Revit.DB.ParameterTypeId.RebarElemHookEndOrient
"Hook Orientation At End"

Autodesk.Revit.DB.ParameterTypeId.RebarElemHookEndType
"Hook At End"

Autodesk.Revit.DB.ParameterTypeId.RebarElemHookStartOrient
"Hook Orientation At Start"

Autodesk.Revit.DB.ParameterTypeId.RebarElemHookStartType
"Hook At Start"

Autodesk.Revit.DB.ParameterTypeId.RebarElemTotalLength
"Total Bar Length"

Autodesk.Revit.DB.ParameterTypeId.RebarHookLineLenFactor
"Extension Multiplier"

Autodesk.Revit.DB.ParameterTypeId.RebarHookAngle
"Hook Angle"

Autodesk.Revit.DB.ParameterTypeId.RebarBarStyle
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.RebarBarDiameter
"Bar Diameter"

Autodesk.Revit.DB.ParameterTypeId.WallAlignKeyRefParam
"Location line to align"

Autodesk.Revit.DB.ParameterTypeId.CwpCopyRoofInserts
"Copy openings"

Autodesk.Revit.DB.ParameterTypeId.CwpCopyFloorInserts
"Copy openings/inserts"

Autodesk.Revit.DB.ParameterTypeId.CwpCopyWallInserts
"Copy windows/doors/openings"

Autodesk.Revit.DB.ParameterTypeId.CwpLinkedRoomParams
"Parameters"

Autodesk.Revit.DB.ParameterTypeId.CwpLinkedRoomPhases
"Phases"

Autodesk.Revit.DB.ParameterTypeId.CwpReuseGridsSameName
"Reuse Grids with the same name"

Autodesk.Revit.DB.ParameterTypeId.CwpReuseLevelsSameName
"Reuse Levels with the same name"

Autodesk.Revit.DB.ParameterTypeId.CwpSplitColumnsAtLevels
"Split Columns by Levels"

Autodesk.Revit.DB.ParameterTypeId.CwpReuseExistingGrids
"Reuse matching Grids"

Autodesk.Revit.DB.ParameterTypeId.CwpReuseExistingLevels
"Reuse matching Levels"

Autodesk.Revit.DB.ParameterTypeId.CwpLevelOffset
"Offset Level"

Autodesk.Revit.DB.ParameterTypeId.CwpAddLevelSuffix
"Add suffix to Level Name"

Autodesk.Revit.DB.ParameterTypeId.CwpAddLevelPrefix
"Add prefix to Level Name"

Autodesk.Revit.DB.ParameterTypeId.CwpAddGridSuffix
"Add suffix to Grid Name"

Autodesk.Revit.DB.ParameterTypeId.CwpAddGridPrefix
"Add prefix to Grid Name"

Autodesk.Revit.DB.ParameterTypeId.LoadUsageName
"Name"

Autodesk.Revit.DB.ParameterTypeId.LoadCombinationFactor
"Factor"

Autodesk.Revit.DB.ParameterTypeId.LoadCombinationName
"Name"

Autodesk.Revit.DB.ParameterTypeId.LoadNatureName
"Name"

Autodesk.Revit.DB.ParameterTypeId.LoadCaseSubcategory
"Category"

Autodesk.Revit.DB.ParameterTypeId.LoadCaseNature
"Nature"

Autodesk.Revit.DB.ParameterTypeId.LoadCaseNumber
"Case Number"

Autodesk.Revit.DB.ParameterTypeId.LoadCaseName
"Name"

Autodesk.Revit.DB.ParameterTypeId.LoadAttrAreaForceScaleFactor
"Area force scale"

Autodesk.Revit.DB.ParameterTypeId.LoadAttrLinearForceScaleFactor
"Linear force scale"

Autodesk.Revit.DB.ParameterTypeId.LoadArrowSeparation
"Distance between arrows"

Autodesk.Revit.DB.ParameterTypeId.LoadAttrMomentScaleFactor
"Moment scale"

Autodesk.Revit.DB.ParameterTypeId.LoadAttrMomentArrowLine
"Moment arrowhead (alternate)"

Autodesk.Revit.DB.ParameterTypeId.LoadAttrMomentArrowArc
"Moment arrowhead"

Autodesk.Revit.DB.ParameterTypeId.LoadAttrForceScaleFactor
"Force scale"

Autodesk.Revit.DB.ParameterTypeId.LoadAttrForceArrowType
"Force arrowhead"

Autodesk.Revit.DB.ParameterTypeId.LoadDescription
"Description"

Autodesk.Revit.DB.ParameterTypeId.LoadComments
"Comments"

Autodesk.Revit.DB.ParameterTypeId.LoadCaseNatureText
"Nature"

Autodesk.Revit.DB.ParameterTypeId.LoadAllNon0Loads
"All non 0 loads"

Autodesk.Revit.DB.ParameterTypeId.LoadAreaIsProjected
"Projected Load"

Autodesk.Revit.DB.ParameterTypeId.LoadAreaArea
"Area"

Autodesk.Revit.DB.ParameterTypeId.LoadAreaForceFz3
"Fz 3"

Autodesk.Revit.DB.ParameterTypeId.LoadAreaForceFy3
"Fy 3"

Autodesk.Revit.DB.ParameterTypeId.LoadAreaForceFx3
"Fx 3"

Autodesk.Revit.DB.ParameterTypeId.LoadAreaForceFz2
"Fz 2"

Autodesk.Revit.DB.ParameterTypeId.LoadAreaForceFy2
"Fy 2"

Autodesk.Revit.DB.ParameterTypeId.LoadAreaForceFx2
"Fx 2"

Autodesk.Revit.DB.ParameterTypeId.LoadAreaForceFz1
"Fz 1"

Autodesk.Revit.DB.ParameterTypeId.LoadAreaForceFy1
"Fy 1"

Autodesk.Revit.DB.ParameterTypeId.LoadAreaForceFx1
"Fx 1"

Autodesk.Revit.DB.ParameterTypeId.LoadLinearLength
"Length"

Autodesk.Revit.DB.ParameterTypeId.LoadIsProjected
"Projected Load"

Autodesk.Revit.DB.ParameterTypeId.LoadMomentMz2
"Mz 2"

Autodesk.Revit.DB.ParameterTypeId.LoadMomentMy2
"My 2"

Autodesk.Revit.DB.ParameterTypeId.LoadMomentMx2
"Mx 2"

Autodesk.Revit.DB.ParameterTypeId.LoadMomentMz1
"Mz 1"

Autodesk.Revit.DB.ParameterTypeId.LoadMomentMy1
"My 1"

Autodesk.Revit.DB.ParameterTypeId.LoadMomentMx1
"Mx 1"

Autodesk.Revit.DB.ParameterTypeId.LoadLinearForceFz2
"Fz 2"

Autodesk.Revit.DB.ParameterTypeId.LoadLinearForceFy2
"Fy 2"

Autodesk.Revit.DB.ParameterTypeId.LoadLinearForceFx2
"Fx 2"

Autodesk.Revit.DB.ParameterTypeId.LoadLinearForceFz1
"Fz 1"

Autodesk.Revit.DB.ParameterTypeId.LoadLinearForceFy1
"Fy 1"

Autodesk.Revit.DB.ParameterTypeId.LoadLinearForceFx1
"Fx 1"

Autodesk.Revit.DB.ParameterTypeId.LoadMomentMz
"Mz"

Autodesk.Revit.DB.ParameterTypeId.LoadMomentMy
"My"

Autodesk.Revit.DB.ParameterTypeId.LoadMomentMx
"Mx"

Autodesk.Revit.DB.ParameterTypeId.LoadForceFz
"Fz"

Autodesk.Revit.DB.ParameterTypeId.LoadForceFy
"Fy"

Autodesk.Revit.DB.ParameterTypeId.LoadForceFx
"Fx"

Autodesk.Revit.DB.ParameterTypeId.LoadIsHosted
"Is Hosted"

Autodesk.Revit.DB.ParameterTypeId.LoadIsReaction
"Is Reaction"

Autodesk.Revit.DB.ParameterTypeId.LoadIsUniform
"Uniform Load"

Autodesk.Revit.DB.ParameterTypeId.LoadUseLocalCoordinateSystem
"Orient to"

Autodesk.Revit.DB.ParameterTypeId.LoadCaseId
"Load Case"

Autodesk.Revit.DB.ParameterTypeId.SpanDirSymParamRight
"Right"

Autodesk.Revit.DB.ParameterTypeId.SpanDirSymParamLeft
"Left"

Autodesk.Revit.DB.ParameterTypeId.SpanDirSymParamBottom
"Bottom"

Autodesk.Revit.DB.ParameterTypeId.SpanDirSymParamTop
"Top"

Autodesk.Revit.DB.ParameterTypeId.SpanDirInstParamAngle
"Span Direction"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalNodeConnectionStatus
"Connection Status"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberRotation
"Cross-Section Rotation": Used for Analytical Member

Autodesk.Revit.DB.ParameterTypeId.AnalyticalPanelThickness
"Thickness": Used for Analytical Panel

Autodesk.Revit.DB.ParameterTypeId.AnalyticalElementStructuralRole
"Structural Role": Used for Analytical Elements

Autodesk.Revit.DB.ParameterTypeId.AnalyticalElementPhysicalAsset
"Physical Material Asset": Used for Analytical Elements.

Autodesk.Revit.DB.ParameterTypeId.AnalyticalGeometryIsValid
"Analytical Model Correct"

Autodesk.Revit.DB.ParameterTypeId.StructuralAssetParam
"Physical Material Asset"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalElementHasAssociation
"Has Association": Used for Analytical Member, Analytical Panel, Structural Columns, Structural Framing, Floors, Walls, Structural Foundation

Autodesk.Revit.DB.ParameterTypeId.GridNetLocationMark
"Location Mark": Provides grid system association information

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelCodeChecking
"Code Checking": Used for Analytical wall, Analytical beam, Analytical column, Analytical floor, Analytical wall foundations, Analytical isolated foundations, Analytical foundations slab, Anaytical brace

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelNodesMark
"Node Number": Used for nodes

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelFoundationsMark
"Foundation Number": Used for isolated, wall foundations

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelSurfaceElementsMark
"Surface Number": Used for floors, slabs, walls

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelStickElementsMark
"Member Number": Used for beams, braces, columns

Autodesk.Revit.DB.ParameterTypeId.FamilyEnableCuttingInViews
"Enable Cutting in Views"

Autodesk.Revit.DB.ParameterTypeId.FamilyCanHostRebar
"Can host rebar"

Autodesk.Revit.DB.ParameterTypeId.ClearCover
"Rebar Cover"

Autodesk.Revit.DB.ParameterTypeId.ClearCoverBottom
"Rebar Cover - Bottom Face"

Autodesk.Revit.DB.ParameterTypeId.ClearCoverTop
"Rebar Cover - Top Face"

Autodesk.Revit.DB.ParameterTypeId.ClearCoverOther
"Rebar Cover - Other Faces"

Autodesk.Revit.DB.ParameterTypeId.ClearCoverInterior
"Rebar Cover - Interior Face"

Autodesk.Revit.DB.ParameterTypeId.ClearCoverExterior
"Rebar Cover - Exterior Face"

Autodesk.Revit.DB.ParameterTypeId.CoverTypeLength
"Length"

Autodesk.Revit.DB.ParameterTypeId.CoverTypeName
"Name"

Autodesk.Revit.DB.ParameterTypeId.JoistSystemClearSpacingParam
"Clear Spacing"

Autodesk.Revit.DB.ParameterTypeId.JoistSystemFixedSpacingParam
"Fixed Spacing"

Autodesk.Revit.DB.ParameterTypeId.JoistSystemMaximumSpacingParam
"Maximum Spacing"

Autodesk.Revit.DB.ParameterTypeId.CurveEdgeOffset
"Wall offset"

Autodesk.Revit.DB.ParameterTypeId.BeamSystem3dParam
"3D"

Autodesk.Revit.DB.ParameterTypeId.JoistSystemNewBeamTypeNoFamNameParam
"Beam Type (No Family Name)"

Autodesk.Revit.DB.ParameterTypeId.BeamSystemTagInstParamAngle
"Beam System Tag Direction"

Autodesk.Revit.DB.ParameterTypeId.BeamSystemTagParamRight
"Right"

Autodesk.Revit.DB.ParameterTypeId.BeamSystemTagParamLeft
"Left"

Autodesk.Revit.DB.ParameterTypeId.JoistSystemNumBeamsSameType
"Num. of Beams With Same Type"

Autodesk.Revit.DB.ParameterTypeId.BeamHJustification
"Lateral Justification"

Autodesk.Revit.DB.ParameterTypeId.BeamVJustification
"z-Direction Justification"

Autodesk.Revit.DB.ParameterTypeId.CurveSupportOffset
"Wall offset"

Autodesk.Revit.DB.ParameterTypeId.JoistSystemNewBeamTypeParam
"Beam Type"

Autodesk.Revit.DB.ParameterTypeId.JoistSystemLayoutRuleParam
"Layout Rule"

Autodesk.Revit.DB.ParameterTypeId.JoistSystemJustificationParam
"Justification"

Autodesk.Revit.DB.ParameterTypeId.JoistSystemSpacingParam
"Centerline Spacing"

Autodesk.Revit.DB.ParameterTypeId.JoistSystemNumberOfLinesParam
"Number of Lines"

Autodesk.Revit.DB.ParameterTypeId.RbsDuctFlowParam
"Flow"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridBeltRatioV
"Belt Measurement"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridBeltRatioU
"Belt Measurement"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistV
"Use Curve Distance"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistU
"Use Curve Distance"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridAdjustBorderV
"Adjust for Mullion Size"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridAdjustBorderU
"Adjust for Mullion Size"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridBeltV
"Belt Measurement"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridBeltU
"Belt Measurement"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridOriginV
"Offset"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridOriginU
"Offset"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridAngleV
"Grid Rotation"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridAngleU
"Grid Rotation"

Autodesk.Revit.DB.ParameterTypeId.SpacingNumDivisionsV
"Number"

Autodesk.Revit.DB.ParameterTypeId.SpacingNumDivisionsU
"Number"

Autodesk.Revit.DB.ParameterTypeId.SpacingJustificationV
"Justification"

Autodesk.Revit.DB.ParameterTypeId.SpacingJustificationU
"Justification"

Autodesk.Revit.DB.ParameterTypeId.SpacingLengthV
"Distance"

Autodesk.Revit.DB.ParameterTypeId.SpacingLengthU
"Distance"

Autodesk.Revit.DB.ParameterTypeId.SpacingLayoutV
"Layout"

Autodesk.Revit.DB.ParameterTypeId.SpacingLayoutU
"Layout"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridBeltRation2
"Measurement Line"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridBeltRation1
"Measurement Line"

Autodesk.Revit.DB.ParameterTypeId.CurtainVersionParam
"Curtain version"

Autodesk.Revit.DB.ParameterTypeId.PaddingLength
"Padding"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDist
"Use Curve Distance"

Autodesk.Revit.DB.ParameterTypeId.SpacingJustification
"Justification"

Autodesk.Revit.DB.ParameterTypeId.SpacingNumDivisions
"Number"

Autodesk.Revit.DB.ParameterTypeId.SpacingLength
"Spacing"

Autodesk.Revit.DB.ParameterTypeId.SpacingLayout
"Layout"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistn2
"Use Curve Distance"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistn1
"Use Curve Distance"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridAdjustBordern2
"Adjust for Mullion Size"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridAdjustBordern1
"Adjust for Mullion Size"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridBeltn2
"Measurement Line"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridBeltn1
"Measurement Line"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridOriginn2
"Offset"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridOriginn1
"Offset"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridAnglen2
"Angle"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridAnglen1
"Angle"

Autodesk.Revit.DB.ParameterTypeId.SpacingNumDivisionsn2
"Number"

Autodesk.Revit.DB.ParameterTypeId.SpacingNumDivisionsn1
"Number"

Autodesk.Revit.DB.ParameterTypeId.SpacingJustificationn2
"Justification"

Autodesk.Revit.DB.ParameterTypeId.SpacingJustificationn1
"Justification"

Autodesk.Revit.DB.ParameterTypeId.SpacingLengthn2
"Spacing"

Autodesk.Revit.DB.ParameterTypeId.SpacingLengthn1
"Spacing"

Autodesk.Revit.DB.ParameterTypeId.SpacingLayoutn2
"Layout"

Autodesk.Revit.DB.ParameterTypeId.SpacingLayoutn1
"Layout"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistHoriz
"Use Curve Distance"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistVert
"Use Curve Distance"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridAdjustBorderHoriz
"Adjust for Mullion Size"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridAdjustBorderVert
"Adjust for Mullion Size"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridBeltHoriz
"Measurement Line"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridBeltVert
"Measurement Line"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridOriginHoriz
"Offset"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridOriginVert
"Offset"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridAngleHoriz
"Angle"

Autodesk.Revit.DB.ParameterTypeId.CurtaingridAngleVert
"Angle"

Autodesk.Revit.DB.ParameterTypeId.GridlineSpecStatus
"Type Association"

Autodesk.Revit.DB.ParameterTypeId.SpacingNumDivisionsHoriz
"Number"

Autodesk.Revit.DB.ParameterTypeId.SpacingNumDivisionsVert
"Number"

Autodesk.Revit.DB.ParameterTypeId.SpacingJustificationHoriz
"Justification"

Autodesk.Revit.DB.ParameterTypeId.SpacingJustificationVert
"Justification"

Autodesk.Revit.DB.ParameterTypeId.SpacingLengthHoriz
"Spacing"

Autodesk.Revit.DB.ParameterTypeId.SpacingLengthVert
"Spacing"

Autodesk.Revit.DB.ParameterTypeId.SpacingLayoutHoriz
"Layout"

Autodesk.Revit.DB.ParameterTypeId.SpacingLayoutVert
"Layout"

Autodesk.Revit.DB.ParameterTypeId.DesignOptionId
"Design Option"

Autodesk.Revit.DB.ParameterTypeId.DesignOptionParam
"Design Option"

Autodesk.Revit.DB.ParameterTypeId.PlanRegionViewRange
"View Range"

Autodesk.Revit.DB.ParameterTypeId.GuideGridNameParam
"Name"

Autodesk.Revit.DB.ParameterTypeId.GuideGridSpacingParam
"Guide Spacing"

Autodesk.Revit.DB.ParameterTypeId.SketchGridSpacingParam
"Work Plane Grid Spacing"

Autodesk.Revit.DB.ParameterTypeId.JoinStrengthOrder
"Abstract Join Strength Order"

Autodesk.Revit.DB.ParameterTypeId.FamilyHostingBehavior
"Host"

Autodesk.Revit.DB.ParameterTypeId.FamilyIsElevationMarkBody
"Elevation Mark Use"

Autodesk.Revit.DB.ParameterTypeId.FamilyUsePrecutShape
"Show family pre-cut in plan views"

Autodesk.Revit.DB.ParameterTypeId.WallSweepDefaultSetbackParam
"Default Setback"

Autodesk.Revit.DB.ParameterTypeId.WallSweepCutsWallParam
"Cuts Wall"

Autodesk.Revit.DB.ParameterTypeId.WallSweepCutByInsertsParam
"Cut by Inserts"

Autodesk.Revit.DB.ParameterTypeId.SlabEdgeProfileParam
"Profile"

Autodesk.Revit.DB.ParameterTypeId.GutterProfileParam
"Profile"

Autodesk.Revit.DB.ParameterTypeId.RevealProfileParam
"Profile"

Autodesk.Revit.DB.ParameterTypeId.FamilyShared
"Shared"

Autodesk.Revit.DB.ParameterTypeId.FamilyWorkPlaneBased
"Work Plane-Based"

Autodesk.Revit.DB.ParameterTypeId.FamilyAutojoin
"Automatically joins geometry to walls"

Autodesk.Revit.DB.ParameterTypeId.FamilyIsParametric
"Is parametric"

Autodesk.Revit.DB.ParameterTypeId.FamilyKeepTextReadable
"Keep text readable"

Autodesk.Revit.DB.ParameterTypeId.WallBottomExtensionDistParam
"Base Extension Distance"

Autodesk.Revit.DB.ParameterTypeId.WallTopExtensionDistParam
"Top Extension Distance"

Autodesk.Revit.DB.ParameterTypeId.SweepBaseVertOffset
"Vertical Profile Offset"

Autodesk.Revit.DB.ParameterTypeId.SweepBaseOffset
"Horizontal Profile Offset"

Autodesk.Revit.DB.ParameterTypeId.SlabEdgeMaterialParam
"Material"

Autodesk.Revit.DB.ParameterTypeId.GutterMaterialParam
"Material"

Autodesk.Revit.DB.ParameterTypeId.FasciaMaterialParam
"Material"

Autodesk.Revit.DB.ParameterTypeId.SweepBaseFloorSubcategoryId
"Subcategory of Floors"

Autodesk.Revit.DB.ParameterTypeId.SweepBaseRoofSubcategoryId
"Subcategory of Roofs"

Autodesk.Revit.DB.ParameterTypeId.FasciaProfileParam
"Profile"

Autodesk.Revit.DB.ParameterTypeId.DecalSubcategoryId
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.DecalHeight
"Height"

Autodesk.Revit.DB.ParameterTypeId.DecalWidth
"Width"

Autodesk.Revit.DB.ParameterTypeId.DecalLockProportions
"Lock Proportions"

Autodesk.Revit.DB.ParameterTypeId.DecalAttributes
"Decal Attributes"

Autodesk.Revit.DB.ParameterTypeId.FamilyAllowCutWithVoids
"Cut with Voids When Loaded"

Autodesk.Revit.DB.ParameterTypeId.FamilyKeyExtParam
"Filter Parameter"

Autodesk.Revit.DB.ParameterTypeId.WallSweepWallSubcategoryId
"Subcategory of Walls"

Autodesk.Revit.DB.ParameterTypeId.FamilyAlwaysVertical
"Always vertical"

Autodesk.Revit.DB.ParameterTypeId.FamilyRotateWithComponent
"Rotate with component"

Autodesk.Revit.DB.ParameterTypeId.HostVolumeComputed
"Volume"

Autodesk.Revit.DB.ParameterTypeId.HostAreaComputed
"Area"

Autodesk.Revit.DB.ParameterTypeId.WallSweepWallOffsetParam
"Offset From Wall"

Autodesk.Revit.DB.ParameterTypeId.WallSweepOffsetParam
"Offset From Level"

Autodesk.Revit.DB.ParameterTypeId.WallSweepLevelParam
"Level"

Autodesk.Revit.DB.ParameterTypeId.WallSweepProfileParam
"Profile"

Autodesk.Revit.DB.ParameterTypeId.FamilyRotateTextWithComponent
"Rotate text with component"

Autodesk.Revit.DB.ParameterTypeId.AreaSchemeName
"Name"

Autodesk.Revit.DB.ParameterTypeId.AreaSchemeId
"Area Scheme Id"

Autodesk.Revit.DB.ParameterTypeId.AreaTypeText
"Area Type"

Autodesk.Revit.DB.ParameterTypeId.AreaType
"Area Type"

Autodesk.Revit.DB.ParameterTypeId.ContourLabelsRelativeBase
"Relative Base"

Autodesk.Revit.DB.ParameterTypeId.ContourLabelsElevBaseType
"Elevation Base"

Autodesk.Revit.DB.ParameterTypeId.PropertySegmentSubcategoryId
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.PropertySegmentLR
"L/R"

Autodesk.Revit.DB.ParameterTypeId.PropertySegmentRadius
"Radius"

Autodesk.Revit.DB.ParameterTypeId.PropertySegmentEW
"E/W"

Autodesk.Revit.DB.ParameterTypeId.PropertySegmentBearing
"Bearing"

Autodesk.Revit.DB.ParameterTypeId.PropertySegmentNS
"N/S"

Autodesk.Revit.DB.ParameterTypeId.PropertySegmentDistance
"Distance"

Autodesk.Revit.DB.ParameterTypeId.PropertyLengthUnits
"Units Format"

Autodesk.Revit.DB.ParameterTypeId.PropertyAreaUnits
"Area Units, Format"

Autodesk.Revit.DB.ParameterTypeId.VolumeNet
"Net cut/fill"

Autodesk.Revit.DB.ParameterTypeId.ProjectedSurfaceArea
"Projected Area"

Autodesk.Revit.DB.ParameterTypeId.ContourLabelsLinearUnits
"Units Format"

Autodesk.Revit.DB.ParameterTypeId.ContourLabelsPrimaryOnly
"Label primary contours only"

Autodesk.Revit.DB.ParameterTypeId.PropertySubcategoryId
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.PropertyAreaOpen
"Area"

Autodesk.Revit.DB.ParameterTypeId.VolumeFill
"Fill"

Autodesk.Revit.DB.ParameterTypeId.VolumeCut
"Cut"

Autodesk.Revit.DB.ParameterTypeId.SurfacePerimeter
"Perimeter"

Autodesk.Revit.DB.ParameterTypeId.SurfaceArea
"Surface Area"

Autodesk.Revit.DB.ParameterTypeId.PropertyArea
"Area"

Autodesk.Revit.DB.ParameterTypeId.BuildingpadHeightabovelevelParam
"Height Offset From Level"

Autodesk.Revit.DB.ParameterTypeId.BuildingpadThickness
"Thickness"

Autodesk.Revit.DB.ParameterTypeId.TopographyLinkPath
"Saved Path"

Autodesk.Revit.DB.ParameterTypeId.TopographyLinkName
"Link Name"

Autodesk.Revit.DB.ParameterTypeId.BoundaryRadius
"Radius"

Autodesk.Revit.DB.ParameterTypeId.ToposurfaceContourSubcategoryId
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.BoundaryBearing
"Bearing"

Autodesk.Revit.DB.ParameterTypeId.BoundaryDistance
"Distance"

Autodesk.Revit.DB.ParameterTypeId.ContourElevationStep
"Increment"

Autodesk.Revit.DB.ParameterTypeId.ContourElevation
"Elevation"

Autodesk.Revit.DB.ParameterTypeId.PointElevation
"Elevation"

Autodesk.Revit.DB.ParameterTypeId.VolumeOfInterestName
"Name"

Autodesk.Revit.DB.ParameterTypeId.VolumeOfInterestViewsVisible
"Views Visible"

Autodesk.Revit.DB.ParameterTypeId.ViewerVolumeOfInterestCrop
"Scope Box"

Autodesk.Revit.DB.ParameterTypeId.DatumVolumeOfInterest
"Scope Box"

Autodesk.Revit.DB.ParameterTypeId.OrientByView
"Rotate With Text"

Autodesk.Revit.DB.ParameterTypeId.VolumeOfInterestHeight
"Height"

Autodesk.Revit.DB.ParameterTypeId.RoomPhase
"Phase"

Autodesk.Revit.DB.ParameterTypeId.RoomPhaseId
"Phase Id"

Autodesk.Revit.DB.ParameterTypeId.PhaseSequenceNumber
"Sequence Number"

Autodesk.Revit.DB.ParameterTypeId.PhaseName
"Name"

Autodesk.Revit.DB.ParameterTypeId.ViewFamily
"Family"

Autodesk.Revit.DB.ParameterTypeId.ViewType
"Family and Type"

Autodesk.Revit.DB.ParameterTypeId.ViewPhaseFilter
"Phase Filter"

Autodesk.Revit.DB.ParameterTypeId.ViewPhase
"Phase"

Autodesk.Revit.DB.ParameterTypeId.PhaseDemolished
"Phase Demolished"

Autodesk.Revit.DB.ParameterTypeId.PhaseCreated
"Phase Created"

Autodesk.Revit.DB.ParameterTypeId.MassDataSlab
"Slab"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisHvacSystem
"HVAC System"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisOutdoorAirInformationParam
"Outdoor Air Information"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisMasszoneUseenergydatasettings
"Use Energy Data"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisMasszoneDivideperimeter
"Perimeter Zone Division"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisMasszoneCoreoffset
"Perimeter Zone Depth"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisShadeDepth
"Shade Depth"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisConceptualConstruction
"Conceptual Types"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisSkylightWidth
"Skylight Width & Depth"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisPercentageSkylights
"Target Percentage Skylights"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisGlazingIsShaded
"Glazing is Shaded"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisSillHeight
"Target Sill Height"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisPercentageGlazing
"Target Percentage Glazing"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisMassZoning
"Mass Zoning"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisBuildingOperatingSchedule
"Building Operating Schedule"

Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisCreateAnalyticalModel
"Create Energy Model"

Autodesk.Revit.DB.ParameterTypeId.MassDataSurfaceDataSource
"Values"

Autodesk.Revit.DB.ParameterTypeId.MassDataSkylightWidth
"Skylight Width & Depth"

Autodesk.Revit.DB.ParameterTypeId.MassDataPercentageSkylights
"Target Percentage Skylights"

Autodesk.Revit.DB.ParameterTypeId.MassDataSillHeight
"Target Sill Height"

Autodesk.Revit.DB.ParameterTypeId.MassDataShadeDepth
"Shade Depth"

Autodesk.Revit.DB.ParameterTypeId.MassDataGlazingIsShaded
"Glazing is Shaded"

Autodesk.Revit.DB.ParameterTypeId.MassDataPercentageGlazing
"Target Percentage Glazing"

Autodesk.Revit.DB.ParameterTypeId.MassDataUnderground
"Underground"

Autodesk.Revit.DB.ParameterTypeId.MassDataMassOpeningArea
"Mass Opening Area"

Autodesk.Revit.DB.ParameterTypeId.MassDataMassSkylightArea
"Mass Skylight Area"

Autodesk.Revit.DB.ParameterTypeId.MassDataMassWindowArea
"Mass Window Area"

Autodesk.Revit.DB.ParameterTypeId.MassDataMassRoofArea
"Mass Roof Area"

Autodesk.Revit.DB.ParameterTypeId.MassDataMassInteriorWallArea
"Mass Interior Wall Area"

Autodesk.Revit.DB.ParameterTypeId.MassDataMassExteriorWallArea
"Mass Exterior Wall Area"

Autodesk.Revit.DB.ParameterTypeId.MassDataSubcategory
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.MassDataConceptualConstruction
"Conceptual Types"

Autodesk.Revit.DB.ParameterTypeId.MassZoneConditionTypeParam
"Condition Type"

Autodesk.Revit.DB.ParameterTypeId.MassZoneSpaceTypeParam
"Space Type"

Autodesk.Revit.DB.ParameterTypeId.MassZoneFloorArea
"Mass Floor Area"

Autodesk.Revit.DB.ParameterTypeId.ConceptualConstructionMaterial
"Graphical Appearance"

Autodesk.Revit.DB.ParameterTypeId.MassSurfacedataMaterial
"Graphical Appearance"

Autodesk.Revit.DB.ParameterTypeId.MassZoneMaterial
"Graphical Appearance"

Autodesk.Revit.DB.ParameterTypeId.MassZoneVolume
"Mass Zone Volume"

Autodesk.Revit.DB.ParameterTypeId.LevelDataMassTypeDescription
"Mass: Description"

Autodesk.Revit.DB.ParameterTypeId.LevelDataMassInstanceComments
"Mass: Comments"

Autodesk.Revit.DB.ParameterTypeId.LevelDataMassTypeComments
"Mass: Type Comments"

Autodesk.Revit.DB.ParameterTypeId.LevelDataMassFamilyAndTypeParam
"Mass: Family and Type"

Autodesk.Revit.DB.ParameterTypeId.LevelDataMassFamilyParam
"Mass: Family"

Autodesk.Revit.DB.ParameterTypeId.LevelDataSpaceUsage
"Usage"

Autodesk.Revit.DB.ParameterTypeId.LevelDataOwningLevel
"Level"

Autodesk.Revit.DB.ParameterTypeId.LevelDataMassTypeParam
"Mass: Type"

Autodesk.Revit.DB.ParameterTypeId.LevelDataVolume
"Floor Volume"

Autodesk.Revit.DB.ParameterTypeId.LevelDataSurfaceArea
"Exterior Surface Area"

Autodesk.Revit.DB.ParameterTypeId.LevelDataFloorArea
"Floor Area"

Autodesk.Revit.DB.ParameterTypeId.LevelDataFloorPerimeter
"Floor Perimeter"

Autodesk.Revit.DB.ParameterTypeId.MassGrossVolume
"Gross Volume"

Autodesk.Revit.DB.ParameterTypeId.MassGrossSurfaceArea
"Gross Surface Area"

Autodesk.Revit.DB.ParameterTypeId.MassFloorAreaLevels
"Mass Floors"

Autodesk.Revit.DB.ParameterTypeId.MassGrossArea
"Gross Floor Area"

Autodesk.Revit.DB.ParameterTypeId.MassingIntegrationLevel
"Constrain to Massing"

Autodesk.Revit.DB.ParameterTypeId.ProjectRevisionRevisionIssued
"Issued"

Autodesk.Revit.DB.ParameterTypeId.ProjectRevisionEnumeration
"Numbering"

Autodesk.Revit.DB.ParameterTypeId.ProjectRevisionRevisionIssuedBy
"Issued by"

Autodesk.Revit.DB.ParameterTypeId.ProjectRevisionRevisionIssuedTo
"Issued to"

Autodesk.Revit.DB.ParameterTypeId.ProjectRevisionRevisionDate
"Revision Date"

Autodesk.Revit.DB.ParameterTypeId.ProjectRevisionRevisionDescription
"Revision Description"

Autodesk.Revit.DB.ParameterTypeId.ProjectRevisionRevisionNum
"Revision Number"

Autodesk.Revit.DB.ParameterTypeId.ProjectRevisionSequenceNum
"Revision Sequence": read_only  Make this read-only again when NewSchedules_DisplayTags is cleaned up

Autodesk.Revit.DB.ParameterTypeId.RevisionCloudRevisionIssuedBy
"Issued by"

Autodesk.Revit.DB.ParameterTypeId.RevisionCloudRevisionIssuedTo
"Issued to"

Autodesk.Revit.DB.ParameterTypeId.RevisionCloudRevisionDate
"Revision Date"

Autodesk.Revit.DB.ParameterTypeId.RevisionCloudRevisionDescription
"Revision Description"

Autodesk.Revit.DB.ParameterTypeId.RevisionCloudRevisionNum
"Revision Number"

Autodesk.Revit.DB.ParameterTypeId.RevisionCloudRevision
"Revision"

Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailRotation
"Detail Rotation"

Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailInside
"Inside"

Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailElement
"Detail"

Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailLayout
"Layout"

Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailSpacing
"Spacing"

Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailNumber
"Number"

Autodesk.Revit.DB.ParameterTypeId.InsulationScale
"Insulation Bulge to Width Ratio (1/x)"

Autodesk.Revit.DB.ParameterTypeId.InsulationWidth
"Insulation Width"

Autodesk.Revit.DB.ParameterTypeId.ViewPartsVisibility
"Parts Visibility"

Autodesk.Revit.DB.ParameterTypeId.ViewDetailLevel
"Detail Level"

Autodesk.Revit.DB.ParameterTypeId.PlumbingFixturesVentConnection
"Vent Connection"

Autodesk.Revit.DB.ParameterTypeId.PlumbingFixturesWasteConnection
"Waste Connection"

Autodesk.Revit.DB.ParameterTypeId.PlumbingFixturesCwConnection
"CW Connection"

Autodesk.Revit.DB.ParameterTypeId.PlumbingFixturesHwConnection
"HW Connection"

Autodesk.Revit.DB.ParameterTypeId.PlumbingFixturesTrap
"Trap"

Autodesk.Revit.DB.ParameterTypeId.PlumbingFixturesDrain
"Drain"

Autodesk.Revit.DB.ParameterTypeId.PlumbingFixturesSupplyPipe
"Supply Pipe"

Autodesk.Revit.DB.ParameterTypeId.PlumbingFixturesSupplyFitting
"Supply Fitting"

Autodesk.Revit.DB.ParameterTypeId.LightingFixtureLightEmitter
"Light Emitter"

Autodesk.Revit.DB.ParameterTypeId.FbxLightSpotFieldAngle
"Spot Field Angle"

Autodesk.Revit.DB.ParameterTypeId.FbxLightSpotBeamAngle
"Spot Beam Angle"

Autodesk.Revit.DB.ParameterTypeId.FbxLightSpotTiltAngle
"Tilt Angle"

Autodesk.Revit.DB.ParameterTypeId.FbxLightLimunousFlux
"Luminous Flux"

Autodesk.Revit.DB.ParameterTypeId.LightingFixtureLamp
"Lamp"

Autodesk.Revit.DB.ParameterTypeId.LightingFixtureWattage
"Wattage Comments"

Autodesk.Revit.DB.ParameterTypeId.ElecticalEquipVoltage
"Voltage"

Autodesk.Revit.DB.ParameterTypeId.ElecticalEquipWattage
"Wattage"

Autodesk.Revit.DB.ParameterTypeId.CurtainWallSyspanelThickness
"Thickness"

Autodesk.Revit.DB.ParameterTypeId.CurtainWallPanelHostId
"Host Id"

Autodesk.Revit.DB.ParameterTypeId.CurtainWallSyspanelOffset
"Offset"

Autodesk.Revit.DB.ParameterTypeId.CurtainWallPanelsWidth
"Width"

Autodesk.Revit.DB.ParameterTypeId.CurtainWallPanelsHeight
"Height"

Autodesk.Revit.DB.ParameterTypeId.AllModelModel
"Model"

Autodesk.Revit.DB.ParameterTypeId.AllModelManufacturer
"Manufacturer"

Autodesk.Revit.DB.ParameterTypeId.AllModelInstanceComments
"Comments"

Autodesk.Revit.DB.ParameterTypeId.AllModelTypeComments
"Type Comments"

Autodesk.Revit.DB.ParameterTypeId.AllModelUrl
"URL"

Autodesk.Revit.DB.ParameterTypeId.AllModelDescription
"Description"

Autodesk.Revit.DB.ParameterTypeId.RgbBParam
"Blue value for RGB color spec. (for Use with XAML Data Template example)"

Autodesk.Revit.DB.ParameterTypeId.RgbGParam
"Green value for RGB color spec. (for Use with XAML Data Template example)"

Autodesk.Revit.DB.ParameterTypeId.RgbRParam
"Red value for RGB color spec. (for Use with XAML Data Template example)"

Autodesk.Revit.DB.ParameterTypeId.EllipseYParam
"Y-Radius Value for Ellipse (for Use with XAML Data Template example)"

Autodesk.Revit.DB.ParameterTypeId.EllipseXParam
"X-Radius Value for Ellipse (for Use with XAML Data Template example)"

Autodesk.Revit.DB.ParameterTypeId.GroupnameParam
"Group Name for Ribbon Combo Items (for Use with XAML)"

Autodesk.Revit.DB.ParameterTypeId.IconIndexParam
"Index Into Image File Name Array (for Use with XAML)"

Autodesk.Revit.DB.ParameterTypeId.ShowIconParam
"Flag to display icon in Ribbon Combo Item"

Autodesk.Revit.DB.ParameterTypeId.DebugtabDataboundcontrolsdemoDouble
"Double"

Autodesk.Revit.DB.ParameterTypeId.DebugtabDataboundcontrolsdemoInteger
"Integer"

Autodesk.Revit.DB.ParameterTypeId.DebugtabDataboundcontrolsdemoBoolean
"Boolean"

Autodesk.Revit.DB.ParameterTypeId.DebugtabDataboundcontrolsdemoEnum
"Options"

Autodesk.Revit.DB.ParameterTypeId.GenericDepth
"Depth"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberSectionType
"Section Type": The id of the type from the structural Family assigned to the analytical member.

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelEndProjectionOrthogonal
"End Projection Orthogonal"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelStartProjectionOrthogonal
"Start Projection Orthogonal"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalLinkReleaseRotationZ
"Z Rotation"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalLinkReleaseRotationY
"Y Rotation"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalLinkReleaseRotationX
"X Rotation"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalLinkReleaseTranslationZ
"Z Translation"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalLinkReleaseTranslationY
"Y Translation"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalLinkReleaseTranslationX
"X Translation"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelPhysicalType
"Family Type": the Family Type of the physical element associated with the Analytical Model

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelSketchProjection
"In-Plane Projection"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelSketchAlignmentMethod
"Alignment Method"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelWallBaseProjection
"Base y Projection"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelWallTopProjection
"Top y Projection"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelWallProjection
"z Projection"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelWallAlignmentMethod
"Alignment Method"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelFloorProjection
"z Projection"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelFloorAlignmentMethod
"Alignment Method"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelColumnBaseExtension
"Base x Projection"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelBaseExtensionMethod
"Base Extension Method"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelColumnTopExtension
"Top x Projection"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelTopExtensionMethod
"Top Extension Method"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelTopYProjection
"Top y Projection"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelTopZProjection
"Top z Projection"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelTopAlignmentMethod
"Top Alignment Method"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelBaseYProjection
"Base y Projection"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelBaseZProjection
"Base z Projection"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelBaseAlignmentMethod
"Base Alignment Method"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelEndZProjection
"End z Projection"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelEndYProjection
"End y Projection"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelEndAlignmentMethod
"End Alignment Method"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelStartZProjection
"Start z Projection"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelStartYProjection
"Start y Projection"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelStartAlignmentMethod
"Start Alignment Method"

Autodesk.Revit.DB.ParameterTypeId.ElementLockedParam
"Locked"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterIsPost
"Post"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingConnection
"Rail Connections"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingAngledConnection
"Angled Joins"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingTangentConnection
"Tangent Joins"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingHeightShiftVal
"Landing Height Adjustment"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingHeightShiftType
"Use Landing Height Adjustment"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingRailName
"Name"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterPlacement
"Baluster Placement"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterSlopeAngle
"Slope Angle"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterBottomAngle
"Bottom Cut Angle"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterTopAngle
"Top Cut Angle"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterHeight
"Baluster Height"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingHeightOffset
"Base Offset"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingBaseLevelParam
"Base Level"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterOffset
"Baluster Offset"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterFamily
"Baluster Family"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingRailOffset
"Rail Offset"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingRailHeight
"Rail Height"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingRailStructure
"Rail Structure (Non-Continuous)"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingShape
"Rail Shape"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterLength
"Baluster Length"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterWidth
"Baluster Width"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalustersPerTread
"Balusters Per Tread (Stair Railing Only)"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterSpacing
"Baluster Separation"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterSpacingType
"Baluster Spacing Type (Stair Railing Only)"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterShape
"Baluster Shape"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingThickness
"Railing Thickness"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingWidth
"Railing Width"

Autodesk.Revit.DB.ParameterTypeId.StairsRailingHeight
"Railing Height"

Autodesk.Revit.DB.ParameterTypeId.RampAttrTextSize
"Text Size"

Autodesk.Revit.DB.ParameterTypeId.RampAttrTextFont
"Text Font"

Autodesk.Revit.DB.ParameterTypeId.RampAttrMaterial
"Ramp Material"

Autodesk.Revit.DB.ParameterTypeId.RampAttrRightBalusterAttachPt
"Right Baluster Location"

Autodesk.Revit.DB.ParameterTypeId.RampAttrLeftBalusterAttachPt
"Left Baluster Location"

Autodesk.Revit.DB.ParameterTypeId.RampAttrShape
"Shape"

Autodesk.Revit.DB.ParameterTypeId.RampAttrThickness
"Thickness"

Autodesk.Revit.DB.ParameterTypeId.RampMaxRunLength
"Maximum Incline Length"

Autodesk.Revit.DB.ParameterTypeId.RampAttrMinInvSlope
"Ramp Max Slope (1/x)"

Autodesk.Revit.DB.ParameterTypeId.AssignTemplateOnViewCreation
"New views are dependent on template"

Autodesk.Revit.DB.ParameterTypeId.DefaultViewTemplate
"View Template applied to new views"

Autodesk.Revit.DB.ParameterTypeId.PlanViewViewDir
"View Direction"

Autodesk.Revit.DB.ParameterTypeId.PocheMatId
"Coarse Poche Material"

Autodesk.Revit.DB.ParameterTypeId.ElevatnTag
"Elevation Tag"

Autodesk.Revit.DB.ParameterTypeId.CalloutTag
"Callout Tag"

Autodesk.Revit.DB.ParameterTypeId.SectionTag
"Section Tag"

Autodesk.Revit.DB.ParameterTypeId.CalloutSyncronizeBoundOffsetFar
"Far Clip Settings"

Autodesk.Revit.DB.ParameterTypeId.CalloutCornerSheetRadius
"Corner Radius"

Autodesk.Revit.DB.ParameterTypeId.CalloutAttrHeadTag
"Callout Head"

Autodesk.Revit.DB.ParameterTypeId.GridBubbleEndn2
"Plan View Symbols End 2 (Default)"

Autodesk.Revit.DB.ParameterTypeId.GridBubbleEndn1
"Plan View Symbols End 1 (Default)"

Autodesk.Revit.DB.ParameterTypeId.DatumBubbleLocationInElev
"Non-Plan View Symbols (Default)"

Autodesk.Revit.DB.ParameterTypeId.DatumBubbleEndn1
"Symbol at End 1 Default"

Autodesk.Revit.DB.ParameterTypeId.DatumBubbleEndn2
"Symbol at End 2 Default"

Autodesk.Revit.DB.ParameterTypeId.DatumText
"Name"

Autodesk.Revit.DB.ParameterTypeId.CurveIsMultilevel
"Multilevel Boundary"

Autodesk.Revit.DB.ParameterTypeId.CurveBottomLevel
"Bottom Level"

Autodesk.Revit.DB.ParameterTypeId.CurveTopLevel
"Top Level"

Autodesk.Revit.DB.ParameterTypeId.EllipseFocusMrkVisible
"Focus Marks Visible"

Autodesk.Revit.DB.ParameterTypeId.ArcWallCntrMrkVisible
"Center Mark Visible"

Autodesk.Revit.DB.ParameterTypeId.RefTableParamName
"Parameter Name"

Autodesk.Revit.DB.ParameterTypeId.RefTableElemName
"Key Name"

Autodesk.Revit.DB.ParameterTypeId.RbsPanelScheduleSheetAppearanceInstParam
"Appearance"

Autodesk.Revit.DB.ParameterTypeId.RbsPanelScheduleSheetAppearanceParam
"Appearance On Sheet"

Autodesk.Revit.DB.ParameterTypeId.ScheduleEmbeddedParam
"Embedded Schedule"

Autodesk.Revit.DB.ParameterTypeId.ScheduleSheetAppearanceParam
"Appearance"

Autodesk.Revit.DB.ParameterTypeId.ScheduleFormatParam
"Formatting"

Autodesk.Revit.DB.ParameterTypeId.ScheduleGroupParam
"Sorting/Grouping"

Autodesk.Revit.DB.ParameterTypeId.ScheduleFilterParam
"Filter"

Autodesk.Revit.DB.ParameterTypeId.ScheduleFieldsParam
"Fields"

Autodesk.Revit.DB.ParameterTypeId.RasterSymbolLinkloadStatus
"Link Status"

Autodesk.Revit.DB.ParameterTypeId.RasterEnableSnaps
"Enable Snaps"

Autodesk.Revit.DB.ParameterTypeId.RasterSymbolPagenumber
"Page Number"

Autodesk.Revit.DB.ParameterTypeId.RasterHorizontalScale
"Horizontal Scale"

Autodesk.Revit.DB.ParameterTypeId.RasterVerticalScale
"Vertical Scale"

Autodesk.Revit.DB.ParameterTypeId.RasterSymbolHeight
"Height"

Autodesk.Revit.DB.ParameterTypeId.RasterSymbolWidth
"Width"

Autodesk.Revit.DB.ParameterTypeId.RasterSymbolResolution
"Resolution (dpi)"

Autodesk.Revit.DB.ParameterTypeId.RasterSymbolFilename
"Loaded from file"

Autodesk.Revit.DB.ParameterTypeId.RasterSymbolViewname
"View Name"

Autodesk.Revit.DB.ParameterTypeId.RasterSymbolPixelheight
"Height (pixels)"

Autodesk.Revit.DB.ParameterTypeId.RasterSymbolPixelwidth
"Width (pixels)"

Autodesk.Revit.DB.ParameterTypeId.RasterLockProportions
"Lock Proportions"

Autodesk.Revit.DB.ParameterTypeId.RasterSheetheight
"Height"

Autodesk.Revit.DB.ParameterTypeId.RasterSheetwidth
"Width"

Autodesk.Revit.DB.ParameterTypeId.ImportAdtEntityRoll
"Roll"

Autodesk.Revit.DB.ParameterTypeId.ImportAdtEntityThickness
"Thickness"

Autodesk.Revit.DB.ParameterTypeId.ImportAdtEntityLength
"Length"

Autodesk.Revit.DB.ParameterTypeId.ImportAdtEntityWidth
"Width"

Autodesk.Revit.DB.ParameterTypeId.ImportAdtEntityHeight
"Height"

Autodesk.Revit.DB.ParameterTypeId.ImportAdtComponentsDesc
"Component Description"

Autodesk.Revit.DB.ParameterTypeId.ImportAdtEntityStyle
"Style Name"

Autodesk.Revit.DB.ParameterTypeId.ImportAdtEntityStructType
"Structural Type Name"

Autodesk.Revit.DB.ParameterTypeId.ImportAdtEntityType
"Type Name"

Autodesk.Revit.DB.ParameterTypeId.RvtLinkInstanceProjectInformation
"Project Information"

Autodesk.Revit.DB.ParameterTypeId.RvtLinkPhaseMap
"Phase Mapping"

Autodesk.Revit.DB.ParameterTypeId.RvtLinkReferenceType
"Reference Type"

Autodesk.Revit.DB.ParameterTypeId.RvtLinkFileNameWithoutExt
"File Name"

Autodesk.Revit.DB.ParameterTypeId.RvtLevelOffset
"Map Levels..."

Autodesk.Revit.DB.ParameterTypeId.RvtHostLevel
"Map Levels..."

Autodesk.Revit.DB.ParameterTypeId.RvtSourceLevel
"Map Levels..."

Autodesk.Revit.DB.ParameterTypeId.RvtLinkInstanceName
"Name"

Autodesk.Revit.DB.ParameterTypeId.GeoLocation
"Shared Site"

Autodesk.Revit.DB.ParameterTypeId.ImportInstanceCuttingInView
"Enable Cutting in Views"

Autodesk.Revit.DB.ParameterTypeId.ImportInstanceScale
"Instance Scale"

Autodesk.Revit.DB.ParameterTypeId.ImportBackground
"Draw Layer"

Autodesk.Revit.DB.ParameterTypeId.ImportDisplayUnits
"Import Units"

Autodesk.Revit.DB.ParameterTypeId.ImportBaseLevelOffset
"Offset from Work Plane"

Autodesk.Revit.DB.ParameterTypeId.ImportBaseLevel
"Work Plane"

Autodesk.Revit.DB.ParameterTypeId.ImportScale
"Scale Factor"

Autodesk.Revit.DB.ParameterTypeId.ImportSymbolName
"Name"

Autodesk.Revit.DB.ParameterTypeId.ElevSymbolId
"Elevation Mark"

Autodesk.Revit.DB.ParameterTypeId.ElevReferenceLabelPos
"Reference Label Position"

Autodesk.Revit.DB.ParameterTypeId.ElevAssocDatum
"Associated Datum"

Autodesk.Revit.DB.ParameterTypeId.ElevViewNamePos
"View Name Position"

Autodesk.Revit.DB.ParameterTypeId.ElevShowViewName
"Show View Name"

Autodesk.Revit.DB.ParameterTypeId.ElevTextPos
"Text Position"

Autodesk.Revit.DB.ParameterTypeId.ElevArrowFilled
"Filled"

Autodesk.Revit.DB.ParameterTypeId.ElevArrowAngle
"Arrow Angle"

Autodesk.Revit.DB.ParameterTypeId.ElevShape
"Shape"

Autodesk.Revit.DB.ParameterTypeId.ElevWidth
"Width"

Autodesk.Revit.DB.ParameterTypeId.ColorFillSwatchHeightParam
"Swatch Height"

Autodesk.Revit.DB.ParameterTypeId.ColorFillSwatchWidthParam
"Swatch Width"

Autodesk.Revit.DB.ParameterTypeId.ColorFillFilteredParam
"Values Displayed"

Autodesk.Revit.DB.ParameterTypeId.SheetGuideGrid
"Guide Grid"

Autodesk.Revit.DB.ParameterTypeId.SheetCurrentRevisionIssued
"Current Revision Issued"

Autodesk.Revit.DB.ParameterTypeId.SheetCurrentRevisionIssuedBy
"Current Revision Issued By"

Autodesk.Revit.DB.ParameterTypeId.SheetCurrentRevisionIssuedTo
"Current Revision Issued To"

Autodesk.Revit.DB.ParameterTypeId.SheetCurrentRevisionDate
"Current Revision Date"

Autodesk.Revit.DB.ParameterTypeId.SheetCurrentRevisionDescription
"Current Revision Description"

Autodesk.Revit.DB.ParameterTypeId.SheetRevisionsOnSheet
"Revisions on Sheet"

Autodesk.Revit.DB.ParameterTypeId.SheetCurrentRevision
"Current Revision"

Autodesk.Revit.DB.ParameterTypeId.SheetHeight
"Sheet Height"

Autodesk.Revit.DB.ParameterTypeId.SheetWidth
"Sheet Width"

Autodesk.Revit.DB.ParameterTypeId.SheetFilePath
"File Path"

Autodesk.Revit.DB.ParameterTypeId.SheetApprovedBy
"Approved By"

Autodesk.Revit.DB.ParameterTypeId.SheetDesignedBy
"Designed By"

Autodesk.Revit.DB.ParameterTypeId.SheetScheduled
"Appears In Sheet List"

Autodesk.Revit.DB.ParameterTypeId.SheetCheckedBy
"Checked By"

Autodesk.Revit.DB.ParameterTypeId.SheetDrawnBy
"Drawn By"

Autodesk.Revit.DB.ParameterTypeId.SheetDate
"Date/Time Stamp"

Autodesk.Revit.DB.ParameterTypeId.SheetScale
"Scale"

Autodesk.Revit.DB.ParameterTypeId.SheetNumber
"Sheet Number"

Autodesk.Revit.DB.ParameterTypeId.SheetName
"Sheet Name"

Autodesk.Revit.DB.ParameterTypeId.SpacingAppend
"Append Position"

Autodesk.Revit.DB.ParameterTypeId.AutoJoinConditionWall
"Join Condition"

Autodesk.Revit.DB.ParameterTypeId.AutoMullionBorder2Horiz
"Border 2 Type"

Autodesk.Revit.DB.ParameterTypeId.AutoMullionBorder1Horiz
"Border 1 Type"

Autodesk.Revit.DB.ParameterTypeId.AutoMullionBorder2Vert
"Border 2 Type"

Autodesk.Revit.DB.ParameterTypeId.AutoMullionBorder1Vert
"Border 1 Type"

Autodesk.Revit.DB.ParameterTypeId.AutoMullionInteriorHoriz
"Interior Type"

Autodesk.Revit.DB.ParameterTypeId.AutoMullionInteriorVert
"Interior Type"

Autodesk.Revit.DB.ParameterTypeId.AutoPanelWall
"Curtain Panel"

Autodesk.Revit.DB.ParameterTypeId.AutoJoinCondition
"Join Condition"

Autodesk.Revit.DB.ParameterTypeId.AutoPanel
"Curtain Panel"

Autodesk.Revit.DB.ParameterTypeId.AutoMullionBorder2Grid2
"Border 2 Type"

Autodesk.Revit.DB.ParameterTypeId.AutoMullionBorder1Grid2
"Border 1 Type"

Autodesk.Revit.DB.ParameterTypeId.AutoMullionBorder2Grid1
"Border 2 Type"

Autodesk.Revit.DB.ParameterTypeId.AutoMullionBorder1Grid1
"Border 1 Type"

Autodesk.Revit.DB.ParameterTypeId.AutoMullionInteriorGrid2
"Interior Type"

Autodesk.Revit.DB.ParameterTypeId.AutoMullionInteriorGrid1
"Interior Type"

Autodesk.Revit.DB.ParameterTypeId.CurtainGridBaseOrientation
"Grid Base Orientation"

Autodesk.Revit.DB.ParameterTypeId.MullionAngle
"Angle"

Autodesk.Revit.DB.ParameterTypeId.MullionPosition
"Position"

Autodesk.Revit.DB.ParameterTypeId.MullionProfile
"Profile"

Autodesk.Revit.DB.ParameterTypeId.TrapMullWidth
"Center Width"

Autodesk.Revit.DB.ParameterTypeId.MullionDepth2
"Depth 2"

Autodesk.Revit.DB.ParameterTypeId.MullionDepth1
"Depth 1"

Autodesk.Revit.DB.ParameterTypeId.MullionDepth
"Depth"

Autodesk.Revit.DB.ParameterTypeId.LvMullionLeg2
"Leg 2"

Autodesk.Revit.DB.ParameterTypeId.LvMullionLeg1
"Leg 1"

Autodesk.Revit.DB.ParameterTypeId.MullionCornerType
"Corner Mullion"

Autodesk.Revit.DB.ParameterTypeId.MullionFamType
"Mullion Family General Shape"

Autodesk.Revit.DB.ParameterTypeId.MullionOffset
"Offset"

Autodesk.Revit.DB.ParameterTypeId.CircMullionRadius
"Radius"

Autodesk.Revit.DB.ParameterTypeId.CustMullionThick
"Thickness"

Autodesk.Revit.DB.ParameterTypeId.CustMullionWidth2
"Width on side 2"

Autodesk.Revit.DB.ParameterTypeId.CustMullionWidth1
"Width on side 1"

Autodesk.Revit.DB.ParameterTypeId.RectMullionThick
"Thickness"

Autodesk.Revit.DB.ParameterTypeId.RectMullionWidth2
"Width on side 2"

Autodesk.Revit.DB.ParameterTypeId.RectMullionWidth1
"Width on side 1"

Autodesk.Revit.DB.ParameterTypeId.StairsInstAlwaysUp
"Show Up arrow in all views"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrTrimTop
"Trim Stringers at Top"

Autodesk.Revit.DB.ParameterTypeId.StairsInstDownArrowOn
"Down arrow"

Autodesk.Revit.DB.ParameterTypeId.StairsInstDownLabelText
"Down text"

Autodesk.Revit.DB.ParameterTypeId.StairsInstDownLabelOn
"Down label"

Autodesk.Revit.DB.ParameterTypeId.StairsInstUpArrowOn
"Up arrow"

Autodesk.Revit.DB.ParameterTypeId.StairsInstUpLabelText
"Up text"

Autodesk.Revit.DB.ParameterTypeId.StairsInstUpLabelOn
"Up label"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrTextSize
"Text Size"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrTextFont
"Text Font"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrBodyMaterial
"Monolithic Material"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrLandingCarriage
"Landing Carriage Height"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrLandingsOverlapping
"Landing Overlap"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrRightSideStringer
"Right Stringer"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrLeftSideStringer
"Left Stringer"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrNosingPlacement
"Apply Nosing Profile"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrRiserTreadConnect
"Riser to Tread Connection"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrRiserThickness
"Riser Thickness"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrNumMidStringers
"Middle Stringers"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrStairsCutOffset
"Extend Below Base"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrLastRiser
"End with Riser"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrFirstRiser
"Begin with Riser"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrStairsBottom
"Underside of Winder"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrMonolithicStairs
"Monolithic Stairs"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrCalcEnabled
"Calculation Rules"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrCalcMax
"Calculation Rules"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrCalcMin
"Calculation Rules"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrEqResult
"Calculation Rules"

Autodesk.Revit.DB.ParameterTypeId.StairsActualTreadDepth
"Actual Tread Depth"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrTreadMult
"Tread Multiplier"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrRiserMult
"Riser Multiplier"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrStairCalculator
"Calculation Rules"

Autodesk.Revit.DB.ParameterTypeId.StairsActualNumRisers
"Actual Number of Risers"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrBreakSymInCutline
"Break Symbol in Plan"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrRiserMaterial
"Riser Material"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrRiserType
"Riser Type"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrTreadMaterial
"Tread Material"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrNosingLength
"Nosing Length"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrTreadFrontProfile
"Nosing Profile"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrStringerMaterial
"Stringer Material"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrStringerOffset
"Open Stringer Offset"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrStringerCarriage
"Stringer Carriage Height"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrSideStringerTypeParam
"Type of Side Stringers"

Autodesk.Revit.DB.ParameterTypeId.StairsMultistoryTopLevelParam
"Multistory Top Level"

Autodesk.Revit.DB.ParameterTypeId.StairsStringersPresent
"Stringer Position"

Autodesk.Revit.DB.ParameterTypeId.StairsTopOffset
"Top Offset"

Autodesk.Revit.DB.ParameterTypeId.StairsBaseOffset
"Base Offset"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrRiserAngle
"Riser Angle"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrTreadThickness
"Tread Thickness"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrStringerThickness
"Stringer Thickness"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrStringerHeight
"Stringer Height"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrRisersPresent
"Risers Present"

Autodesk.Revit.DB.ParameterTypeId.StairsActualRiserHeight
"Actual Riser Height"

Autodesk.Revit.DB.ParameterTypeId.StairsDesiredNumRisers
"Desired Number of Risers"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrTreadWidth
"Width"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrMinimumTreadDepth
"Minimum Tread Depth"

Autodesk.Revit.DB.ParameterTypeId.StairsAttrMaxRiserHeight
"Maximum Riser Height"

Autodesk.Revit.DB.ParameterTypeId.StairsTopLevelParam
"Top Level"

Autodesk.Revit.DB.ParameterTypeId.StairsBaseLevelParam
"Base Level"

Autodesk.Revit.DB.ParameterTypeId.LevelIsStructural
"Structural"

Autodesk.Revit.DB.ParameterTypeId.LevelIsBuildingStory
"Building Story"

Autodesk.Revit.DB.ParameterTypeId.LevelUpToLevel
"Story Above"

Autodesk.Revit.DB.ParameterTypeId.LevelRelativeBaseType
"Elevation Base"

Autodesk.Revit.DB.ParameterTypeId.LevelElev
"Elevation"

Autodesk.Revit.DB.ParameterTypeId.LevelName
"Level"

Autodesk.Revit.DB.ParameterTypeId.LevelHeadTag
"Symbol"

Autodesk.Revit.DB.ParameterTypeId.MultiReferenceAnnotationShowDimensionText
"Show Dimension Text"

Autodesk.Revit.DB.ParameterTypeId.MultiReferenceAnnotationDimensionStyle
"Dimension Style"

Autodesk.Revit.DB.ParameterTypeId.MultiReferenceAnnotationGroupTagHeads
"Group Matching Tag Heads"

Autodesk.Revit.DB.ParameterTypeId.MultiReferenceAnnotationTagType
"Tag Family"

Autodesk.Revit.DB.ParameterTypeId.MultiReferenceAnnotationReferenceCategory
"Reference Category"

Autodesk.Revit.DB.ParameterTypeId.TagElevationBase
"Elevation Base"

Autodesk.Revit.DB.ParameterTypeId.TagElementCount
"Host Count"

Autodesk.Revit.DB.ParameterTypeId.TagAngleParam
"Angle"

Autodesk.Revit.DB.ParameterTypeId.TagLeaderType
"Leader Type"

Autodesk.Revit.DB.ParameterTypeId.TagNoBreakParamStrings
"Wrap between parameters only"

Autodesk.Revit.DB.ParameterTypeId.RoomTagOrientationParam
"Orientation"

Autodesk.Revit.DB.ParameterTypeId.TagOrientationParam
"Orientation"

Autodesk.Revit.DB.ParameterTypeId.TagSampleText
"Sample Text"

Autodesk.Revit.DB.ParameterTypeId.TagTag
"Label"

Autodesk.Revit.DB.ParameterTypeId.DiameterSymbolText
"Diameter Symbol Text"

Autodesk.Revit.DB.ParameterTypeId.DiameterSymbolLocation
"Diameter Symbol Location"

Autodesk.Revit.DB.ParameterTypeId.RadiusSymbolText
"Radius Symbol Text"

Autodesk.Revit.DB.ParameterTypeId.VisGraphicsCoordinationModel
"V/G Overrides Coordination Model"

Autodesk.Revit.DB.ParameterTypeId.VisGraphicsPointClouds
"V/G Overrides Point Clouds"

Autodesk.Revit.DB.ParameterTypeId.VisGraphicsWorksets
"V/G Overrides Worksets"

Autodesk.Revit.DB.ParameterTypeId.VisGraphicsAnalyticalModel
"V/G Overrides Analytical Model"

Autodesk.Revit.DB.ParameterTypeId.VisGraphicsDesignoptions
"V/G Overrides Design Options"

Autodesk.Revit.DB.ParameterTypeId.VisGraphicsRvtLinks
"V/G Overrides RVT Links"

Autodesk.Revit.DB.ParameterTypeId.VisGraphicsFilters
"V/G Overrides Filters"

Autodesk.Revit.DB.ParameterTypeId.VisGraphicsImport
"V/G Overrides Import"

Autodesk.Revit.DB.ParameterTypeId.VisGraphicsAnnotation
"V/G Overrides Annotation"

Autodesk.Revit.DB.ParameterTypeId.VisGraphicsModel
"V/G Overrides Model"

Autodesk.Revit.DB.ParameterTypeId.LevelAttrRoomComputationAutomatic
"Automatic Room Computation Height"

Autodesk.Revit.DB.ParameterTypeId.LevelAttrRoomComputationHeight
"Computation Height"

Autodesk.Revit.DB.ParameterTypeId.LevelRoomComputationHeight
"Computation Height"

Autodesk.Revit.DB.ParameterTypeId.RoomComputationHeight
"Computation Height"

Autodesk.Revit.DB.ParameterTypeId.AlwaysZeroLength
"Base Offset"

Autodesk.Revit.DB.ParameterTypeId.RoomComputationMethod
"Computation"

Autodesk.Revit.DB.ParameterTypeId.RoomLowerOffset
"Base Offset"

Autodesk.Revit.DB.ParameterTypeId.RoomUpperOffset
"Limit Offset"

Autodesk.Revit.DB.ParameterTypeId.RoomUpperLevel
"Upper Limit"

Autodesk.Revit.DB.ParameterTypeId.RoomVolume
"Volume"

Autodesk.Revit.DB.ParameterTypeId.RoomHeight
"Unbounded Height"

Autodesk.Revit.DB.ParameterTypeId.RoomPerimeter
"Perimeter"

Autodesk.Revit.DB.ParameterTypeId.RoomLevelId
"Level"

Autodesk.Revit.DB.ParameterTypeId.RoomOccupancy
"Occupancy"

Autodesk.Revit.DB.ParameterTypeId.RoomDepartment
"Department"

Autodesk.Revit.DB.ParameterTypeId.RoomFinishBase
"Base Finish"

Autodesk.Revit.DB.ParameterTypeId.RoomFinishCeiling
"Ceiling Finish"

Autodesk.Revit.DB.ParameterTypeId.RoomFinishWall
"Wall Finish"

Autodesk.Revit.DB.ParameterTypeId.RoomFinishFloor
"Floor Finish"

Autodesk.Revit.DB.ParameterTypeId.RoomArea
"Area"

Autodesk.Revit.DB.ParameterTypeId.RoomNumber
"Number"

Autodesk.Revit.DB.ParameterTypeId.RoomName
"Name"

Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrLegendHorOriginGap
"Legend Horizontal Origin Gap"

Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrLegendVertOriginGap
"Legend Vertical Origin Gap"

Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrLegendWidth
"Legend Width"

Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrLegendHeight
"Legend Height"

Autodesk.Revit.DB.ParameterTypeId.ViewAnalysisResultsVisibility
"Analysis Display Settings"

Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrLegendTextType
"Overall Legend Text"

Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrResultsVisibility
"Results Visibility"

Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrLegendShowDescription
"Show Description"

Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrLegendShowConfigName
"Show Configuration Name"

Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrDescription
"Description"

Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrCurrentName
"Analysis Configuration"

Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrRange
"Data Range"

Autodesk.Revit.DB.ParameterTypeId.GridEndSegmentsLength
"End Segments Length"

Autodesk.Revit.DB.ParameterTypeId.GridEndSegmentPattern
"End Segment Pattern"

Autodesk.Revit.DB.ParameterTypeId.GridEndSegmentColor
"End Segment Color"

Autodesk.Revit.DB.ParameterTypeId.GridEndSegmentWeight
"End Segment Weight"

Autodesk.Revit.DB.ParameterTypeId.GridCenterSegmentPattern
"Center Segment Pattern"

Autodesk.Revit.DB.ParameterTypeId.GridCenterSegmentColor
"Center Segment Color"

Autodesk.Revit.DB.ParameterTypeId.GridCenterSegmentWeight
"Center Segment Weight"

Autodesk.Revit.DB.ParameterTypeId.GridCenterSegmentStyle
"Center Segment"

Autodesk.Revit.DB.ParameterTypeId.GridBubbleLinePen
"Bubble Weight Number\n"

Autodesk.Revit.DB.ParameterTypeId.GridHeadTag
"Symbol"

Autodesk.Revit.DB.ParameterTypeId.StairsPathFullStepArrow
"Full Step Arrow"

Autodesk.Revit.DB.ParameterTypeId.StairsPathStartExtension
"Start Extension"

Autodesk.Revit.DB.ParameterTypeId.NumberSystemTextSize
"Number Size"

Autodesk.Revit.DB.ParameterTypeId.NumberSystemTagType
"Tag Type"

Autodesk.Revit.DB.ParameterTypeId.NumberSystemDisplayRule
"Display Rule"

Autodesk.Revit.DB.ParameterTypeId.NumberSystemReference
"Reference"

Autodesk.Revit.DB.ParameterTypeId.NumberSystemJustify
"Justify"

Autodesk.Revit.DB.ParameterTypeId.NumberSystemOrientation
"Orientation"

Autodesk.Revit.DB.ParameterTypeId.NumberSystemReferenceOffset
"Offset from Reference"

Autodesk.Revit.DB.ParameterTypeId.NumberSystemJustifyOffset
"Justify Offset"

Autodesk.Revit.DB.ParameterTypeId.StairsTextOrientation
"Orientation"

Autodesk.Revit.DB.ParameterTypeId.StairsTextType
"Text Type"

Autodesk.Revit.DB.ParameterTypeId.StairsDownText
"Down Text"

Autodesk.Revit.DB.ParameterTypeId.StairsShowDownText
"Show Down Text"

Autodesk.Revit.DB.ParameterTypeId.StairsUpText
"Up Text"

Autodesk.Revit.DB.ParameterTypeId.StairsShowUpText
"Show Up Text"

Autodesk.Revit.DB.ParameterTypeId.ShowArrowheadToCutMark
"Show Arrowhead to Cut Mark"

Autodesk.Revit.DB.ParameterTypeId.DrawForEachRun
"Draw for Each Run"

Autodesk.Revit.DB.ParameterTypeId.ArrowheadEndAtRiser
"End at Riser"

Autodesk.Revit.DB.ParameterTypeId.StairsPathStartFromRiser
"Start from Riser"

Autodesk.Revit.DB.ParameterTypeId.DistanceToCutMark
"Distance to Cut Mark"

Autodesk.Revit.DB.ParameterTypeId.LineShapeAtCorner
"Line Shape at Landing Corner"

Autodesk.Revit.DB.ParameterTypeId.ArrowheadType
"Arrowhead Type"

Autodesk.Revit.DB.ParameterTypeId.StartSymbolType
"Start Symbol Type"

Autodesk.Revit.DB.ParameterTypeId.CutMarkSymbolSize
"Cut Mark Symbol Size"

Autodesk.Revit.DB.ParameterTypeId.CutLineType
"Cut Line Type"

Autodesk.Revit.DB.ParameterTypeId.CutLineAngle
"Cut Line Angle"

Autodesk.Revit.DB.ParameterTypeId.CutLineExtension
"Cut Line Extension"

Autodesk.Revit.DB.ParameterTypeId.CutLineDistance
"Cut Line Distance"

Autodesk.Revit.DB.ParameterTypeId.CutMarkSymbol
"Cut Mark Symbol"

Autodesk.Revit.DB.ParameterTypeId.SectionBrokenDisplayStyle
"Broken Section Display Style"

Autodesk.Revit.DB.ParameterTypeId.SectionCoarserScalePulldownImperial
"Hide at scales coarser than"

Autodesk.Revit.DB.ParameterTypeId.SectionCoarserScalePulldownMetric
"Hide at scales coarser than"

Autodesk.Revit.DB.ParameterTypeId.SectionParentViewName
"Parent View"

Autodesk.Revit.DB.ParameterTypeId.SectionShowInOneViewOnly
"Show in"

Autodesk.Revit.DB.ParameterTypeId.SectionAttrTailTag
"Section Tail"

Autodesk.Revit.DB.ParameterTypeId.SectionAttrTailWidth
"Tail width"

Autodesk.Revit.DB.ParameterTypeId.SectionAttrTailLength
"Tail length"

Autodesk.Revit.DB.ParameterTypeId.ViewerDetailNumber
"Detail Number"

Autodesk.Revit.DB.ParameterTypeId.ViewerSheetNumber
"Sheet Number"

Autodesk.Revit.DB.ParameterTypeId.SectionAttrHeadTag
"Section Head"

Autodesk.Revit.DB.ParameterTypeId.AlignmentStationLabelStationValue
"Station Value"

Autodesk.Revit.DB.ParameterTypeId.AlignmentStationLabelIndStation
"Station Indicator"

Autodesk.Revit.DB.ParameterTypeId.AlignmentStationLabelIncludeStation
"Include Station"

Autodesk.Revit.DB.ParameterTypeId.SpotDimLeaderLine
"Leader Line"

Autodesk.Revit.DB.ParameterTypeId.AlignmentStationLabelDistance
"Distance": Currently not in use

Autodesk.Revit.DB.ParameterTypeId.AlignmentStationSuffix
"Station Suffix"

Autodesk.Revit.DB.ParameterTypeId.AlignmentStationPrefix
"Station Prefix"

Autodesk.Revit.DB.ParameterTypeId.DimSuffix
"Dimension Suffix"

Autodesk.Revit.DB.ParameterTypeId.DimPrefix
"Dimension Prefix"

Autodesk.Revit.DB.ParameterTypeId.ArrowCentered
"Tick Mark Centered"

Autodesk.Revit.DB.ParameterTypeId.InteriorTickDisplay
"Interior Tick Mark Display"

Autodesk.Revit.DB.ParameterTypeId.WitnsLineTickMark
"Witness Line Tick Mark"

Autodesk.Revit.DB.ParameterTypeId.DimTotalLength
"Total Length"

Autodesk.Revit.DB.ParameterTypeId.DimReferenceCount
"Count"

Autodesk.Revit.DB.ParameterTypeId.AlternateUnitsSuffix
"Alternate Units Suffix"

Autodesk.Revit.DB.ParameterTypeId.AlternateUnitsPrefix
"Alternate Units Prefix"

Autodesk.Revit.DB.ParameterTypeId.EqualityWitnessDisplay
"Equality Witness Display"

Autodesk.Revit.DB.ParameterTypeId.DimStyleSuppressSpaces
"Suppress Spaces"

Autodesk.Revit.DB.ParameterTypeId.EqualityFormula
"Equality Formula"

Autodesk.Revit.DB.ParameterTypeId.DimStyleLeaderTickMark
"Leader Tick Mark"

Autodesk.Revit.DB.ParameterTypeId.EqualityTextForAngularDim
"Equality Text"

Autodesk.Revit.DB.ParameterTypeId.EqualityTextForContinuousLinearDim
"Equality Text"

Autodesk.Revit.DB.ParameterTypeId.DimTextLocationForLeader
"Text Location"

Autodesk.Revit.DB.ParameterTypeId.DimLeaderDisplayCondition
"Show Leader When Text Moves"

Autodesk.Revit.DB.ParameterTypeId.DimLeaderShoulderLength
"Shoulder Length"

Autodesk.Revit.DB.ParameterTypeId.DimLeaderType
"Leader Type"

Autodesk.Revit.DB.ParameterTypeId.DimToIntersectingGrids
"Dimension To Intersecting Grids"

Autodesk.Revit.DB.ParameterTypeId.DimToIntersectingWalls
"Dimension To Intersecting Walls"

Autodesk.Revit.DB.ParameterTypeId.DimToInsertType
"Dimension To Opening Type"

Autodesk.Revit.DB.ParameterTypeId.FixedRotation
"Fixed Rotation"

Autodesk.Revit.DB.ParameterTypeId.KeepReadable
"Keep Readable"

Autodesk.Revit.DB.ParameterTypeId.LeaderLine
"Leader Line"

Autodesk.Revit.DB.ParameterTypeId.LeaderOffsetSheet
"Leader/Border Offset"

Autodesk.Revit.DB.ParameterTypeId.DimToInserts
"Dimension To Openings"

Autodesk.Revit.DB.ParameterTypeId.SpotSlopeOffsetFromReference
"Offset from Reference"

Autodesk.Revit.DB.ParameterTypeId.SpotSlopeSlopeRepresentation
"Slope Representation"

Autodesk.Revit.DB.ParameterTypeId.SpotSlopeSlopeDirection
"Slope Direction"

Autodesk.Revit.DB.ParameterTypeId.SpotElevLowerValue
"Lower Value"

Autodesk.Revit.DB.ParameterTypeId.SpotElevSingleOrUpperValue
"Single/Upper Value"

Autodesk.Revit.DB.ParameterTypeId.SpotElevIndTypeElevation
"Elevation Indicator as Prefix/Suffix"

Autodesk.Revit.DB.ParameterTypeId.SpotCoordinateIncludeElevation
"Include Elevation"

Autodesk.Revit.DB.ParameterTypeId.SpotCoordinateElevationSuffix
"Elevation Suffix"

Autodesk.Revit.DB.ParameterTypeId.SpotCoordinateElevationPrefix
"Elevation Prefix"

Autodesk.Revit.DB.ParameterTypeId.SpotCoordinateBottomSuffix
"Bottom Coordinate Suffix"

Autodesk.Revit.DB.ParameterTypeId.SpotCoordinateBottomPrefix
"Bottom Coordinate Prefix"

Autodesk.Revit.DB.ParameterTypeId.SpotCoordinateTopSuffix
"Top Coordinate Suffix"

Autodesk.Revit.DB.ParameterTypeId.SpotCoordinateTopPrefix
"Top Coordinate Prefix"

Autodesk.Revit.DB.ParameterTypeId.SpotElevLowerSuffix
"Lower Value Suffix"

Autodesk.Revit.DB.ParameterTypeId.SpotElevLowerPrefix
"Lower Value Prefix"

Autodesk.Revit.DB.ParameterTypeId.SpotElevSingleOrUpperSuffix
"Single/Upper Value Suffix"

Autodesk.Revit.DB.ParameterTypeId.SpotElevSingleOrUpperPrefix
"Single/Upper Value Prefix"

Autodesk.Revit.DB.ParameterTypeId.BaselineDimOffset
"Baseline Offset"

Autodesk.Revit.DB.ParameterTypeId.SpotElevBendLeader
"Leader Shoulder"

Autodesk.Revit.DB.ParameterTypeId.SpotElevIndTypeBottom
"Bottom Indicator as Prefix/Suffix"

Autodesk.Revit.DB.ParameterTypeId.SpotElevIndTypeTop
"Top Indicator as Prefix/Suffix"

Autodesk.Revit.DB.ParameterTypeId.SpotElevIndBottom
"Bottom Indicator"

Autodesk.Revit.DB.ParameterTypeId.SpotElevIndTop
"Top Indicator"

Autodesk.Revit.DB.ParameterTypeId.SpotElevTextLocation
"Text Location"

Autodesk.Revit.DB.ParameterTypeId.SpotElevRotateWithComponent
"Rotate with Component"

Autodesk.Revit.DB.ParameterTypeId.SpotElevDisplayElevations
"Display Elevations"

Autodesk.Revit.DB.ParameterTypeId.OrdinateDimSetting
"Ordinate Dimension Settings"

Autodesk.Revit.DB.ParameterTypeId.LinearDimType
"Dimension String Type"

Autodesk.Revit.DB.ParameterTypeId.SpotDimLeader
"Leader"

Autodesk.Revit.DB.ParameterTypeId.DimStyleFlippedDimLineExtension
"Flipped Dimension Line Extension"

Autodesk.Revit.DB.ParameterTypeId.DimStyleInteriorTickMark
"Interior Tick Mark"

Autodesk.Revit.DB.ParameterTypeId.SpotTextFromLeader
"Text Offset from Leader"

Autodesk.Revit.DB.ParameterTypeId.SpotCoordinateBase
"Coordinate Base"

Autodesk.Revit.DB.ParameterTypeId.DimStyleAngularUnitsAlt
"Alternate Units Format"

Autodesk.Revit.DB.ParameterTypeId.SpotElevIndType
"Indicator as Prefix / Suffix"

Autodesk.Revit.DB.ParameterTypeId.SpotElevBotValue
"Bottom Coordinate"

Autodesk.Revit.DB.ParameterTypeId.AlternateUnits
"Alternate Units"

Autodesk.Revit.DB.ParameterTypeId.SpotElevTopValue
"Top Coordinate"

Autodesk.Revit.DB.ParameterTypeId.DimStyleLinearUnitsAlt
"Alternate Units Format"

Autodesk.Revit.DB.ParameterTypeId.SpotElevTextOrientation
"Text Orientation"

Autodesk.Revit.DB.ParameterTypeId.SpotElevIndElevation
"Elevation Indicator"

Autodesk.Revit.DB.ParameterTypeId.SpotElevIndEw
"East / West Indicator"

Autodesk.Revit.DB.ParameterTypeId.SpotElevIndNs
"North / South Indicator"

Autodesk.Revit.DB.ParameterTypeId.ArrowClosed
"Arrow Closed"

Autodesk.Revit.DB.ParameterTypeId.DimStyleReadConvention
"Read Convention"

Autodesk.Revit.DB.ParameterTypeId.HeavyEndPen
"Heavy End Pen Weight"

Autodesk.Revit.DB.ParameterTypeId.DimStyleDimLineSnapDist
"Dimension Line Snap Distance"

Autodesk.Revit.DB.ParameterTypeId.DimStyleCenterlineTickMark
"Centerline Tick Mark"

Autodesk.Revit.DB.ParameterTypeId.SpotElevLinePen
"Leader Line Weight"

Autodesk.Revit.DB.ParameterTypeId.SpotElevTickMarkPen
"Leader Arrowhead Line Weight"

Autodesk.Revit.DB.ParameterTypeId.SpotElevLeaderArrowhead
"Leader Arrowhead"

Autodesk.Revit.DB.ParameterTypeId.SpotElevRelativeBase
"Relative Base"

Autodesk.Revit.DB.ParameterTypeId.SpotElevFlipTextVert
"Auto Mirror"

Autodesk.Revit.DB.ParameterTypeId.SpotElevTextHorizOffset
"Text Offset from Symbol"

Autodesk.Revit.DB.ParameterTypeId.SpotElevBase
"Elevation Base"

Autodesk.Revit.DB.ParameterTypeId.SpotElevSymbol
"Symbol"

Autodesk.Revit.DB.ParameterTypeId.DimStyleShowOpeningHt
"Show Opening Height"

Autodesk.Revit.DB.ParameterTypeId.DimStyleCenterlinePattern
"Centerline Pattern"

Autodesk.Revit.DB.ParameterTypeId.DimWitnsLineExtensionBelow
"Witness Line Length"

Autodesk.Revit.DB.ParameterTypeId.DimWitnsLineCntrl
"Witness Line Control"

Autodesk.Revit.DB.ParameterTypeId.DimLineExtension
"Dimension Line Extension"

Autodesk.Revit.DB.ParameterTypeId.DimStyleCenterlineSymbol
"Centerline Symbol"

Autodesk.Revit.DB.ParameterTypeId.DimTextBackground
"Text Background"

Autodesk.Revit.DB.ParameterTypeId.DimStyleAngularUnits
"Units Format"

Autodesk.Revit.DB.ParameterTypeId.DimStyleLinearUnits
"Units Format"

Autodesk.Revit.DB.ParameterTypeId.LeaderArrowWidth
"Arrow Width Angle"

Autodesk.Revit.DB.ParameterTypeId.ArrowFilled
"Fill Tick"

Autodesk.Revit.DB.ParameterTypeId.HeavyTickMarkPen
"Heavy End Pen Weight"

Autodesk.Revit.DB.ParameterTypeId.ArrowSize
"Tick Size"

Autodesk.Revit.DB.ParameterTypeId.ArrowType
"Arrow Style"

Autodesk.Revit.DB.ParameterTypeId.TickMarkPen
"Tick Mark Line Weight"

Autodesk.Revit.DB.ParameterTypeId.TextPosition
"Text Position"

Autodesk.Revit.DB.ParameterTypeId.RadiusSymbolLocation
"Radius Symbol Location"

Autodesk.Revit.DB.ParameterTypeId.CenterMarkSize
"Center Mark Size"

Autodesk.Revit.DB.ParameterTypeId.ArcCenterMark
"Center Marks"

Autodesk.Revit.DB.ParameterTypeId.WitnsLineGapToElt
"Witness Line Gap to Element"

Autodesk.Revit.DB.ParameterTypeId.WitnsLineExtension
"Witness Line Extension"

Autodesk.Revit.DB.ParameterTypeId.TextDistToLine
"Text Offset"

Autodesk.Revit.DB.ParameterTypeId.TextAlignment
"Text Alignment"

Autodesk.Revit.DB.ParameterTypeId.ModelTextSize
"Text Size"

Autodesk.Revit.DB.ParameterTypeId.TextStyleSize
"Size"

Autodesk.Revit.DB.ParameterTypeId.TextStyleFont
"Font"

Autodesk.Revit.DB.ParameterTypeId.ShowTitle
"Show Title"

Autodesk.Revit.DB.ParameterTypeId.TitleStyleUnderline
"Underline"

Autodesk.Revit.DB.ParameterTypeId.TitleStyleItalic
"Italic"

Autodesk.Revit.DB.ParameterTypeId.TitleStyleBold
"Bold"

Autodesk.Revit.DB.ParameterTypeId.TitleSize
"Size"

Autodesk.Revit.DB.ParameterTypeId.TitleFont
"Font"

Autodesk.Revit.DB.ParameterTypeId.TextWidthScale
"Width Factor"

Autodesk.Revit.DB.ParameterTypeId.TextTabSize
"Tab Size"

Autodesk.Revit.DB.ParameterTypeId.ArcLeaderParam
"Arc Leaders"

Autodesk.Revit.DB.ParameterTypeId.DimLeaderArrowhead
"Tick Mark"

Autodesk.Revit.DB.ParameterTypeId.SheetIssueDate
"Sheet Issue Date"

Autodesk.Revit.DB.ParameterTypeId.ProjectIssueDate
"Project Issue Date"

Autodesk.Revit.DB.ParameterTypeId.ProjectStatus
"Project Status"

Autodesk.Revit.DB.ParameterTypeId.ClientName
"Client Name"

Autodesk.Revit.DB.ParameterTypeId.ProjectAddress
"Project Address"

Autodesk.Revit.DB.ParameterTypeId.ProjectName
"Project Name"

Autodesk.Revit.DB.ParameterTypeId.ProjectNumber
"Project Number"

Autodesk.Revit.DB.ParameterTypeId.LeaderArrowhead
"Leader Arrowhead"

Autodesk.Revit.DB.ParameterTypeId.TextBackground
"Background"

Autodesk.Revit.DB.ParameterTypeId.TextStyleUnderline
"Underline"

Autodesk.Revit.DB.ParameterTypeId.TextStyleItalic
"Italic"

Autodesk.Revit.DB.ParameterTypeId.TextStyleBold
"Bold"

Autodesk.Revit.DB.ParameterTypeId.CurveIsFilled
"Filled"

Autodesk.Revit.DB.ParameterTypeId.TextAlignVert
"Vertical Align"

Autodesk.Revit.DB.ParameterTypeId.TextAlignHorz
"Horizontal Align"

Autodesk.Revit.DB.ParameterTypeId.TextText
"Text"

Autodesk.Revit.DB.ParameterTypeId.LinePattern
"Line Pattern"

Autodesk.Revit.DB.ParameterTypeId.LineColor
"Color"

Autodesk.Revit.DB.ParameterTypeId.LinePen
"Line Weight"

Autodesk.Revit.DB.ParameterTypeId.TextColor
"Color"

Autodesk.Revit.DB.ParameterTypeId.TextSize
"Text Size"

Autodesk.Revit.DB.ParameterTypeId.TextFont
"Text Font"

Autodesk.Revit.DB.ParameterTypeId.ReferenceLineSubcategory
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.ClineSubcategory
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.EdgeLinework
"Line Style"

Autodesk.Revit.DB.ParameterTypeId.BuildingCurveGstylePlusInvisible
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.BuildingCurveGstyle
"Line Style"

Autodesk.Revit.DB.ParameterTypeId.FamilyCurveGstyleFor2010Mass
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.HeadOnPlacementMethod
"Draw in Foreground"

Autodesk.Revit.DB.ParameterTypeId.IsVisibleParam
"Visible"

Autodesk.Revit.DB.ParameterTypeId.FamilyCurveGstylePlusInvisiblePlusStickSymMinusAnalytical
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.FamilyCurveGstylePlusInvisibleMinusAnalytical
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.FamilyCurveGstylePlusInvisiblePlusStickSym
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.FamilyCurveGstylePlusInvisible
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.FamilyElemSubcategory
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.StairsCurveType
"Stairs Line Type"

Autodesk.Revit.DB.ParameterTypeId.RoofSlope
"Slope"

Autodesk.Revit.DB.ParameterTypeId.CurveParamSteelCantilever
"Steel Cantilever"

Autodesk.Revit.DB.ParameterTypeId.CurveParamConcreteCantilever
"Concrete Cantilever"

Autodesk.Revit.DB.ParameterTypeId.CurveNumberOfSegments
"Number of Full Segments"

Autodesk.Revit.DB.ParameterTypeId.SpecifySlopeOrOffset
"Specify "

Autodesk.Revit.DB.ParameterTypeId.SlopeArrowLevelEnd
"Level at Head"

Autodesk.Revit.DB.ParameterTypeId.SlopeArrowLevelStart
"Level at Tail"

Autodesk.Revit.DB.ParameterTypeId.CurveLevel
"Level"

Autodesk.Revit.DB.ParameterTypeId.CurveHeightOffset
"Offset From Base"

Autodesk.Revit.DB.ParameterTypeId.CurveIsSlopeDefining
"Defines Slope"

Autodesk.Revit.DB.ParameterTypeId.DefinesConstantHeight
"Defines Constant Height"

Autodesk.Revit.DB.ParameterTypeId.RoofCurveHeightAtWall
"Plate Offset From Base"

Autodesk.Revit.DB.ParameterTypeId.RoofCurveHeightOffset
"Offset From Roof Base"

Autodesk.Revit.DB.ParameterTypeId.RoofCurveIsSlopeDefining
"Defines Roof Slope"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeWebthicknessLocation
"Web Thickness Location"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeFlangethicknessLocation
"Flange Thickness Location"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionTopWebFillet
"Top Web Fillet"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionSlopedWebAngle
"Sloped Web Angle"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionSlopedFlangeAngle
"Sloped Flange Angle"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCantileverHeight
"Cantilever Height"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCantileverLength
"Cantilever Length"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionBottomCutHeight
"Bottom Cut Height"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionBottomCutWidth
"Bottom Cut Width"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionTopCutHeight
"Top Cut Height"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionTopCutWidth
"Top Cut Width"

Autodesk.Revit.DB.ParameterTypeId.StructuralFamilyCodeName
"Code Name"

Autodesk.Revit.DB.ParameterTypeId.StructuralFamilyNameKey
"Family Name Key"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionNameKey
"Section Name Key"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionSigmaProfileTopBendWidth
"Top Bend Length"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionSigmaProfileMiddleBendWidth
"Middle Bend Length"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionSigmaProfileBendWidth
"Bend Width"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionZprofileBottomFlangeLength
"Bottom Flange Length"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCprofileFoldLength
"Fold Length"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionLprofileLipLength
"Lip Length"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionLangleBoltDiameterShorterFlange
"Bolt Diameter Shorter Flange"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionLangleBoltDiameterLongerFlange
"Bolt Diameter Longer Flange"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionLangleBoltSpacingShorterFlange
"Bolt Spacing Shorter Flange"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionLangleBoltSpacing2LongerFlange
"Bolt Spacing 2 Longer Flange"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionLangleBoltSpacing1LongerFlange
"Bolt Spacing 1 Longer Flange"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeBoltSpacingWeb
"Bolt Spacing web"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeBoltSpacingBetweenRows
"Bolt Spacing between Rows"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeBoltSpacingTwoRows
"Bolt Spacing Two Rows"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeBoltDiameter
"Bolt Diameter"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeBoltSpacing
"Bolt Spacing"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeWebToeOfFillet
"Web Toe of Fillet"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeFlangeToeOfFillet
"Flange Toe of Fillet"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeClearWebHeight
"Clear Web Height"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIweldedBottomflangewidth
"Bottom Flange Width"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIweldedBottomflangethickness
"Bottom Flange Thickness"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIweldedTopflangewidth
"Top Flange Width"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIweldedTopflangethickness
"Top Flange Thickness"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionHssOuterfillet
"Outer Fillet"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionHssInnerfillet
"Inner Fillet"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeWebfillet
"Web Fillet"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeFlangefillet
"Flange Fillet"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeWebheight
"Web Height"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeWebthickness
"Web Thickness"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIshapeFlangethickness
"Flange Thickness"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonShearAreaWeakAxis
"Shear Area weak axis"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonShearAreaStrongAxis
"Shear Area strong axis"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonWarpingConstant
"Warping Constant"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonTorsionalModulus
"Torsional Modulus"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonTorsionalMomentOfInertia
"Torsional Moment of Inertia"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonPlasticModulusWeakAxis
"Plastic Modulus weak axis"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonPlasticModulusStrongAxis
"Plastic Modulus strong axis"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonElasticModulusWeakAxis
"Elastic Modulus weak axis"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonElasticModulusStrongAxis
"Elastic Modulus strong axis"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonMomentOfInertiaWeakAxis
"Moment of Inertia weak axis"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonMomentOfInertiaStrongAxis
"Moment of Inertia strong axis"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonNominalWeight
"Nominal Weight"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonPerimeter
"Perimeter"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonAlpha
"Principal Axes Angle"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonCentroidVertical
"Centroid Vertical"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonCentroidHoriz
"Centroid Horizontal"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionArea
"Section Area"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionPipestandardWalldesignthickness
"Wall Design Thickness"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionPipestandardWallnominalthickness
"Wall Nominal Thickness"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonDiameter
"Diameter"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonHeight
"Height"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonWidth
"Width"

Autodesk.Revit.DB.ParameterTypeId.StructuralSectionShape
"Section Shape"

Autodesk.Revit.DB.ParameterTypeId.StructuralMaterialParam
"Structural Material"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalDefineThermalPropertiesBy
"Define Thermal Properties by"

Autodesk.Revit.DB.ParameterTypeId.AnalyticConstructionGbxmlTypeid
"Construction Type Id"

Autodesk.Revit.DB.ParameterTypeId.AnalyticConstructionLookupTable
"Analytic Construction"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalRoughness
"Roughness"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalAbsorptance
"Absorptance"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalThermalMass
"Thermal Mass"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalVisualLightTransmittance
"Visual Light Transmittance"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalSolarHeatGainCoefficient
"Solar Heat Gain Coefficient"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalThermalResistance
"Thermal Resistance (R)"

Autodesk.Revit.DB.ParameterTypeId.AnalyticalHeatTransferCoefficient
"Heat Transfer Coefficient (U)"

Autodesk.Revit.DB.ParameterTypeId.ViewDesignOptionsConfig
"Design Option Configuration"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyLightingAltitudeText
"Lighting altitude text"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyLightingAltitudeValue
"Lighting altitude"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyLightingAzimuthText
"Lighting azimuth text"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyLightingAzimuthValue
"Lighting azimuth"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyMultidayDatetimeText
"Multi-day date and time text"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyMultidayFrameText
"Multi-day frame text"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyMultidayFrameValue
"Multi-day frame"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySingledayDatetimeText
"Single day date and time text"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySingledayFrameText
"Single day frame text"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySingledayFrameValue
"Single day frame"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyStillTimeText
"Still time text"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyStillTimeValue
"Still time"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyStillDateText
"Still date text"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyStillDateValue
"Still date"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyLightingPresetIndex
"Lighting presets combo"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyMultidayPresetIndex
"Multi-day presets combo"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySingledayPresetIndex
"Single day presets combo"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyStillPresetIndex
"Still presets combo"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyShadowsIntensityText
"Shadows intensity text"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyShadowsIntensityValue
"Shadows intensity"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySunIntensityText
"Sun intensity text"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySunIntensityValue
"Sun intensity"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyAnimationSpeedText
"Loop animation speed"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyAnimationSpeedValue
"Loop animation speed"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyIsLightingStudyType
"Lighting study"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyIsMultidayStudyType
"Multi-day study"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyIsSingledayStudyType
"Single day study"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyIsStillimageStudyType
"Still image study"

Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyCurrentStudyTypeIndex
"Study type"

Autodesk.Revit.DB.ParameterTypeId.ViewUnderlayTopId
"Range: Top Level"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSunPathSize
"Sun path size (%)"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSunPath
"Sun Path"

Autodesk.Revit.DB.ParameterTypeId.ViewAnalysisDisplayStyle
"Default Analysis Display Style"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedLevelRelativeBaseType
"Elevation Base for Levels"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedHiddenLevels
"Hidden Levels"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedTotalRows
"Total Segments"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedRowsCount
"Segments in Viewport"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedGridAppearance
"Grid Appearance"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedTextAppearance
"Text Appearance"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedTitle
"Title"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedRowsFrom
"Segment Start in Viewport"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedGroupSimilar
"Group Similar Locations"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedMaterialTypes
"Material Types"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedLocationsHigh
"Column Locations End"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedLocationsLow
"Column Locations Start"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedBottomLevel
"Bottom Level"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedTopLevel
"Top Level"

Autodesk.Revit.DB.ParameterTypeId.ViewportAttrOrientationOnSheet
"Rotation on Sheet"

Autodesk.Revit.DB.ParameterTypeId.ViewportAttrShowBox
"Show Box"

Autodesk.Revit.DB.ParameterTypeId.ViewportAttrShowExtensionLine
"Show Extension Line"

Autodesk.Revit.DB.ParameterTypeId.ViewportAttrShowLabel
"Show Title"

Autodesk.Revit.DB.ParameterTypeId.ViewportAttrLabelTag
"Title"

Autodesk.Revit.DB.ParameterTypeId.ViewScaleHavename
"Display Name"

Autodesk.Revit.DB.ParameterTypeId.ViewScaleCustomname
"Display Name"

Autodesk.Revit.DB.ParameterTypeId.ViewportAttrPreserveTitlePosition
"Preserve Title Position"

Autodesk.Revit.DB.ParameterTypeId.ViewportPositioning
"Viewport Positioning"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedOffGrid
"Include Off-Grid Columns"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedUnitsFormat
"Off-Grid Units Format"

Autodesk.Revit.DB.ParameterTypeId.ViewportSheetName
"Sheet Name"

Autodesk.Revit.DB.ParameterTypeId.ViewportSheetNumber
"Sheet Number"

Autodesk.Revit.DB.ParameterTypeId.ViewportScale
"View Scale"

Autodesk.Revit.DB.ParameterTypeId.ViewportViewName
"View Name"

Autodesk.Revit.DB.ParameterTypeId.ViewportView
"View"

Autodesk.Revit.DB.ParameterTypeId.ViewportDetailNumber
"Detail Number"

Autodesk.Revit.DB.ParameterTypeId.ViewTemplateForSchedule
"View Template"

Autodesk.Revit.DB.ParameterTypeId.RenderRpcProperties
"Render Appearance Properties"

Autodesk.Revit.DB.ParameterTypeId.FamilySymbolicRep
"Symbolic Representation"

Autodesk.Revit.DB.ParameterTypeId.FamilyRenderingType
"Render Appearance Source"

Autodesk.Revit.DB.ParameterTypeId.RenderRpcFilename
"Render Appearance"

Autodesk.Revit.DB.ParameterTypeId.RenderPlantTrimHeight
"Plant Trim Height"

Autodesk.Revit.DB.ParameterTypeId.RenderPlantHeight
"Height"

Autodesk.Revit.DB.ParameterTypeId.RenderPlantName
"Plant Name"

Autodesk.Revit.DB.ParameterTypeId.ViewCameraOrientation
"Locked Orientation"

Autodesk.Revit.DB.ParameterTypeId.ColorSchemeLocation
"Color Scheme Location"

Autodesk.Revit.DB.ParameterTypeId.ViewDependency
"Dependency"

Autodesk.Revit.DB.ParameterTypeId.ViewBackClipping
"Depth Clipping"

Autodesk.Revit.DB.ParameterTypeId.ViewAssociatedAssemblyInstanceId
"Associated Assembly Instance"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedTotalColumns
"Total Column Locations"

Autodesk.Revit.DB.ParameterTypeId.ViewUnderlayOrientation
"Underlay Orientation"

Autodesk.Revit.DB.ParameterTypeId.ViewTemplate
"View Template"

Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedNumberColumns
"Column Locations per Segment"

Autodesk.Revit.DB.ParameterTypeId.GraphicDisplayOptions
"Graphic Display Options"

Autodesk.Revit.DB.ParameterTypeId.ModelGraphicsStyleAnonDraft
"Visual Style"

Autodesk.Revit.DB.ParameterTypeId.ViewReferencingDetail
"Referencing Detail"

Autodesk.Revit.DB.ParameterTypeId.ViewReferencingSheet
"Referencing Sheet"

Autodesk.Revit.DB.ParameterTypeId.ViewCameraPosition
"Camera Position"

Autodesk.Revit.DB.ParameterTypeId.PlanViewNorth
"Orientation"

Autodesk.Revit.DB.ParameterTypeId.WalkthroughFramesCount
"Walkthrough Frames"

Autodesk.Revit.DB.ParameterTypeId.PlanViewLevel
"Associated Level"

Autodesk.Revit.DB.ParameterTypeId.ModelGraphicsStyle
"Visual Style"

Autodesk.Revit.DB.ParameterTypeId.ViewVisibleCategories
"Visibility/Graphics Overrides"

Autodesk.Revit.DB.ParameterTypeId.ViewDiscipline
"Discipline"

Autodesk.Revit.DB.ParameterTypeId.PlanViewRange
"View Range"

Autodesk.Revit.DB.ParameterTypeId.ViewModelDisplayMode
"Display Model"

Autodesk.Revit.DB.ParameterTypeId.ViewShowMassing
"Show Mass"

Autodesk.Revit.DB.ParameterTypeId.PlanViewTopClipHeight
"Top Clip Height"

Autodesk.Revit.DB.ParameterTypeId.ViewCleanJoins
"Wall Join Display"

Autodesk.Revit.DB.ParameterTypeId.ViewSheetViewportInfo
"Viewport"

Autodesk.Revit.DB.ParameterTypeId.PlanViewCutPlaneHeight
"Cut Plane Height"

Autodesk.Revit.DB.ParameterTypeId.ViewDepth
"View Depth"

Autodesk.Revit.DB.ParameterTypeId.ViewUnderlayBottomId
"Range: Base Level"

Autodesk.Revit.DB.ParameterTypeId.ViewScalePulldownImperial
"View Scale"

Autodesk.Revit.DB.ParameterTypeId.ViewScalePulldownMetric
"View Scale"

Autodesk.Revit.DB.ParameterTypeId.ViewScale
"Scale Value    1:"

Autodesk.Revit.DB.ParameterTypeId.ViewSchemaSettingForSystem
"System Color Schemes"

Autodesk.Revit.DB.ParameterTypeId.ViewSchemaSettingForBuilding
"Color Scheme"

Autodesk.Revit.DB.ParameterTypeId.ViewFixedSketchPlane
"None"

Autodesk.Revit.DB.ParameterTypeId.GraphicDisplayOptionsPhotoExposure
"Photographic Exposure"

Autodesk.Revit.DB.ParameterTypeId.GraphicDisplayOptionsFog
"Depth Cueing"

Autodesk.Revit.DB.ParameterTypeId.GraphicDisplayOptionsBackground
"Background"

Autodesk.Revit.DB.ParameterTypeId.GraphicDisplayOptionsSsIntensity
"Sun and Shadow Intensity"

Autodesk.Revit.DB.ParameterTypeId.GraphicDisplayOptionsLighting
"Lighting"

Autodesk.Revit.DB.ParameterTypeId.GraphicDisplayOptionsShadows
"Shadows"

Autodesk.Revit.DB.ParameterTypeId.GraphicDisplayOptionsModel
"Model Display"

Autodesk.Revit.DB.ParameterTypeId.Viewer3dRenderSettings
"Rendering Settings"

Autodesk.Revit.DB.ParameterTypeId.ViewerBoundFarClipping
"Far Clipping"

Autodesk.Revit.DB.ParameterTypeId.ViewerReferenceLabelText
"Reference Label"

Autodesk.Revit.DB.ParameterTypeId.ViewerIsReference
"Is a Reference"

Autodesk.Revit.DB.ParameterTypeId.ViewerReferenceLabel
"Reference Label"

Autodesk.Revit.DB.ParameterTypeId.ViewDescription
"Title on Sheet"

Autodesk.Revit.DB.ParameterTypeId.ViewerModelClipBoxActive
"Section Box"

Autodesk.Revit.DB.ParameterTypeId.ViewName
"View Name"

Autodesk.Revit.DB.ParameterTypeId.ViewerBoundActiveNear
"Near Clip Active"

Autodesk.Revit.DB.ParameterTypeId.ViewerBoundActiveFar
"Far Clip Active"

Autodesk.Revit.DB.ParameterTypeId.ViewerBoundActiveBottom
"Bottom Clip Active"

Autodesk.Revit.DB.ParameterTypeId.ViewerBoundActiveTop
"Top Clip Active"

Autodesk.Revit.DB.ParameterTypeId.ViewerBoundActiveLeft
"Left Clip Active"

Autodesk.Revit.DB.ParameterTypeId.ViewerBoundActiveRight
"Right Clip Active"

Autodesk.Revit.DB.ParameterTypeId.ViewerBoundOffsetNear
"Near Clip Offset"

Autodesk.Revit.DB.ParameterTypeId.ViewerBoundOffsetFar
"Far Clip Offset"

Autodesk.Revit.DB.ParameterTypeId.ViewerBoundOffsetBottom
"Bottom Clip Offset"

Autodesk.Revit.DB.ParameterTypeId.ViewerBoundOffsetTop
"Top Clip Offset"

Autodesk.Revit.DB.ParameterTypeId.ViewerBoundOffsetLeft
"Left Clip Offset"

Autodesk.Revit.DB.ParameterTypeId.ViewerBoundOffsetRight
"Right Clip Offset"

Autodesk.Revit.DB.ParameterTypeId.ViewerAnnotationCropActive
"Annotation Crop"

Autodesk.Revit.DB.ParameterTypeId.ViewerShowUncropped
"Show uncropped"

Autodesk.Revit.DB.ParameterTypeId.ViewerCropRegionDisabled
"Crop View"

Autodesk.Revit.DB.ParameterTypeId.ViewerCropRegionVisible
"Crop Region Visible"

Autodesk.Revit.DB.ParameterTypeId.ViewerCropRegion
"Crop View"

Autodesk.Revit.DB.ParameterTypeId.ViewerPerspective
"Projection Mode"

Autodesk.Revit.DB.ParameterTypeId.ViewerTargetElevation
"Target Elevation"

Autodesk.Revit.DB.ParameterTypeId.ViewerOptionVisibility
"Visible In Option"

Autodesk.Revit.DB.ParameterTypeId.ViewerEyeElevation
"Eye Elevation"

Autodesk.Revit.DB.ParameterTypeId.DimLabelIsInstance
"Is Instance Parameter"

Autodesk.Revit.DB.ParameterTypeId.DimIsreporting
"Is Reporting"

Autodesk.Revit.DB.ParameterTypeId.DimLeader
"Leader"

Autodesk.Revit.DB.ParameterTypeId.DimDisplayEq
"Equality Display"

Autodesk.Revit.DB.ParameterTypeId.DimNotModifiable
"Non-modifiable"

Autodesk.Revit.DB.ParameterTypeId.DimLabel
"Label"

Autodesk.Revit.DB.ParameterTypeId.DimLabelGpShow
"Show Label in View"

Autodesk.Revit.DB.ParameterTypeId.DimValueAngle
"Value"

Autodesk.Revit.DB.ParameterTypeId.DimValueLength
"Value"

Autodesk.Revit.DB.ParameterTypeId.ElemReferenceName2dXz
"Is Reference"

Autodesk.Revit.DB.ParameterTypeId.CurveElemDefinesSlope
"Defines Beam System Slope"

Autodesk.Revit.DB.ParameterTypeId.RadialArrayArcRadius
"Radius"

Autodesk.Revit.DB.ParameterTypeId.CurveDeterminesOrientation
"Determines Orientation"

Autodesk.Revit.DB.ParameterTypeId.DatumPlaneDefinesWallClosure
"Wall Closure"

Autodesk.Revit.DB.ParameterTypeId.CurveIsDetail
"Detail Line"

Autodesk.Revit.DB.ParameterTypeId.CurveElemArcRadius
"Radius"

Autodesk.Revit.DB.ParameterTypeId.CurveElemArcRange
"Range"

Autodesk.Revit.DB.ParameterTypeId.CurveElemArcEndAngle
"Angle 2"

Autodesk.Revit.DB.ParameterTypeId.CurveElemArcStartAngle
"Angle 1"

Autodesk.Revit.DB.ParameterTypeId.CurveElemLineAngle
"Angle"

Autodesk.Revit.DB.ParameterTypeId.CurveElemLength
"Length"

Autodesk.Revit.DB.ParameterTypeId.ElemDeletableInFamily
"Deletable"

Autodesk.Revit.DB.ParameterTypeId.ElemReferenceName
"Is Reference"

Autodesk.Revit.DB.ParameterTypeId.DatumPlaneDefinesOrigin
"Defines Origin"

Autodesk.Revit.DB.ParameterTypeId.ElemIsReference
"Reference"

Autodesk.Revit.DB.ParameterTypeId.AssociatedLevelOffset
"Associated Level Offset": The offset from the associated level.

Autodesk.Revit.DB.ParameterTypeId.AssociatedLevel
"Associated Level": The level associated with this cell.

Autodesk.Revit.DB.ParameterTypeId.ColumnLocationMark
"Column Location Mark"

Autodesk.Revit.DB.ParameterTypeId.ColumnTopAttachCutParam
"Top Attachment Cut"

Autodesk.Revit.DB.ParameterTypeId.ColumnBaseAttachCutParam
"Base Attachment Cut"

Autodesk.Revit.DB.ParameterTypeId.ColumnBaseAttachedParam
"Base is Attached"

Autodesk.Revit.DB.ParameterTypeId.ColumnTopAttachedParam
"Top is Attached"

Autodesk.Revit.DB.ParameterTypeId.ColumnBaseAttachmentOffsetParam
"Offset From Attachment At Base"

Autodesk.Revit.DB.ParameterTypeId.ColumnTopAttachmentOffsetParam
"Offset From Attachment At Top"

Autodesk.Revit.DB.ParameterTypeId.ColumnBaseAttachJustificationParam
"Attachment Justification At Base"

Autodesk.Revit.DB.ParameterTypeId.ColumnTopAttachJustificationParam
"Attachment Justification At Top"

Autodesk.Revit.DB.ParameterTypeId.MaterialParamShininess
"Shininess"

Autodesk.Revit.DB.ParameterTypeId.MaterialParamSmoothness
"Smoothness"

Autodesk.Revit.DB.ParameterTypeId.MaterialParamGlow
"Glow"

Autodesk.Revit.DB.ParameterTypeId.MaterialParamTransparency
"Transparency"

Autodesk.Revit.DB.ParameterTypeId.MaterialParamColor
"Color"

Autodesk.Revit.DB.ParameterTypeId.SeekItemId
"Seek Item ID"

Autodesk.Revit.DB.ParameterTypeId.OmniclassDescription
"OmniClass Title"

Autodesk.Revit.DB.ParameterTypeId.OmniclassCode
"OmniClass Number"

Autodesk.Revit.DB.ParameterTypeId.UniformatDescription
"Assembly Description"

Autodesk.Revit.DB.ParameterTypeId.UniformatCode
"Assembly Code"

Autodesk.Revit.DB.ParameterTypeId.SlopeEndHeight
"Height Offset at Head"

Autodesk.Revit.DB.ParameterTypeId.SlopeStartHeight
"Height Offset at Tail"

Autodesk.Revit.DB.ParameterTypeId.CeilingHasThicknessParam
"Has Thickness"

Autodesk.Revit.DB.ParameterTypeId.CeilingThicknessParam
"Thickness"

Autodesk.Revit.DB.ParameterTypeId.CeilingHeightabovelevelParam
"Height Offset From Level"

Autodesk.Revit.DB.ParameterTypeId.CeilingThickness
"Thickness"

Autodesk.Revit.DB.ParameterTypeId.CeilingAttrSystemnameParam
"System"

Autodesk.Revit.DB.ParameterTypeId.CeilingAttrSpacing2Param
"Spacing Axis 2"

Autodesk.Revit.DB.ParameterTypeId.CeilingAttrSpacing1Param
"Spacing Axis 1"

Autodesk.Revit.DB.ParameterTypeId.CeilingAttrPatternParam
"Pattern"

Autodesk.Revit.DB.ParameterTypeId.CeilingAttrDefaultHeightParam
"Default Height above level"

Autodesk.Revit.DB.ParameterTypeId.FilledRegionMasking
"Masking"

Autodesk.Revit.DB.ParameterTypeId.BackgroundPatternColorParam
"Background Pattern Color"

Autodesk.Revit.DB.ParameterTypeId.ForegroundPatternColorParam
"Foreground Pattern Color"

Autodesk.Revit.DB.ParameterTypeId.BackgroundDraftPatternIdParam
"Background Fill Pattern"

Autodesk.Revit.DB.ParameterTypeId.ForegroundAnyPatternIdParam
"Foreground Fill Pattern"

Autodesk.Revit.DB.ParameterTypeId.ForegroundDraftPatternIdParam
"Foreground Fill Pattern"

Autodesk.Revit.DB.ParameterTypeId.BuilidingPadStructureIdParam
"Structure"

Autodesk.Revit.DB.ParameterTypeId.CeilingStructureIdParam
"Structure"

Autodesk.Revit.DB.ParameterTypeId.RoofStructureIdParam
"Structure"

Autodesk.Revit.DB.ParameterTypeId.FloorStructureIdParam
"Structure"

Autodesk.Revit.DB.ParameterTypeId.AnyPatternIdParamNoNo
"Fill Pattern"

Autodesk.Revit.DB.ParameterTypeId.FillPatternIdParamNoNo
"Fill Pattern"

Autodesk.Revit.DB.ParameterTypeId.ObjectStyleMaterialIdParam
"Object Style Material"

Autodesk.Revit.DB.ParameterTypeId.WrappingAtInsertsParam
"Wrapping at Inserts"

Autodesk.Revit.DB.ParameterTypeId.WrappingAtEndsParam
"Wrapping at Ends"

Autodesk.Revit.DB.ParameterTypeId.CoarseScaleFillPatternColor
"Coarse Scale Fill Color"

Autodesk.Revit.DB.ParameterTypeId.ModelCategoryIdParam
"Subcategory"

Autodesk.Revit.DB.ParameterTypeId.HostIdParam
"Host Id"

Autodesk.Revit.DB.ParameterTypeId.MaterialIdParam
"Material"

Autodesk.Revit.DB.ParameterTypeId.CoarseScaleFillPatternIdParam
"Coarse Scale Fill Pattern"

Autodesk.Revit.DB.ParameterTypeId.AnyPatternIdParam
"Fill Pattern"

Autodesk.Revit.DB.ParameterTypeId.WallStructureIdParam
"Structure"

Autodesk.Revit.DB.ParameterTypeId.SurfacePatternIdParam
"Surface fill pattern"

Autodesk.Revit.DB.ParameterTypeId.FillPatternIdParam
"Cut fill pattern"

Autodesk.Revit.DB.ParameterTypeId.IdParam
"Id"

Autodesk.Revit.DB.ParameterTypeId.SelectionEditableOnly
"Editable only"

Autodesk.Revit.DB.ParameterTypeId.EditedBy
"Edited by"

Autodesk.Revit.DB.ParameterTypeId.ScheduleTopLevelOffsetParam
"Top Offset"

Autodesk.Revit.DB.ParameterTypeId.ScheduleBaseLevelOffsetParam
"Base Offset"

Autodesk.Revit.DB.ParameterTypeId.ScheduleTopLevelParam
"Top Level"

Autodesk.Revit.DB.ParameterTypeId.ScheduleBaseLevelParam
"Base Level"

Autodesk.Revit.DB.ParameterTypeId.ScheduleLevelParam
"Level"

Autodesk.Revit.DB.ParameterTypeId.ElemRoomId
"Room Id"

Autodesk.Revit.DB.ParameterTypeId.ElemRoomName
"Room Name"

Autodesk.Revit.DB.ParameterTypeId.ElemRoomNumber
"Room Number"

Autodesk.Revit.DB.ParameterTypeId.ElemPartitionParam
"Workset"

Autodesk.Revit.DB.ParameterTypeId.ElemFamilyAndTypeParam
"Family and Type"

Autodesk.Revit.DB.ParameterTypeId.ElemFamilyParam
"Family"

Autodesk.Revit.DB.ParameterTypeId.ElemTypeParam
"Type"

Autodesk.Revit.DB.ParameterTypeId.ElemTypeLabel
"Label"

Autodesk.Revit.DB.ParameterTypeId.BrOrgFilter
"Filter"

Autodesk.Revit.DB.ParameterTypeId.BrOrgFolders
"Folders"

Autodesk.Revit.DB.ParameterTypeId.SymbolFamilyAndTypeNamesParam
"Family and Type"

Autodesk.Revit.DB.ParameterTypeId.SymbolFamilyNameParam
"Family Name"

Autodesk.Revit.DB.ParameterTypeId.SymbolNameParam
"Type Name"

Autodesk.Revit.DB.ParameterTypeId.SymbolIdParam
"Type Id"

Autodesk.Revit.DB.ParameterTypeId.StructuralDisplayInHiddenViews
"Display in Hidden Views"

Autodesk.Revit.DB.ParameterTypeId.FloorParamSpanDirection
"Span Direction"

Autodesk.Revit.DB.ParameterTypeId.FloorParamIsStructural
"Structural"

Autodesk.Revit.DB.ParameterTypeId.HostPerimeterComputed
"Perimeter"

Autodesk.Revit.DB.ParameterTypeId.LevelParam
"Level"

Autodesk.Revit.DB.ParameterTypeId.FloorHeightabovelevelParam
"Height Offset From Level"

Autodesk.Revit.DB.ParameterTypeId.FloorAttrDefaultHeightParam
"Default Height above level"

Autodesk.Revit.DB.ParameterTypeId.FloorAttrDefaultThicknessParam
"Default Thickness"

Autodesk.Revit.DB.ParameterTypeId.FloorAttrThicknessParam
"Thickness"

Autodesk.Revit.DB.ParameterTypeId.InsertOrientation
"Orientation"

Autodesk.Revit.DB.ParameterTypeId.ProfileParamAlongPath
"Parameter along path"

Autodesk.Revit.DB.ParameterTypeId.ProfileFamTypePlusNone
"Profile"

Autodesk.Revit.DB.ParameterTypeId.Profile2Angle
"Angle"

Autodesk.Revit.DB.ParameterTypeId.Profile2FamType
"Profile"

Autodesk.Revit.DB.ParameterTypeId.Profile2FlippedHor
"Profile Is Flipped"

Autodesk.Revit.DB.ParameterTypeId.Profile2OffsetY
"Vertical Profile Offset"

Autodesk.Revit.DB.ParameterTypeId.Profile2OffsetX
"Horizontal Profile Offset"

Autodesk.Revit.DB.ParameterTypeId.Profile1Angle
"Angle"

Autodesk.Revit.DB.ParameterTypeId.Profile1FamType
"Profile"

Autodesk.Revit.DB.ParameterTypeId.Profile1FlippedHor
"Profile Is Flipped"

Autodesk.Revit.DB.ParameterTypeId.Profile1OffsetY
"Vertical Profile Offset"

Autodesk.Revit.DB.ParameterTypeId.Profile1OffsetX
"Horizontal Profile Offset"

Autodesk.Revit.DB.ParameterTypeId.FamProfileUsage
"Profile Usage"

Autodesk.Revit.DB.ParameterTypeId.SweepTrajSegmented
"Trajectory Segmentation"

Autodesk.Revit.DB.ParameterTypeId.SweepMaxSegAngle
"Maximum Segment Angle"

Autodesk.Revit.DB.ParameterTypeId.ModelOrSymbolic
"Model or Symbolic"

Autodesk.Revit.DB.ParameterTypeId.ProfileAngle
"Angle"

Autodesk.Revit.DB.ParameterTypeId.ProfileFamType
"Profile"

Autodesk.Revit.DB.ParameterTypeId.ProfileFlippedHor
"Profile Is Flipped"

Autodesk.Revit.DB.ParameterTypeId.ProfileOffsetY
"Vertical Profile Offset"

Autodesk.Revit.DB.ParameterTypeId.ProfileOffsetX
"Horizontal Profile Offset"

Autodesk.Revit.DB.ParameterTypeId.ExtrusionLength
"Depth"

Autodesk.Revit.DB.ParameterTypeId.CurveVisibilityParam
"Visibility/Graphics Overrides"

Autodesk.Revit.DB.ParameterTypeId.GeomVisibilityParam
"Visibility/Graphics Overrides"

Autodesk.Revit.DB.ParameterTypeId.ElementIsCutting
"Solid/Void"

Autodesk.Revit.DB.ParameterTypeId.ExtrusionAutoParams
"Auto ends"

Autodesk.Revit.DB.ParameterTypeId.BlendEndParam
"Second End"

Autodesk.Revit.DB.ParameterTypeId.BlendStartParam
"First End"

Autodesk.Revit.DB.ParameterTypeId.RevolutionEndAngle
"End Angle"

Autodesk.Revit.DB.ParameterTypeId.RevolutionStartAngle
"Start Angle"

Autodesk.Revit.DB.ParameterTypeId.ExtrusionEndParam
"Extrusion End"

Autodesk.Revit.DB.ParameterTypeId.ExtrusionStartParam
"Extrusion Start"

Autodesk.Revit.DB.ParameterTypeId.ScheduleTypeForBrowser
"Schedule Type"

Autodesk.Revit.DB.ParameterTypeId.ScheduleCategory
"Category"

Autodesk.Revit.DB.ParameterTypeId.FaceroofOffsetParam
"Level Offset"

Autodesk.Revit.DB.ParameterTypeId.FaceroofLevelParam
"Reference Level"

Autodesk.Revit.DB.ParameterTypeId.RoofFacesLocation
"Picked Faces Location"

Autodesk.Revit.DB.ParameterTypeId.RelatedToMass
"Related to Mass"

Autodesk.Revit.DB.ParameterTypeId.FasciaDepthParam
"Fascia Depth"

Autodesk.Revit.DB.ParameterTypeId.RoofEaveCutParam
"Rafter Cut"

Autodesk.Revit.DB.ParameterTypeId.RoofRafterOrTrussParam
"Rafter or Truss"

Autodesk.Revit.DB.ParameterTypeId.RoofBaseLevelParam
"Base Level"

Autodesk.Revit.DB.ParameterTypeId.CurveWallOffsetRoofs
"Overhang"

Autodesk.Revit.DB.ParameterTypeId.CurveWallOffset
"Wall offset"

Autodesk.Revit.DB.ParameterTypeId.ActualMaxRidgeHeightParam
"Maximum Ridge Height"

Autodesk.Revit.DB.ParameterTypeId.RoofUptoLevelOffsetParam
"Cutoff Offset"

Autodesk.Revit.DB.ParameterTypeId.RoofUptoLevelParam
"Cutoff Level"

Autodesk.Revit.DB.ParameterTypeId.RoofLevelOffsetParam
"Base Offset From Level"

Autodesk.Revit.DB.ParameterTypeId.StructuralElevationAtBottomSurvey
"Elevation at Bottom Survey"

Autodesk.Revit.DB.ParameterTypeId.StructuralElevationAtTopSurvey
"Elevation at Top Survey"

Autodesk.Revit.DB.ParameterTypeId.StructuralFloorCoreThickness
"Core Thickness"

Autodesk.Revit.DB.ParameterTypeId.StructuralElevationAtBottomCore
"Elevation at Bottom Core"

Autodesk.Revit.DB.ParameterTypeId.StructuralElevationAtTopCore
"Elevation at Top Core"

Autodesk.Revit.DB.ParameterTypeId.StructuralReferenceLevelElevation
"Reference Level Elevation"

Autodesk.Revit.DB.ParameterTypeId.RoofConstraintOffsetParam
"Level Offset"

Autodesk.Revit.DB.ParameterTypeId.RoofConstraintLevelParam
"Reference Level"

Autodesk.Revit.DB.ParameterTypeId.HostSseCurvedEdgeConditionParam
"Curved Edge Condition"

Autodesk.Revit.DB.ParameterTypeId.RoofAttrThicknessParam
"Thickness"

Autodesk.Revit.DB.ParameterTypeId.RoofAttrDefaultThicknessParam
"Default Thickness"

Autodesk.Revit.DB.ParameterTypeId.StructuralElevationAtTop
"Elevation at Top"

Autodesk.Revit.DB.ParameterTypeId.NodeConnectionStatus
"Connection Status"

Autodesk.Revit.DB.ParameterTypeId.WallStructuralSignificant
"Structural"

Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalBeamRigidLink
"Analytical Links"

Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalColumnHorizontalProjectionPlane
"Horizontal Projection"

Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalBeamHorizontalProjectionPlane
"Horizontal Projection"

Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingBreakAtInsertsDisable
"Do Not Break At Inserts"

Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingDefaultEndExtensionLength
"Default End Extension Length"

Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalTessellate
"Approximate curve"

Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalTessDeviation
"Maximum discretized offset"

Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalHardPoints
"Use hard-points"

Autodesk.Revit.DB.ParameterTypeId.StructuralBendDirAngle
"Cross-Section Rotation"

Autodesk.Revit.DB.ParameterTypeId.StructuralDisplayInHiddenViewsColumn
"Display in Hidden Views"

Autodesk.Revit.DB.ParameterTypeId.StructuralDisplayInHiddenViewsFraming
"Display in Hidden Views"

Autodesk.Revit.DB.ParameterTypeId.StructuralFloorAnalyzesAs
"Analyze As"

Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyzesAs
"Analyze As"

Autodesk.Revit.DB.ParameterTypeId.StructuralBeamCutbackForColumn
"Beam cutback in plan"

Autodesk.Revit.DB.ParameterTypeId.BeamVJustificationOtherValue
"z-Direction Offset Value"

Autodesk.Revit.DB.ParameterTypeId.StructuralBeamOrientation
"Orientation"

Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEnd1Elevation
"End Level Offset"

Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEnd0Elevation
"Start Level Offset"

Autodesk.Revit.DB.ParameterTypeId.FamilyExportAsGeometry
"Always export as geometry"

Autodesk.Revit.DB.ParameterTypeId.StructuralFoundationLength
"Length"

Autodesk.Revit.DB.ParameterTypeId.StructuralFoundationWidth
"Width"

Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingLength
"Length"

Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingEccentricity
"Eccentricity"

Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingStructuralUsage
"Structural Usage"

Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingBearingWidth
"Width"

Autodesk.Revit.DB.ParameterTypeId.StructuralElevationAtBottom
"Elevation at Bottom"

Autodesk.Revit.DB.ParameterTypeId.FamilyStructFootingUseCapTop
"Cap"

Autodesk.Revit.DB.ParameterTypeId.StructuralCopingDistance
"Coping Distance"

Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingWidth
"Width"

Autodesk.Revit.DB.ParameterTypeId.StructuralFoundationThickness
"Foundation Thickness"

Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingBottomHeel
"Bottom Heel Length"

Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingTopHeel
"Heel Length"

Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingBottomToe
"Bottom Toe Length"

Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingTopToe
"Toe Length"

Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalModel
"Enable Analytical Model"

Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalColumnRigidLink
"Analytical Links"

Autodesk.Revit.DB.ParameterTypeId.FamilyStructMaterialType
"Material for Model Behavior"

Autodesk.Revit.DB.ParameterTypeId.StructuralBottomReleaseMz
"Base Mz"

Autodesk.Revit.DB.ParameterTypeId.StructuralBottomReleaseMy
"Base My"

Autodesk.Revit.DB.ParameterTypeId.StructuralBottomReleaseMx
"Base Mx"

Autodesk.Revit.DB.ParameterTypeId.StructuralBottomReleaseFz
"Base Fz"

Autodesk.Revit.DB.ParameterTypeId.StructuralBottomReleaseFy
"Base Fy"

Autodesk.Revit.DB.ParameterTypeId.StructuralBottomReleaseFx
"Base Fx"

Autodesk.Revit.DB.ParameterTypeId.StructuralTopReleaseMz
"Top Mz"

Autodesk.Revit.DB.ParameterTypeId.StructuralTopReleaseMy
"Top My"

Autodesk.Revit.DB.ParameterTypeId.StructuralTopReleaseMx
"Top Mx"

Autodesk.Revit.DB.ParameterTypeId.StructuralTopReleaseFz
"Top Fz"

Autodesk.Revit.DB.ParameterTypeId.StructuralTopReleaseFy
"Top Fy"

Autodesk.Revit.DB.ParameterTypeId.StructuralTopReleaseFx
"Top Fx"

Autodesk.Revit.DB.ParameterTypeId.StructuralBottomReleaseType
"Base Release"

Autodesk.Revit.DB.ParameterTypeId.StructuralTopReleaseType
"Top Release"

Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalProjectMemberPlaneColumnBottom
"Bottom Vertical Projection"

Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalProjectMemberPlaneColumnTop
"Top Vertical Projection"

Autodesk.Revit.DB.ParameterTypeId.StructuralMaterialType
"Structural Material Type"

Autodesk.Revit.DB.ParameterTypeId.StructuralCamber
"Camber Size"

Autodesk.Revit.DB.ParameterTypeId.StructuralNumberOfStuds
"Number of studs"

Autodesk.Revit.DB.ParameterTypeId.StructuralEndReleaseMz
"End Mz"

Autodesk.Revit.DB.ParameterTypeId.StructuralEndReleaseMy
"End My"

Autodesk.Revit.DB.ParameterTypeId.StructuralEndReleaseMx
"End Mx"

Autodesk.Revit.DB.ParameterTypeId.StructuralEndReleaseFz
"End Fz"

Autodesk.Revit.DB.ParameterTypeId.StructuralEndReleaseFy
"End Fy"

Autodesk.Revit.DB.ParameterTypeId.StructuralEndReleaseFx
"End Fx"

Autodesk.Revit.DB.ParameterTypeId.StructuralStartReleaseMz
"Start Mz"

Autodesk.Revit.DB.ParameterTypeId.StructuralStartReleaseMy
"Start My"

Autodesk.Revit.DB.ParameterTypeId.StructuralStartReleaseMx
"Start Mx"

Autodesk.Revit.DB.ParameterTypeId.StructuralStartReleaseFz
"Start Fz"

Autodesk.Revit.DB.ParameterTypeId.StructuralStartReleaseFy
"Start Fy"

Autodesk.Revit.DB.ParameterTypeId.StructuralStartReleaseFx
"Start Fx"

Autodesk.Revit.DB.ParameterTypeId.StructuralEndReleaseType
"End Release"

Autodesk.Revit.DB.ParameterTypeId.StructuralStartReleaseType
"Start Release"

Autodesk.Revit.DB.ParameterTypeId.StructuralWallBottomProjectionPlane
"Bottom Vertical Projection"

Autodesk.Revit.DB.ParameterTypeId.StructuralWallTopProjectionPlane
"Top Vertical Projection"

Autodesk.Revit.DB.ParameterTypeId.StructuralWallProjectionSurface
"Horizontal Projection"

Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalProjectFloorPlane
"Vertical Projection"

Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalProjectMemberPlane
"Vertical Projection"

Autodesk.Revit.DB.ParameterTypeId.StructuralBraceRepresentation
"Representation Type"

Autodesk.Revit.DB.ParameterTypeId.StructuralStickSymbolLocation
"Stick Symbol Location"

Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEndSupport
"Beam End Pocket Seat"

Autodesk.Revit.DB.ParameterTypeId.StructuralBeamStartSupport
"Beam Start Pocket Seat"

Autodesk.Revit.DB.ParameterTypeId.WindowTypeId
"Type Mark"

Autodesk.Revit.DB.ParameterTypeId.WallSweepOrientation
"Orientation"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndValueElevation
"End Attachment Elevation"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartValueElevation
"Start Attachment Elevation"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndLevelReference
"End Attachment Level Reference"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartLevelReference
"Start Attachment Level Reference"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndValueRatio
"End attachment ratio"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartValueRatio
"Start Attachment Ratio"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndRefelementEnd
"End of Attachment to Reference Element"

Autodesk.Revit.DB.ParameterTypeId.TypeWallClosure
"Wall Closure"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartRefelementEnd
"Start of Attachment to Reference Element"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndValueDistance
"End Attachment Distance"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartValueDistance
"Start Attachment Distance"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndType
"End Attachment Type"

Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartType
"Start Attachment Type"

Autodesk.Revit.DB.ParameterTypeId.StructuralFrameCutLength
"Cut Length"

Autodesk.Revit.DB.ParameterTypeId.InstanceReferenceLevelParam
"Reference Level"

Autodesk.Revit.DB.ParameterTypeId.InstanceStructUsageParam
"Structural Usage"

Autodesk.Revit.DB.ParameterTypeId.SketchPlaneParam
"Work Plane"

Autodesk.Revit.DB.ParameterTypeId.InstanceLengthParam
"Length"

Autodesk.Revit.DB.ParameterTypeId.InstanceMovesWithGridParam
"Moves With Grids"

Autodesk.Revit.DB.ParameterTypeId.InstanceOffsetPosParam
"Moves With Nearby Elements"

Autodesk.Revit.DB.ParameterTypeId.InstanceScheduleOnlyLevelParam
"Schedule Level"

Autodesk.Revit.DB.ParameterTypeId.InstanceFreeHostOffsetParam
"Offset from Host"

Autodesk.Revit.DB.ParameterTypeId.InstanceFreeHostParam
"Host"

Autodesk.Revit.DB.ParameterTypeId.InstanceHeadHeightParam
"Head Height"

Autodesk.Revit.DB.ParameterTypeId.InstanceSillHeightParam
"Sill Height"

Autodesk.Revit.DB.ParameterTypeId.InstanceElevationParam
"Elevation from Level"

Autodesk.Revit.DB.ParameterTypeId.FamilyTopLevelOffsetParam
"Top Offset"

Autodesk.Revit.DB.ParameterTypeId.FamilyBaseLevelOffsetParam
"Base Offset"

Autodesk.Revit.DB.ParameterTypeId.FamilyLevelParam
"Level"

Autodesk.Revit.DB.ParameterTypeId.FamilyTopLevelParam
"Top Level"

Autodesk.Revit.DB.ParameterTypeId.FamilyBaseLevelParam
"Base Level"

Autodesk.Revit.DB.ParameterTypeId.FamilyRfaPathPseudoParam
"File Path"

Autodesk.Revit.DB.ParameterTypeId.FamilyCategoryPseudoParam
"Category"

Autodesk.Revit.DB.ParameterTypeId.FamilyNamePseudoParam
"Family"

Autodesk.Revit.DB.ParameterTypeId.FamilyUsagePseudoParam
"Usage"

Autodesk.Revit.DB.ParameterTypeId.FamilyWpbDefaultElevation
"Default Elevation"

Autodesk.Revit.DB.ParameterTypeId.FamilyLineLengthParam
"Length"

Autodesk.Revit.DB.ParameterTypeId.FamilyRoughWidthParam
"Rough Width"

Autodesk.Revit.DB.ParameterTypeId.FamilyRoughHeightParam
"Rough Height"

Autodesk.Revit.DB.ParameterTypeId.FamilyWindowInsetParam
"Inset"

Autodesk.Revit.DB.ParameterTypeId.FamilyThicknessParam
"Thickness"

Autodesk.Revit.DB.ParameterTypeId.FamilyWidthParam
"Width"

Autodesk.Revit.DB.ParameterTypeId.FamilyHeightParam
"Height"

Autodesk.Revit.DB.ParameterTypeId.DoorEvacuationExitType
"Exit Access"

Autodesk.Revit.DB.ParameterTypeId.DoorOperationType
"Operation"

Autodesk.Revit.DB.ParameterTypeId.DoorFrameMaterial
"Frame Material"

Autodesk.Revit.DB.ParameterTypeId.DoorFrameType
"Frame Type"

Autodesk.Revit.DB.ParameterTypeId.DoorFinish
"Finish"

Autodesk.Revit.DB.ParameterTypeId.DoorConstructionType
"Construction Type"

Autodesk.Revit.DB.ParameterTypeId.FireRating
"Fire Rating"

Autodesk.Revit.DB.ParameterTypeId.DoorCost
"Cost"

Autodesk.Revit.DB.ParameterTypeId.DoorNumber
"Mark"

Autodesk.Revit.DB.ParameterTypeId.DpartOriginalCategoryId
"Original Category"

Autodesk.Revit.DB.ParameterTypeId.DpartLayerConstruction
"Construction"

Autodesk.Revit.DB.ParameterTypeId.DpartPhaseDemolishedByOriginal
"Phase Demolished By Original"

Autodesk.Revit.DB.ParameterTypeId.DpartPhaseCreatedByOriginal
"Phase Created By Original"

Autodesk.Revit.DB.ParameterTypeId.DpartLengthComputed
"Length"

Autodesk.Revit.DB.ParameterTypeId.DpartHeightComputed
"Height"

Autodesk.Revit.DB.ParameterTypeId.DpartLayerWidth
"Thickness"

Autodesk.Revit.DB.ParameterTypeId.DpartAreaComputed
"Area"

Autodesk.Revit.DB.ParameterTypeId.DpartOriginalType
"Original Type"

Autodesk.Revit.DB.ParameterTypeId.OffsetfacesShowShapeHandles
"Show Shape Handles"

Autodesk.Revit.DB.ParameterTypeId.DpartLayerFunction
"Layer Function"

Autodesk.Revit.DB.ParameterTypeId.DpartVolumeComputed
"Volume"

Autodesk.Revit.DB.ParameterTypeId.DpartMaterialByOriginal
"Material By Original"

Autodesk.Revit.DB.ParameterTypeId.DpartMaterialIdParam
"Material"

Autodesk.Revit.DB.ParameterTypeId.DpartOriginalFamily
"Original Family"

Autodesk.Revit.DB.ParameterTypeId.DpartOriginalCategory
"Original Category"

Autodesk.Revit.DB.ParameterTypeId.HostPanelScheduleAsPanelParam
"Categorize as"

Autodesk.Revit.DB.ParameterTypeId.WallLocationLineOffsetParam
"Location Line Offset"

Autodesk.Revit.DB.ParameterTypeId.WallKeyRefParam
"Location Line"

Autodesk.Revit.DB.ParameterTypeId.MeasureFromStructure
"Extend into wall (to core)"

Autodesk.Revit.DB.ParameterTypeId.WallStructuralUsageParam
"Structural Usage"

Autodesk.Revit.DB.ParameterTypeId.WallBottomIsAttached
"Base is Attached"

Autodesk.Revit.DB.ParameterTypeId.WallTopIsAttached
"Top is Attached"

Autodesk.Revit.DB.ParameterTypeId.WallTopOffset
"Top Offset"

Autodesk.Revit.DB.ParameterTypeId.WallBaseOffset
"Base Offset"

Autodesk.Revit.DB.ParameterTypeId.WallBaseConstraint
"Base Constraint"

Autodesk.Revit.DB.ParameterTypeId.WallUserHeightParam
"Unconnected Height"

Autodesk.Revit.DB.ParameterTypeId.WallHeightType
"Top Constraint"

Autodesk.Revit.DB.ParameterTypeId.WallBaseHeightParam
"Base height"

Autodesk.Revit.DB.ParameterTypeId.AllowAutoEmbed
"Automatically Embed"

Autodesk.Revit.DB.ParameterTypeId.WallAttrRoomBounding
"Room Bounding"

Autodesk.Revit.DB.ParameterTypeId.FunctionParam
"Function"

Autodesk.Revit.DB.ParameterTypeId.WallAttrDefheightParam
"Default height"

Autodesk.Revit.DB.ParameterTypeId.WallAttrHeightParam
"Height"

Autodesk.Revit.DB.ParameterTypeId.WallAttrWidthParam
"Width"